{
    "Part 1": "{\n    \"Part 1\": \"Demographic and Clinical Characteristics of Sarcoma Patients\",\n    \"introduction\": \"This section presents the demographic and clinical characteristics of patients enrolled in the study, focusing on the distribution of soft tissue sarcomas (STS) and gastrointestinal stromal tumors (GIST). The information is vital for understanding the patient population and the context of the study's findings regarding the immunologic landscape of sarcomas.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Description of patient demographics:\\n\\u2460 Data Collection:\\n(1) The study included a total of 253 patients with localized STS and GIST, managed in expert centers of the French Sarcoma Group (FSG) between July 1991 and November 2011. \\n(2) Patient characteristics, including age, sex, and ethnicity, were extracted from clinical databases such as Conticabase and Conticagist, and medical records to ensure accuracy and reliability. Specific criteria for inclusion in the study were adhered to, including confirmed diagnoses based on histology, immunohistochemistry, and molecular genetics when necessary. This rigorous data collection process ensures that the demographic information accurately reflects the patient population studied.\",\n        \"original text\": \"The study included a total of 253 localized STS and gastrointestinal stromal tumor (GIST); 85 were STS with complex genetics (SCG), 60 gastrointestinal stromal tumors (GIST), 58 synovial sarcomas (SS) and 50 myxoid liposarcoma (MLPS)...\",\n        \"results\": \"The total number of patients included in the study was 253, with specific breakdowns of histological subtypes as follows: 85 (34%) SCG, 60 (23%) GIST, 58 (23%) SS, and 50 (20%) MLPS.\",\n        \"results original text\": \"This study included a total of 253 localized STS and gastrointestinal stromal tumor (GIST); 85 were STS with complex genetics (SCG), 60 gastrointestinal stromal tumors (GIST), 58 synovial sarcomas (SS) and 50 myxoid liposarcoma (MLPS)...\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Overview of tumor characteristics:\\n\\u2460 Tumor Localization:\\n(1) The distribution of tumor localization was related to histological subtypes, documented with detailed records of tumor locations. This information is crucial for understanding the anatomical prevalence of different sarcoma types. \\n\\u2461 Tumor Size:\\n(1) Tumor size was categorized as \\u22645 cm or >5 cm, with most tumors being above 5 cm, to facilitate analysis. Specific methods for measurement include imaging techniques such as MRI or CT scans, and physical examinations. \\n\\u2462 Tumor Grade:\\n(1) Grading followed the FNCLCC system for STS and the AFIP system for GIST, with a summary of the distribution of grades provided. This includes specific definitions of grade I, II, and III tumors, which are critical for assessing prognosis and treatment strategies.\",\n        \"original text\": \"As expected, the distribution of tumor localization is related to histological subtypes. Tumor size was above 5 cm in the majority of cases... Histological grading was established according to the F\\u00e9d\\u00e9ration Nationale des Centers de Lutte Contre le Cancer (FNCLCC) system...\",\n        \"results\": \"The majority of tumors were found to be >5 cm, with specific localization patterns corresponding to histological subtypes. The grading system utilized was FNCLCC for STS and AFIP for GIST, contributing to the understanding of tumor characteristics.\",\n        \"results original text\": \"Tumor size was above 5 cm in the majority of cases. After a median follow-up of more than 3 y, 36 (15%) of patients had presented a local relapse and 86 (34%) a metastatic recurrence.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Summary of disease outcomes:\\n\\u2460 Follow-Up:\\n(1) After a median follow-up of more than 3 years, local and metastatic relapse data were collected to evaluate disease progression and outcomes. The follow-up process included regular clinical evaluations and imaging studies to monitor for recurrences. \\n\\u2461 Relapse Rates:\\n(1) 36 (15%) of patients had local relapses, while 86 (34%) experienced metastatic recurrences, providing insights into the prognosis of the patient cohort. Detailed statistics regarding the timing and nature of relapses were also documented to aid in future analyses. This information is essential for understanding the effectiveness of treatment strategies and for guiding future clinical trials.\",\n        \"original text\": \"After a median follow-up of more than 3 y, 36 (15%) of patients had presented a local relapse and 86 (34%) a metastatic recurrence.\",\n        \"results\": \"Overall, the follow-up data indicated that 36 patients (15%) experienced local relapses, while 86 patients (34%) had metastatic recurrences, highlighting the aggressive nature of the disease and the challenges in treatment efficacy.\",\n        \"results original text\": \"After a median follow-up of more than 3 y, 36 (15%) of patients had presented a local relapse and 86 (34%) a metastatic recurrence.\"\n    }\n}",
    "Part 2": "{\n    \"Part 2\": \"Immune Landscape Analysis of Sarcomas\",\n    \"Introduction\": {\n        \"overview\": \"This section outlines the experimental protocol used to analyze the immune landscape of various sarcoma subtypes. The focus is on assessing immune checkpoint and membrane marker expression to guide potential immunotherapy approaches.\"\n    },\n    \"step 1\": {\n        \"implementation details\": \"I. Analysis of immune checkpoint and membrane marker expression across different sarcoma subtypes: \\n \\u2460 A total of 253 cases of soft tissue sarcomas (STS) were included in the analysis, consisting of 85 sarcomas with complex genetics (SCG), 60 gastrointestinal stromal tumors (GIST), 58 synovial sarcomas (SS), and 50 myxoid liposarcomas (MLPS). \\n \\u2461 The gene expression profile of 93 immune checkpoint (ICP) and membrane markers (MM) genes was assessed using Agilent Whole Human Genome Microarrays (4x44K). \\n \\u2462 Unsupervised hierarchical clustering was performed based on gene expression levels using Pearson correlation for distance measurement and Ward's method for linkage to categorize patients according to their histological subgroups. \\n \\u2463 Each step of this analysis is pivotal in identifying distinct immune signatures associated with the different sarcoma subtypes, which is essential for guiding future immunotherapy trials. The selected immune markers are known for their roles in tumor immune evasion and response to therapy.\",\n        \"original text\": \"The objective of this study is to provide a description of the immunologic landscape of sarcomas to guide the next clinical trials of immunotherapy in these diseases. The gene expression profile of 93 immune checkpoint (ICP) and membrane markers (MM) of immune cells was analyzed in a series of 253 soft tissue sarcoma (synovial sarcoma, myxoid liposarcoma, sarcoma with complex genomic and GIST) using Agilent Whole Human Genome Microarrays. The unsupervised hierarchical clustering of gene expression level was found to properly group patients according to the histological subgroup of sarcoma, indicating that each sarcoma subgroup is associated with a specific immune signature defined by its gene expression pattern.\",\n        \"results\": \"Fifty of the 93 ICP/MM genes (54%) had consistently low expression levels regardless of the sarcoma subgroups while some others had consistently high levels of overexpression. The unsupervised hierarchical clustering of the gene expression level of the 93 ICP/MM was applied to the 253 sarcoma to correlate expression level of ICP/MM genes and sarcoma subgroups. The pattern of gene expression yielded a regrouping of the sarcoma samples matching closely their histological subtypes.\",\n        \"results original text\": \"Indeed, an unsupervised hierarchical clustering of the gene expression level of the 93 ICP/MM was applied to the 253 sarcoma to correlate expression level of ICP/MM genes and sarcoma subgroups. The pattern of gene expression yielded a regrouping of the sarcoma samples matching closely their histological subtypes.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Description of the methods used for assessing gene expression profiles: \\n \\u2460 Total RNA was extracted from frozen tumor samples using the miRNeasy Mini Kit (Qiagen), following a 30-minute lysis step and purification steps as per the manufacturer's instructions. RNA quality was assessed using an Agilent 2100 bioanalyzer (Agilent Technologies), ensuring that only high-quality RNA was used for subsequent analyses. \\n \\u2461 Gene expression analysis was performed using Agilent Whole Human 44 K Genome Oligo Array according to the manufacturer's protocol, which included hybridization (performed at 65\\u00b0C for 17 hours), washing, and scanning steps. \\n \\u2462 Gene expression levels were normalized using quantile normalization, and the probe with the highest inter-quartile range was selected for each gene to ensure accurate representation. \\n \\u2463 These detailed procedures are crucial for obtaining reliable gene expression data that can accurately reflect the immune landscape in sarcomas.\",\n        \"original text\": \"Total RNA was extracted from frozen tumor samples by using the miRNeasy Mini Kit (Qiagen, Germantown, MD) and was purified by using the RNeasy Min Elute TM Cleanup Kit (Qiagen), according to the manufacturer\\u2019s instructions. RNA quality was checked on an Agilent 2100 bioanalyzer (Agilent Technologies). Gene expression analysis was carried out by using Agilent Whole Human 44 K Genome Oligo Array (Agilent Technologies), according to the manufacturer\\u2019s protocol.\",\n        \"results\": \"RNA quality was assessed, and gene expression analysis was performed following the manufacturer's protocol, ensuring accurate hybridization and normalization of data. All quality control measures were adhered to verify the integrity and reliability of the RNA samples.\",\n        \"results original text\": \"RNA quality was checked on an Agilent 2100 bioanalyzer (Agilent Technologies). Gene expression analysis was carried out by using Agilent Whole Human 44 K Genome Oligo Array (Agilent Technologies), according to the manufacturer\\u2019s protocol.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Identification of immune landscape correlating with histological subtypes and implications for therapy: \\n \\u2460 The differential expression of each gene across sarcoma subgroups was analyzed using ANOVA tests, with significance assessed using Bonferroni adjustment and a significance threshold of p < 0.05. \\n \\u2461 The t-Distributed Stochastic Neighbor Embedding (t-SNE) technique was applied for dimensionality reduction to visualize the immune landscape and its correlation with histological subtypes, using a perplexity value of 30. \\n \\u2462 CIBERSORT analysis was performed to estimate the distribution of immune cell populations in each sarcoma sample based on their transcriptomic profile, and the prognostic impact of specific immune cell signatures on metastatic-free survival (MFS) was explored using Kaplan-Meier survival analysis. \\n \\u2463 These analyses are essential for understanding how the immune landscape varies among different sarcoma subtypes and for identifying potential targets for immunotherapy. The findings from these analyses will inform the design of future clinical trials targeting specific immune pathways.\",\n        \"original text\": \"The differential expression of each gene across sarcoma subgroups is presented in Figure 3. The prognostic impact of each ICP/MM (above vs under mean value) for metastasis-free survival (MFS) was then explored in the four sarcoma subgroups. CIBERSORT for Cell type Identification By Estimating Relative Subsets Of known RNA Transcripts is a signature providing an estimation of the distribution of immune cell populations based on their transcriptomic profile.\",\n        \"results\": \"The results showed that the immune landscape strongly correlated to histotype and molecular subtypes, and identified specific ICP associated with individual sarcoma histotypes. The CIBERSORT analysis revealed that specific immune cell populations were associated with outcomes in the four sarcoma subgroups.\",\n        \"results original text\": \"These results indicate that each of the four sarcoma subgroups (GIST, SS, MLPS, SCG) is associated with a specific immune signature defined by its ICP gene expression pattern.\"\n    }\n}",
    "Part 3": "{\n    \"Part 3\": \"Gene Expression Patterns Across Sarcoma Subtypes\",\n    \"step 1\": {\n        \"implementation details\": \"I. Differential expression analysis of 93 immune-related genes across sarcoma subtypes:\\n\\u2460 The expression levels of 93 immune checkpoint (ICP) and membrane markers (MM) genes were analyzed in a series of 253 soft tissue sarcoma samples, including synovial sarcoma (SS), myxoid liposarcoma (MLPS), sarcomas with complex genomic profiles (SCG), and gastrointestinal stromal tumors (GIST), sourced from the French Sarcoma Group (FSG) patient database.\\n\\u2461 The expression levels for each gene were categorized based on Z-scores: low (Z-score < 4), moderate (Z-score between 4 and 10), or high (Z-score > 10).\\n\\u2462 The significance of differences in gene expression across the different sarcoma subtypes was evaluated using multiple Bonferroni-adjusted ANOVA, with a defined alpha level of 0.05 for significance testing. This analysis aims to identify specific immune signatures associated with each sarcoma subtype, as detailed in Figure 3 of the original paper.\",\n        \"original text\": \"The gene expression profile of 93 immune checkpoint (ICP) and membrane markers (MM) of immune cells was analyzed in a series of 253 soft tissue sarcoma (synovial sarcoma, myxoid liposarcoma, sarcoma with complex genomic and GIST) using Agilent Whole Human Genome Microarrays. ... The significance displays the heterogeneity of each gene expression level across the four subgroups.\",\n        \"results\": \"Fifty of the 93 ICP/MM genes (54%) had consistently low expression levels regardless of the sarcoma subgroups, while some genes showed consistently high levels of expression. The majority of genes were differentially expressed across the four sarcoma subgroups, allowing for the identification of specific immune signatures associated with each subgroup.\",\n        \"results original text\": \"We observed genes with 1) homogeneous expression patterns across the four groups, 2) heterogeneous patterns of expression across the four groups, and also 3) genes with different expression patterns within a given group.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Unsupervised clustering and t-SNE analysis to correlate gene expression with sarcoma histotypes:\\n\\u2460 Unsupervised hierarchical clustering was performed on the expression levels of the 93 ICP/MM genes to group patients according to their histological subtype using Euclidean distance and Ward\\u2019s method. A brief introduction to this step is to determine how gene expression patterns correlate with sarcoma subtypes.\\n\\u2461 The t-distributed Stochastic Neighbor Embedding (t-SNE) technique was applied for dimensionality reduction to visualize the correlation between gene expression patterns and sarcoma histotypes. A complexity value was set to 15, with a perplexity parameter of 30, and iterations were performed until convergence to optimize clustering. This analysis helps to confirm the distinct immune profiles across different sarcoma subtypes, as illustrated in Figure 2 of the original paper.\",\n        \"original text\": \"Using the prognostic impact of CIBERSORT signature on metastatic-free survival in each subgroup, specific targets could be proposed for each of the four groups: ... The unsupervised clustering was also applied to the 85 SCG did not distinguish the different histotypes included in this group.\",\n        \"results\": \"The unsupervised hierarchical clustering of the gene expression levels successfully grouped the sarcoma samples according to their histological subtypes, confirming that each sarcoma subgroup is associated with a distinct immune signature defined by its gene expression pattern.\",\n        \"results original text\": \"The pattern of gene expression yielded a regrouping of the sarcoma samples matching closely their histological subtypes.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Discussion of specific gene expression trends and their relevance to tumor biology, including integration into overall study conclusions:\\n\\u2460 The analysis outlines the variability of ICP and MM gene expression across sarcoma subgroups and among patients within the same subgroup, emphasizing the importance of histotype in immune landscape characterization. This step synthesizes the implications of the findings for the development of targeted immunotherapy approaches, as discussed in the paper's conclusion.\\n\\u2461 The findings suggest that the immune landscape of sarcomas is heterogeneous, and that targeting specific immune checkpoints may provide opportunities for immunotherapy in specific subtypes. A summary of potential therapeutic strategies based on identified markers and immune cell populations, linked to the overall objectives of the study, could guide future clinical trials.\",\n        \"original text\": \"These results also show the importance of immune infiltrate for sarcoma prognosis, and strongly confirm that one-size-fits-all approach for the manipulation of immune system for sarcoma treatment is unlikely to succeed for new ICP inhibitors development, while providing possible guidance for the selection of subtypes for new ICPs.\",\n        \"results\": \"The analysis indicates significant heterogeneity in immune cell infiltrates and gene expression patterns across sarcoma subtypes. This heterogeneity suggests that immunotherapeutic strategies should be tailored to specific sarcoma histotypes to improve efficacy.\",\n        \"results original text\": \"Altogether, these results indicate that each of the four sarcoma subgroups (GIST, SS, MLPS, SCG) is associated with a specific immune signature defined by its ICP gene expression pattern.\"\n    }\n}",
    "Part 4": "{\n    \"Part 4\": \"Prognostic Impact of Immune Checkpoint and Membrane Marker Genes\",\n    \"step 1\": {\n        \"implementation details\": \"I. Evaluation of the prognostic impact of individual immune checkpoint (ICP) and membrane marker (MM) genes on metastasis-free survival:\\n\\u2460 The expression levels of each of the 93 ICP/MM genes were analyzed across a dataset of 253 soft tissue sarcoma cases sourced from expert centers of the French Sarcoma Group (FSG) between July 1991 and November 2011.\\n\\u2461 The expression levels were compared using the 25th and 75th percentiles for sample distribution.\\n\\u2462 The significance of the expression levels was determined using multiple Bonferroni-adjusted ANOVA tests, with a threshold of p < 0.05 to identify genes with a significant impact on metastasis-free survival (MFS).\\n\\u2463 Statistical analyses were performed using R version 3.4.2, employing appropriate packages for ANOVA. This step provides a foundation for understanding how individual gene expression profiles may influence patient outcomes.\\n\\u2464 Key findings from this analysis suggest potential prognostic biomarkers for sarcoma patients, guiding future clinical strategies.\",\n        \"original text\": \"The differential expression of each gene across sarcoma subgroups is presented in Figure 3. Number values of data represented in Figure 3 are reported in Supplementary Table S1. Expression level of each of the 93 ICP/MM genes was determined for the 253 sarcoma cases included in the study using either the 25 and 75 percentile of samples included in each sarcoma subtype and the Z-score that gives a numerical measurement of each value\\u2019s relationship to the mean in the group of values. The significance represents the heterogeneity of each gene expression level across the four sarcoma subgroups.\",\n        \"results\": \"No ICP/MM demonstrated a significant prognostic impact in all four sarcoma subgroups. Some ICP/MM gene had a similar positive prognostic across two groups (e.g. positive impact of TNFRSF5 (CD40) in GIST and SS).\",\n        \"results original text\": \"No ICP/MM demonstrated a significant prognostic impact in all four sarcoma subgroups. Some ICP/MM gene had a similar positive prognostic across two groups (e.g. positive impact of TNFRSF5 (CD40) in GIST and SS).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Analysis of the prognostic relevance of specific immune cell populations across sarcoma subtypes:\\n\\u2460 The CIBERSORT tool was utilized to estimate the proportions of 22 immune cell populations in the sarcoma samples using the LM22 signature matrix for accurate deconvolution. This analysis is essential for understanding the role of different immune cells in the tumor microenvironment.\\n\\u2461 The prognostic impact of these immune cell populations on MFS was evaluated through Kaplan-Meier survival analysis along with log-rank tests, emphasizing immune populations that showed significant prognostic value across the sarcoma subtypes.\\n\\u2462 Statistical analyses for survival were conducted using R version 3.4.2 with the survival package.\\n\\u2463 Findings from this analysis underscore the importance of immune cell composition in predicting patient outcomes and may inform the selection of immunotherapeutic strategies.\",\n        \"original text\": \"The prognostic impact of each ICP/MM (above vs under mean value) for metastasis-free survival (MFS) was then explored in the four sarcoma subgroups. No ICP/MM demonstrated a significant prognostic impact in all four sarcoma subgroups. Some ICP/MM gene had a similar positive prognostic across two groups (e.g. positive impact of TNFRSF5 (CD40) in GIST and SS).\",\n        \"results\": \"Four specific immune cell populations were found associated with outcome in the four sarcoma subgroups: 1) Activated NK cell signature was differentially expressed across sarcoma subtypes with the highest significance observed in GIST. 2) M0-macrophages were associated with poor prognosis in the three other sarcoma subgroups. 3) The presence of resting mast cells signature was associated with longer MFS in SS whereas activated mast cells signature was associated with poor prognosis in GIST. 4) Finally, na\\u00efve B cells signature was associated with a poor prognosis in SS.\",\n        \"results original text\": \"The representation of immune cell populations and their prognostic impact was then studied in the four sarcoma subgroups and presented in Figure 4. Four specific immune cell populations were found associated with outcome in the four sarcoma subgroups.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Comparison of prognostic indicators with clinical outcomes and implications for future therapeutic strategies:\\n\\u2460 A comparison was made between the prognostic significance of ICP/MM expressions and immune cell populations with clinical characteristics such as tumor size, grade, and localization, to identify potential predictive factors for therapeutic strategies. This step aims to integrate immune landscape findings with clinical data to enhance treatment personalization.\\n\\u2461 Findings from the prognostic analyses were discussed in the context of developing targeted immunotherapeutic strategies tailored to each sarcoma subtype based on their unique immune profiles. This discussion is linked to broader implications for improving treatment outcomes in sarcoma patients.\\n\\u2462 The results highlight the necessity of personalized treatment approaches and the potential for tailoring immunotherapy based on the immune landscape of individual tumors.\",\n        \"original text\": \"These results also show the important of immune infiltrate for sarcoma prognosis, and strongly confirm that one-size-fits all approach for the manipulation of immune system for sarcoma treatment is unlikely to succeed for new ICP inhibitors development, while providing possible guidance for the selection of subtypes for new ICPs.\",\n        \"results\": \"The analysis indicates that the immune infiltrate profile of human sarcoma is different in the distinct sarcoma histotypes, and that individual ICP expression profiles may have different prognostic values for metastatic-free survival, suggesting a need for subtype-specific treatment approaches.\",\n        \"results original text\": \"These results also show the important of immune infiltrate for sarcoma prognosis, and strongly confirm that one-size-fits all approach for the manipulation of immune system for sarcoma treatment is unlikely to succeed for new ICP inhibitors development, while providing possible guidance for the selection of subtypes for new ICPs.\"\n    }\n}",
    "Part 5": "{\n    \"Part 5\": \"Prognostic Implications of Immune Cell Composition as Assessed by CIBERSORT\",\n    \"step 1\": {\n        \"implementation details\": \"I. Application of CIBERSORT to determine immune cell population distribution in sarcoma samples\\n\\u2460 CIBERSORT is utilized to analyze the gene expression profiles of 253 sarcoma samples, sourced from the ATG-Sarc database, which includes GIST (60 samples), MLPS (50 samples), SS (58 samples), and SCG (85 samples). \\n\\u2461 The analysis estimates the proportions of different immune cell populations based on a signature matrix composed of 547 genes, specifically the LM22 leukocyte signature matrix. \\n\\u2462 The processing involves applying the CIBERSORT algorithm to the whole transcriptome data obtained from Agilent Whole Human Genome Microarrays (4x44K). \\n\\u2463 Each sample is processed to yield a detailed immune cell composition profile, allowing for the identification of 22 human hematopoietic cell phenotypes. \\n\\u2464 The 547 genes included in the signature matrix were selected based on their relevance to immune cell function and previous validation studies that demonstrate their effectiveness in characterizing immune cell populations.\",\n        \"original text\": \"CIBERSORT for Cell type Identification By Estimating Relative Subsets Of known RNA Transcripts is a signature providing an estimation of the distribution of immune cell populations based on their transcriptomic profile. It consists of an in silico approach for characterizing 22 human hematopoietic cell phenotypes based on a bulk transcriptome deconvolution using a pre-defined signature of 547 genes.\",\n        \"results\": \"The CIBERSORT analysis provided a detailed breakdown of immune cell populations across the subtypes, revealing a diverse composition that varied significantly among GIST, MLPS, SS, and SCG. Notably, activated NK cells were most prevalent in GIST, while M0 macrophages were consistently associated with poor prognosis across the other subtypes.\",\n        \"results original text\": \"The representation of immune cell populations and their prognostic impact was then studied in the four sarcoma subgroups.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Analysis of how CIBERSORT signatures correlate with patient outcomes and prognostic factors\\n\\u2460 The immune cell distributions obtained from CIBERSORT are correlated with patient outcomes, particularly focusing on metastasis-free survival (MFS). \\n\\u2461 Statistical analyses will be conducted using Kaplan-Meier survival curves and log-rank tests to assess the prognostic significance of various immune cell types within each sarcoma subgroup. \\n\\u2462 Multivariable Cox proportional hazards models will be applied to account for potential confounding factors such as age, tumor grade, and histological subtype. Specific parameters will include age as a continuous variable and tumor grade classified according to FNCLCC criteria. \\n\\u2463 MFS estimation will begin from the date of the original diagnosis of the localized tumor to the occurrence of first metastases, with significance thresholds set at p < 0.05 after adjustments for multiple comparisons.\",\n        \"original text\": \"The prognostic impact of each ICP/MM (above vs under mean value) for metastasis-free survival (MFS) was then explored in the four sarcoma subgroups.\",\n        \"results\": \"High M0-macrophage signature was found to correlate with significantly poorer metastasis-free survival (MFS) in SCG, MLPS, and SS, with a hazard ratio (HR) of 2.98 (p = 1.28 \\u00d7 10\\u20134). In contrast, activated NK cell signatures were associated with improved MFS in GIST.\",\n        \"results original text\": \"For the group of 137 cases including these three entities, the high M0-macrophage signature associated with a poorer MFS (HR = 2.98; p = 1.28 10\\u20134), outperforming the histopathological FNCLCC grade.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Exploration of potential therapeutic implications based on CIBERSORT findings and their integration into the overall study conclusions\\n\\u2460 The results from CIBERSORT analysis are discussed in the context of existing literature to identify potential therapeutic targets that can be exploited in specific sarcoma subtypes based on their unique immune landscapes. \\n\\u2461 Recommendations for future clinical trials will emphasize the need for tailored immunotherapy strategies that reflect the distinct immune profiles of each sarcoma histotype, particularly focusing on the immune cell populations identified through CIBERSORT. \\n\\u2462 The discussion will include the potential for targeting specific immune checkpoints (ICP) such as CD40 and GITR in GIST, and ICOS in SS, as promising avenues for future research, supported by current findings and their implications for treatment decisions.\",\n        \"original text\": \"The present results provide additional data for rationally develop new ICP inhibitors in specific sarcoma subtypes, in conjunction with mutational load, presence of TLS, and aneuploidy as potential predictive factors.\",\n        \"results\": \"The findings suggest that targeting M0 macrophages across all sarcoma subtypes may improve prognosis, while specific ICP inhibitors like CD40 agonists in GIST and SS and GITR antagonists in GIST are recommended for future clinical trials based on CIBERSORT results.\",\n        \"results original text\": \"These results also show the important of immune infiltrate for sarcoma prognosis, and strongly confirm that one-size-fits all approach for the manipulation of immune system for sarcoma treatment is unlikely to succeed for new ICP inhibitors development.\"\n    }\n}"
}