{
    "GEO": {
        "GSE261076": {
            "Status": "Public on Aug 01, 2024",
            "Title": "Combination of Eribulin and Anlotinib Exerts Synergistic Cytotoxicity in Retroperitoneal Liposarcoma by Inducing Endoplasmic Reticulum Stress",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Primary retroperitoneal liposarcoma (RLPS) is a rare heterogeneous tumor occurring within retroperitoneal space, and its overall survival did not improve much in the past few decades. Based on a small-sample clinical practice at our center, patients with RLPS can greatly benefit from combination of anlotinib and eribulin. In this study, we investigated combinational effect of anlotinib and eribulin on RLPS. Through transcriptome analysis, we uncovered and validated that synergistic effect mainly induced by endoplasmic reticulum stress (ERS) pathway both in vitro and in vivo.",
            "Overall design": "To elucidate the underlying mechanisms by which combination of anlotinib and eribulin inhibited RLPS cells, RNA-seq was conducted to evaluate transcriptome changes in RLPS cells after being treated with optimal concentration which could elicit maximum synergy effect. 93T449, 94T778 and sw872 cell lines were used in this study.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM8133880": {
                    "link": "/geo/query/acc.cgi?acc=GSM8133880",
                    "name": "93T449 Control",
                    "Supplementary file": [
                        {
                            "file_name": "GSM8133880_93T449_Control.csv.gz",
                            "file_size": "242.1 Kb",
                            "file_type": "CSV",
                            "download_link": "/geo/download/?acc=GSM8133880&format=file&file=GSM8133880%5F93T449%5FControl%2Ecsv%2Egz"
                        }
                    ],
                    "Status": "Public on Aug 01, 2024",
                    "Title": "93T449 Control",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: 93T449cell type: liposarcomagenotype: wild typetreatment: control",
                    "Treatment protocol": "93T449, 94T778 and Sw872 cells were treated with anlotinib and eribulin for 24 hours, at which concentration reached maximum synergy score.",
                    "Growth protocol": "94T778 and Sw872 cell lines were acquired from American Type Culture Collection, and routinely cultured in RPMI 1640 medium supplemented with 10% FBS",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was harvested using TRIzol Reagent (Invitrogen, cat. NO 15596026). 2 ug of total RNA was used for the construction of sequencing libraries.RNA libraries for RNA-seq were prepared using KC-DigitalTM Stranded mRNA Library Prep Kit for Illumina® (Catalog NO. DR08502, Wuhan Seqhealth Co., Ltd. China) following manufacturer's protocols.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "G_1",
                    "Data processing": "Sequence reads were trimmed for adaptor sequence/low-quality sequence using fastp (version 0.23.4) (parameter arsg: -l 39 --dont_eval_duplication  --qualified_quality_phred 20 --unqualified_percent_limit 8 --adapter_sequence  --adapter_sequence_r2  --fix_mgi_id)Trimmed reads were mapped to GRCh38 using STAR software (version 2.5.3a) (parameters- --outSAMtype BAM SortedByCoordinate)Read count extraction and normalization were performed using featureCounts（Version 1.5.1）（parameter -T 10 -d 30 -D 1000 -C -s 1 -t {exon} -g {geneid} --primary -O -a {gff_annotation_file}）Assembly: Homo sapiens.GRCh38Supplementary files format and content: reads value formated in csv file",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE261076_All_reads_counts.txt.gz",
                    "file_size": "4.7 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE261076&format=file&file=GSE261076%5FAll%5Freads%5Fcounts%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE261076_RAW.tar",
                    "file_size": "2.7 Mb",
                    "file_type": "TAR (of CSV)",
                    "download_link": "/geo/download/?acc=GSE261076&format=file"
                }
            ]
        },
        "GSE267611": {
            "Status": "Public on Jun 12, 2024",
            "Title": "Seclidemstat blocks the transcriptional function of multiple FET-fusion oncoproteins",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Genes encoding the RNA-binding proteins FUS, EWSR1, and TAF15 (FET proteins) are involved in chromosomal translocations in several rare sarcomas. FET-rearranged sarcomas are often aggressive malignancies affecting pediatric, adolescent, and young and middle-aged adults, with prognosis depending on the fusion and whether the disease is localized, metastatic, or relapsed. New therapies are needed for these patients. These translocations fuse the 5’ portion of the FET family gene with a 3’ partner gene encoding a transcription factor. The resulting fusion proteins have the intrinsically disordered low complexity domain (LCD) of the FET protein paired with a DNA binding domain and these chimeras function as oncogenic transcription factors. FET fusion proteins have proven stubbornly difficult to target directly and promising new therapeutic strategies target the critical regulators and co-regulators of these proteins. One such protein is the histone lysine specific demethylase 1 (LSD1). LSD1 physically interacts with and is recruited by multiple FET fusions, including EWSR1::FLI1. LSD1 promotes EWSR1::FLI1 gene regulation and prior studies showed that treatment with the noncompetitive inhibitor SP-2509 blocked the transcriptional activity of the fusion. A similar molecule, seclidemstat (SP-2577), was identified as a promising lead for clinical development and is currently in clinical trials for FET-rearranged sarcomas (NCT03600649). However, whether seclidemstat has pharmacological activity against EWSR1::FLI1 or any other FET fusion protein has yet to be demonstrated. In this study, we sought to evaluate the in vitro potency of seclidemstat against multiple cell lines derived from different FET-rearranged sarcomas, including Ewing sarcoma, desmoplastic small round cell tumor, clear cell sarcoma, and myxoid liposarcoma. We also defined the transcriptomic effect of seclidemstat treatment in these diseases and evaluated the activity of seclidemstat against FET fusion transcriptional regulation in multiple cell lines. Seclidemstat showed potent activity in cell viability assays in all four FET-rearranged sarcomas and disrupted the transcriptional function of all the tested fusion proteins. Though epigenetic and targeted inhibitors are unlikely to be effective as a single agents in the clinic, these data suggest seclidemstat remains a promising new treatment strategy for patients with FET-rearranged sarcomas",
            "Overall design": "To evaluate the pharmacologic effects of seclidemstat treatment on the transcriptomes of FET-rearranged sarcoma cell lines, we treated 9 cell lines expressing a variety of FET fusion oncogenes with either DMSO or the IC90 dose of seclidemstat for 48 hours, collected RNA, and performed RNA-seq",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM8270121": {
                    "link": "/geo/query/acc.cgi?acc=GSM8270121",
                    "name": "1765-92,DMSO,48h,Rep1",
                    "Status": "Public on Jun 12, 2024",
                    "Title": "1765-92,DMSO,48h,Rep1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: 1765-92cell type: myxoid liposarcomagenotype: wildtypetreatment: DMSOtime: 48hreplicate: Rep1",
                    "Treatment protocol": "Cells were seeded at 30% confluency and left to adhere overnight. After 24 hours, cells were dosed with DMSO or Seclidemstat equating calculated IC90 for that cell line. Cells were harvested for RNA extraction after 48 hours.",
                    "Growth protocol": "A673 cells were grown in DMEM + 10% FBS + PSQ + 1% Sodium Pyruvate. TTC466, 402-91, 1765-92, SUCCS1 and DTC1 cells were grown in RPMI-1640 + 10% FBS + PSQ. DL221 cells were grown in DMEM + 10% FBS + PSQ. JN-DSRCT and BER cells were grown in DMEM/F12 + 10% FBS + PSQ.",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Total RNA was extracted using the RNeasy kit (Qiagen). 300ng of total RNA was used for library prep.NEBNext Ultra II Directional RNA Library Prep Kit",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "IC90_48h_1765-92vsDMSO_48h_1765-92.complete.txt",
                    "Data processing": "Low quality and adapter sequences were trimmed using Trim_galoreTrimmed sequences were mapped to hg38 using STAR with 2-pass approachReads were assigned to features using featureCountsNormalization, differential analysis and statistical reports were done using DESeq2 and SARToolsAssembly: hg38Supplementary files format and content: tab-delimited text file include raw and normalized counts for each sample generated by DESeq2Supplementary files format and content: tab-delimited text file include log2FoldChange, p-values adjusted and other the statistics generated by DESeq2 for each sample",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE267611_IC90_48h_1765-92vsDMSO_48h_1765-92.complete.txt.gz",
                    "file_size": "2.2 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5F1765%2D92vsDMSO%5F48h%5F1765%2D92%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_402-91vsDMSO_48h_402-91.complete.txt.gz",
                    "file_size": "2.1 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5F402%2D91vsDMSO%5F48h%5F402%2D91%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_A673vsDMSO_48h_A673.complete.txt.gz",
                    "file_size": "2.0 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5FA673vsDMSO%5F48h%5FA673%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_BERvsDMSO_48h_BER.complete.txt.gz",
                    "file_size": "1.9 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5FBERvsDMSO%5F48h%5FBER%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_DL221vsDMSO_48h_DL221.complete.txt.gz",
                    "file_size": "2.0 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5FDL221vsDMSO%5F48h%5FDL221%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_DTC1vsDMSO_48h_DTC1.complete.txt.gz",
                    "file_size": "1.9 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5FDTC1vsDMSO%5F48h%5FDTC1%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_JNDSRCTvsDMSO_48h_JNDSRCT.complete.txt.gz",
                    "file_size": "2.1 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5FJNDSRCTvsDMSO%5F48h%5FJNDSRCT%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_SUCCS1vsDMSO_48h_SUCCS1.complete.txt.gz",
                    "file_size": "2.2 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5FSUCCS1vsDMSO%5F48h%5FSUCCS1%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_IC90_48h_TTC466vsDMSO_48h_TTC466.complete.txt.gz",
                    "file_size": "2.3 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FIC90%5F48h%5FTTC466vsDMSO%5F48h%5FTTC466%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_iERG562vsiERG197.complete.txt.gz",
                    "file_size": "2.4 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5FiERG562vsiERG197%2Ecomplete%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE267611_sample_meta_out.txt.gz",
                    "file_size": "1.9 Kb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE267611&format=file&file=GSE267611%5Fsample%5Fmeta%5Fout%2Etxt%2Egz"
                }
            ]
        },
        "GSE234132": {
            "Status": "Public on Jun 04, 2024",
            "Title": "ADAT2/3 complex-deposited tRNA inosines drives oncogenic transformation",
            "Organism": "Homo sapiens",
            "Experiment type": "Non-coding RNA profiling by high throughput sequencing",
            "Summary": "Transfer RNAs (tRNAs) are subject to numerous posttranscriptional modifications that influence their maturation, stability, and function. Adenosine to Inosine (A-to-I) editingin thetRNA anticodon stem loop is an important modification that influences anticodon-codon recognition.However,the implications of tRNA editing in cancer and its potential for diagnostic and therapeutic applicationsare not yet well understood.We showed that the ADAT2/3 enzyme complex, responsible for this modification in humans, is amplified and overexpressed in several tumor types,with a higher amplification rate in sarcoma tumors, particularly liposarcomas. We determine that the ADAT complex works as an oncogene in these tumors and that its inhibition reduces tumor growth, offering a new approach to cancer treatment. In addition, we provided insight into the mechanisms of cancer development and progression, demonstrating that tRNA editing is required for higher mRNA translation of oncogenic proteins enriched with specific ADAT-sensitive codons. Thus, ADAT-mediated tRNA modification drives oncogenic transformation by remodeling the set of mRNAs being actively translated to increase expression of proteins that promote proliferation. Our results explain how cancer cells benefit from increased tRNA A-to-I editing and propose ADATs as potential therapeutic targets for the treatment of cancer.",
            "Overall design": "To understand the role of A-to-I editing in tRNA in tumor development, we carried out small RNA-seq in ADAT2 knock-down cells. We identify the editing events deposited by ADAT2 enzyme and monitor their molecular functions on translation as well as physiological roles during tumor growth.",
            "Platforms": "Platforms (1), GPL18573, Illumina NextSeq 500 (Homo sapiens)",
            "Samples": {
                "GSM7446559": {
                    "link": "/geo/query/acc.cgi?acc=GSM7446559",
                    "name": "Control, Rep1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM7446559_shGFP_1.bwt2.mismatch.txt.gz",
                            "file_size": "264.1 Kb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM7446559&format=file&file=GSM7446559%5FshGFP%5F1%2Ebwt2%2Emismatch%2Etxt%2Egz"
                        },
                        {
                            "file_name": "GSM7446559_shGFP_1.tRNA.rpkm.txt.gz",
                            "file_size": "9.5 Kb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM7446559&format=file&file=GSM7446559%5FshGFP%5F1%2EtRNA%2Erpkm%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Jun 04, 2024",
                    "Title": "Control, Rep1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: cell linecell line: LPS853genotype: Controltreatment: None",
                    "Treatment protocol": "2 shRNAs for ADAT2. shGFP used as a control",
                    "Growth protocol": "LPS853 cells were cultured in IMDM medium supplemented with 15% FBS and 1X penicillin/streptomycin",
                    "Extracted molecule": "size fractionation",
                    "Extraction protocol": "Total RNA was isolated with Trizol Reagent (Invitrogen) and treated with recombinant AlkB and AlkB D135S for demethylation for 2 h as detailed in Lin et al 2019. Demethylated small RNA was purified using the RNA Clean and Concentrator -5 kit (Zymo Research)NEBnext Multiplex small RNA library prep for Illumina (New England Biolabs)",
                    "Library strategy": "ncRNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NextSeq 500",
                    "Description": "Small RNA sequencing",
                    "Data processing": "Raw sequencing reads were firstly subjected to Trim_galore (version 0.6.7) for quality control and adaptor trimming, with \"--stringency\" set to 3.Processed reads were mapped to human tRNA transcriptome using bowtie2 (v2.3.4.3) with the following parameters: --sensitive -N 1, the reads mapped to the minus strand of tRNAs are removed.Samtools mpileup was used to extract the reads mapping of every nucleotide in the transcriptome and mitochondrial genome.Mismatch rate was calculated using in-house scripts. RPKM was calculated using in-house scripts following the definition of RPKM.Assembly: hg38Supplementary files format and content: Mismatch rate file in tab-delimited format; containing the mismatch rate for every nucleotide in the transcriptome.",
                    "Platform ID": "GPL18573"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE234132_RAW.tar",
                    "file_size": "2.5 Mb",
                    "file_type": "TAR (of TXT)",
                    "download_link": "/geo/download/?acc=GSE234132&format=file"
                }
            ]
        },
        "GSE243904": {
            "Status": "Public on Sep 25, 2023",
            "Title": "Antitumor effects of PRMT5 inhibition in sarcomas [RNA-seq]",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Patients with advanced soft-tissue sarcomas (STSs) have few therapeutic options. Protein arginine methyltransferase 5 (PRMT5), an anticancer target, has been extensively investigated in recent years in epithelial tumors. To date, no data related to the biological role of PRMT5 inhibition and its potential effect as a treatment in STS have been reported. To investigate the therapeutic potential of PRMT5 targeting in STS, we first evaluated the prognostic value of PRMT5 expression in 2 different cohorts of patients with STS. We then used the potent and selective GSK3326595 (GSK595) compound to investigate the antitumor effect of the pharmacological inhibition of PRMT5 in vitro via MTT, apoptosis, cell cycle, clonogenicity and proliferation assays. In vivo studies were performed with two animal models to evaluate the effects of GSK595 on tumor growth. The mechanisms of action were investigated by RNA sequencing, metabolic pathway analysis, Western blotting and glucose uptake/lactate production assays. High PRMT5 gene expression levels were significantly associated with worsened metastasis-free survival of STS patients. GSK595 decreased the global symmetric dimethylarginine level, the proliferation rate and clonogenicity of STS cell lines in vitro and tumor growth in vivo. Moreover, PRMT5 inhibition regulated aerobic glycolysis through downregulation of key enzymes of glycolysis as well as glucose uptake and lactate production. The present study demonstrated that PRMT5 regulates STS cell metabolism and thus represents a potential therapeutic target for STS. Additional studies in diverse sarcoma subtypes will be essential to confirm and expand upon these findings.",
            "Overall design": "To decipher the mechanism of action of PRMT5 inhibition in STS cell lines, we explored the transcriptomic changes in IB111 cells after 10 days of treatment by RNA sequencing. IB111 cells were untreated or treated with GSK595 at the IC50 every 3 days for 10 days in triplicate. RNA was then extracted and sequenced on a NovaSeq6000 S2 platform.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM7798061": {
                    "link": "/geo/query/acc.cgi?acc=GSM7798061",
                    "name": "IB111 cell line, Control, rep1",
                    "Status": "Public on Sep 25, 2023",
                    "Title": "IB111 cell line, Control, rep1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: IB111cell type: dedifferentiated liposarcomagenotype: WTtreatment: Vehicle",
                    "Treatment protocol": "IB111 cells were untreated or treated with GSK595 at the IC50 every 3 days for 10 days",
                    "Growth protocol": "IB111 cells were maintained in RPMI medium 1640 GlutaMAX Supplement in the presence of 10% fetal bovine serum and 1% penicillin/streptomycin at 37°C in a humidified atmosphere containing 5% CO2",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was extracted using an RNeasy Plus Mini Kit (Qiagen). The purity and concentration of the isolated RNA were determined with a NanoDrop spectrophotometer, and capillary electrophoresis using a Bioanalyzer 2100 was carried out to determine the RNA integrity number (RIN).RNA libraries were prepared using NEBNext® Ultra™ II mRNA-Seq library kit paired-end 100x2 read protocol",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "reads with low quality bases at 5’ and 3’ were trimmed using the Sickle package (Phred cut off 20, max trim size 30 nc)The SeqPrep package was used to remove sequencing adaptors from raw readsAn home-made python script was developed that split those merged reads into new non-overlapping R1 and R2 paired-end readsCurated reads were aligned using TOPHAT2 (based on aka BOWTIE2) on both the UCSC hg19 reference genome and transcriptomepost-alignment quality control of aligned reads by removing reads with mapping scores lower than 20 using Samtools (5). PCR duplicate reads were identified and removed using Picard MarkDuplicates (https://broadinstitute.github.io). Read counts were generated performed using the Python module HTSeqTranscript count data were normalized according the VOOM methodThe RNAseq differential gene expression between groups of samples was performed using the statistical t-test from the R package LIMMAWe defined the significantly up- or down-regulated transcripts using an FDR threshold of 0.05. The fold-change used to further filter the differential gene expression was set to a minimum value of 2Assembly: hg19Supplementary files format and content: tab-delimited text file of raw counts matrixSupplementary files format and content: tab delimited text file of diffenrential expression results",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE243904_DGE_NORM_IB11_PRMT5_Treated_vs_notreated_LIMMA_T-TEST_AFFYX.txt.gz",
                    "file_size": "2.9 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE243904&format=file&file=GSE243904%5FDGE%5FNORM%5FIB11%5FPRMT5%5FTreated%5Fvs%5Fnotreated%5FLIMMA%5FT%2DTEST%5FAFFYX%2Etxt%2Egz"
                }
            ]
        },
        "GSE241225": {
            "Status": "Public on Aug 23, 2023",
            "Title": "Gene expression at single cell level of untreated and 10 day palbociclib treated LS8817 cells",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Orthoganally complementing our RNA-seq (GSE241031) efforts to define transcriptional changes over time in LS8817(TetOnFMDM2) cells as they progressed from quiesence to senescence, we chose to look at gene expression in unperturbed parental and 10 day palbociclib treated LS8817 parental cells",
            "Overall design": "Asynchronously growing LS8817 cells were treated with 1 uM palbociclib and cultured for 10 days with media changes every three days.  Treated cells and untreated asynchronouysly growing cells were collected at that time and subjected to single cell RNA seq",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM7719735": {
                    "link": "/geo/query/acc.cgi?acc=GSM7719735",
                    "name": "LS8817 cycling replicate 1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM7719735_8817_CTRL_01_filtered_feature_bc_matrix.h5",
                            "file_size": "27.7 Mb",
                            "file_type": "H5",
                            "download_link": "/geo/download/?acc=GSM7719735&format=file&file=GSM7719735%5F8817%5FCTRL%5F01%5Ffiltered%5Ffeature%5Fbc%5Fmatrix%2Eh5"
                        }
                    ],
                    "Status": "Public on Aug 23, 2023",
                    "Title": "LS8817 cycling replicate 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: cell linecell line: LS8817cell type: dedifferentiated liposarcomagenotype: wild typetreatment: none",
                    "Treatment protocol": "asynchronously growing cells were treated with 1 uM palbociclib and media replaced every three days",
                    "Growth protocol": "cells were grown in DME supplemented with 10% fetal bovine serum, 2 mM glutamine, and penicillin and streptomycin at 37C in 5% CO2",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Cells were collected by trypsinization and suspensions prepared according to guidelines from 10X genomics.  Suspensions were adjusted to a concentration of 1000 cells per microliter and loaded to one capture well to obtain 10,000 cells.Construction of the library was perfomed according to manufacturers instructions.  10X genomics libfraries were prepared using v3 chemistryLibraries were sequenced to an average of 23000 reads per cell quantifying expression for a median of 1509 and 2733 transcripts per cell for palbociclib treated and control, respectively",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "10X genomics",
                    "Data processing": "The demultiplexing, barcoded processing, gene counting, and aggregation were made using Cellranger v3.0.2Sequence reads were aligned to GRCH37/hg19 human genome reference using STAR as implemented in the Cellranger v3.0.2 pipelineThe resulting BAM file was analyzed with velocyto to obtain read counts.  Merged treatment and control spliced read counts were used for clustering with Seurat implementing the SCTransform pipeline with 20 dimensions.Differential expression analysis between cell samples, trated and control, were carried out with Monocle3, excluding high mitochondrial clusters.Assembly: alignment was made to GRCh37/hg19 human genome reference using STARSupplementary files format and content: HDF format values containing gene read-count matrices for treatment and controlSupplementary files format and content: .RDA file containing final seurat object",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE241225_RAW.tar",
                    "file_size": "45.4 Mb",
                    "file_type": "TAR (of H5)",
                    "download_link": "/geo/download/?acc=GSE241225&format=file"
                },
                {
                    "file_name": "GSE241225_vc8817.rda.gz",
                    "file_size": "1.3 Gb",
                    "file_type": "RDA",
                    "download_link": "/geo/download/?acc=GSE241225&format=file&file=GSE241225%5Fvc8817%2Erda%2Egz"
                }
            ]
        },
        "GSE226530": {
            "Status": "Public on May 12, 2023",
            "Title": "PolyA RNA-seq from liposarcoma cells treated with Nutlin3R and/or Carfilzomib",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Analysis of steady-state mRNA levels in liposarcoma cells treated for 28 hr with 0.05% DMSO or 10 uM Nutlin3R and/or 12.5 nM Carfilzomib",
            "Overall design": "Two independent biological replicates each of 94T778 and Lipo-246 cells, treated for 28 hr with 0.05% DMSO or 10 uM Nutlin3R and/or 12.5 nM Carfilzomib",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM7078425": {
                    "link": "/geo/query/acc.cgi?acc=GSM7078425",
                    "name": "94T778, DMSO, replicate 1",
                    "Status": "Public on May 12, 2023",
                    "Title": "94T778, DMSO, replicate 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: 94T778cell type: liposarcoma cellstreatment: 28 hr 0.05% DMSO",
                    "Treatment protocol": "94T778 and Lipo-246 cells were treated with vehicle (DMSO 0.05%) or 10 uM Nutlin3R and/or 12.5 nM Carfilzomib for 28 hr",
                    "Growth protocol": "94T778 and Lipo-246 cells were cultured in DMEM/F12 supplemented with 10% Equa Fetal and 1x anti-anti and were maintained at 37°C in a humidified atmosphere with 5% CO2.",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Qiagen RNeasyStrand-specific poly(A)+-enriched mRNA library (Illumina TruSEQ mRNA)RNA library sequencing",
                    "Library strategy": "ssRNA-seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "Signal processing, base-calling, and quality scoring was carried out automatically by the NovaSeq 6000 software (Illumina).Demultiplexing and conversion to FASTQ format was carried out using bcl2fastq (Illumina).Data quality was assessed using FASTQC (v0.11.5) (https://www.bioinformatics.babraham.ac.uk/projects/fastqc/) and FastQ Screen (v0.11.0, https://www.bioinformatics.babraham.ac.uk/projects/fastq_screen/).For some samples, FASTQ files from multiple sequencing runs were merged to obtain ≥40x10^6 raw reads.Trimming and filtering of low-quality reads was performed using bbduk from BBTools (v37.99) and fastq-mcf from ea-utils (v1.05, https://expressionanalysis.github.io/ea-utils/).Alignment to the human reference genome (GRCh38) was carried out using HISAT2 (v2.1.0) in paired, spliced-alignment mode with a GRCh38 index with a Gencode v33 annotation GTF.Alignments were sorted and filtered for mapping quality (MAPQ>10) using Samtools (v1.5).Gene-level count data were quantified using HTSeq-count (v0.6.1) with the following options (--stranded=reverse –minaqual=10 –type=exon --mode=intersection-nonempty) using a Gencode v33 GTF annotation file.Assembly: GRCh38Supplementary files format and content: Tab-delimited text files containing per gene strand-specific fragment counts or normalized fragments-per-kilobase-per-million-mapped (RPKM).",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE226530_LPS3_94T_Lipo246_Gencodev33_RPKMs_for_GEO.txt.gz",
                    "file_size": "3.5 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE226530&format=file&file=GSE226530%5FLPS3%5F94T%5FLipo246%5FGencodev33%5FRPKMs%5Ffor%5FGEO%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE226530_LPS3_94T_Lipo246_Gencodev33_counts_for_GEO.txt.gz",
                    "file_size": "830.2 Kb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE226530&format=file&file=GSE226530%5FLPS3%5F94T%5FLipo246%5FGencodev33%5Fcounts%5Ffor%5FGEO%2Etxt%2Egz"
                }
            ]
        },
        "GSE214889": {
            "Status": "Public on May 12, 2023",
            "Title": "PolyA RNA-seq from liposarcoma cells treated with Nutlin3R",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Analysis of steady-state mRNA levels in liposarcoma cells treated for 16 hr with 0.05% DMSO or 10 uM Nutlin3R",
            "Overall design": "Two independent biological replicates each of 94T778 and Lipo-246 cells, treated for 16 hr with 0.05% DMSO or 10 uM Nutlin",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6617491": {
                    "link": "/geo/query/acc.cgi?acc=GSM6617491",
                    "name": "Lipo246_DMSO_1",
                    "Status": "Public on May 12, 2023",
                    "Title": "Lipo246_DMSO_1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "treatment: 16 hr 0.05% DMSOlibrary type: strand-specific",
                    "Treatment protocol": "94T778 and Lipo-246 cells were treated with vehicle (DMSO 0.05%), or 10 uM Nutlin3R for 16 hr",
                    "Growth protocol": "94T778 and Lipo-246 cells were cultured in DMEM/F12 supplemented with 10% Equa Fetal and 1x anti-anti and were maintained at 37°C in a humidified atmosphere with 5% CO2.",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Qiagen RNeasyStrand-specific poly(A)+-enriched mRNA (Illumina TruSEQ mRNA)",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "Signal processing, base-calling, and quality scoring was carried out automatically by the NovaSeq 6000 software (Illumina).Demultiplexing and conversion to FASTQ format was carried out using bcl2fastq (Illumina).Data quality was assessed using FASTQC (v0.11.5) (https://www.bioinformatics.babraham.ac.uk/projects/fastqc/) and FastQ Screen (v0.11.0, https://www.bioinformatics.babraham.ac.uk/projects/fastq_screen/).For some samples, FASTQ files from multiple sequencing runs were merged to obtain ≥40x10^6 raw reads.Trimming and filtering of low-quality reads was performed using bbduk from BBTools (v37.99) and fastq-mcf from ea-utils (v1.05, https://expressionanalysis.github.io/ea-utils/).Alignment to the human reference genome (GRCh38) was carried out using HISAT2 (v2.1.0) in paired, spliced-alignment mode with a GRCh38 index with a Gencode v33 annotation GTF.Alignments were sorted and filtered for mapping quality (MAPQ>10) using Samtools (v1.5).Gene-level count data were quantified using HTSeq-count (v0.6.1) with the following options (--stranded=reverse –minaqual=10 –type=exon --mode=intersection-nonempty) using a Gencode v33 GTF annotation file.Assembly: GRCh38Supplementary files format and content: Tab-delimited text files containing per gene strand-specific fragment counts or normalized fragments-per-kilobase-per-million-mapped (FPKM).",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE214889_LPS2_Gencode_FPKMs_for_GEO.txt.gz",
                    "file_size": "1.8 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE214889&format=file&file=GSE214889%5FLPS2%5FGencode%5FFPKMs%5Ffor%5FGEO%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE214889_LPS2_Gencode_counts_for_GEO.txt.gz",
                    "file_size": "536.7 Kb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE214889&format=file&file=GSE214889%5FLPS2%5FGencode%5Fcounts%5Ffor%5FGEO%2Etxt%2Egz"
                }
            ]
        },
        "GSE213300": {
            "Status": "Public on Apr 10, 2023",
            "Title": "Charting the impact of supraphysiologic MDM2 on gene regulatory circuits in sarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Genome binding/occupancy profiling by high throughput sequencingExpression profiling by high throughput sequencingOther",
            "Summary": "Amplification of the ubiquitin ligase MDM2 is a common mechanism of P53 inactivation across human tumors. Here we investigated the impact of supraphysiologic MDM2 expression on chromatin topology, gene expression and cellular phenotypes in liposarcoma tumors and models. We identified three independent gene regulatory circuits that predominate in aggressive, dedifferentiated tumors. RUNX and AP-1 family transcription factors bind a shared set of enhancers associated with mesenchymal lineage genes that underlie the developmental state of these tumors. P53 and MDM2 co-occupy enhancers and promoters associated with P53 pathways. When highly expressed, MDM2 also binds an additional set of P53-independent promoters that engage in multi-way physical interactions and regulate genes involved in cell division, RNA splicing, translation and stress responses. We find that liposarcoma cells with low to moderate MDM2 levels are sensitive to P53 inhibitors and their combination with pro-apoptotic agents, but that cells with very high-level MDM2 amplification and expression resist treatment. Hence, heterogeneity of MDM2 expression between and within tumors may compromise therapeutic regimens. In conclusion, we distinguished P53-dependent and P53-independent circuits in MDM2 copy number amplified tumors whose interplay has implications for targeted therapy.",
            "Overall design": "Samples from liposarcoma. ChIP-Seq and RNA-Seq data was extracted from Non Treated (NT) cells, or cells treated with HDM201.NOTE FROM SUBMITTER: The tumor data is still pending IRB. The raw data will be submitted to the dbGAP",
            "Platforms": "Platforms (2), GPL18573, Illumina NextSeq 500 (Homo sapiens), , GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6578439": {
                    "link": "/geo/query/acc.cgi?acc=GSM6578439",
                    "name": "LPS141, DMSO, RUNX2, rep1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM6578439_210223_LPS141_DMSO_RUNX2.bed.gz",
                            "file_size": "529.3 Kb",
                            "file_type": "BED",
                            "download_link": "/geo/download/?acc=GSM6578439&format=file&file=GSM6578439%5F210223%5FLPS141%5FDMSO%5FRUNX2%2Ebed%2Egz"
                        }
                    ],
                    "Status": "Public on Apr 10, 2023",
                    "Title": "LPS141, DMSO, RUNX2, rep1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: LPS141cell type: liposarcoma celltreatment: DMSOtimepoint: 0hchip antibody: RUNX2",
                    "Treatment protocol": "no treatment, DMSO, or 100nM HDM201 as indicated in sample name",
                    "Growth protocol": "Base Media: RPMI, 15% FBS, 1% penstrep, 1% glutamax.",
                    "Extracted molecule": "ChIP",
                    "Extraction protocol": "Whole cell lysates were sonicated resulting in an average chromatin fragment size of ~300 bp and immunoprecipiated with the indicated antibodies.Libraries were prepared by ligating Illumina TrueSeq adapters adpators followed by 14 cycles of amplification",
                    "Library strategy": "ChIP-Seq",
                    "Library source": "genomic",
                    "Instrument model": "Illumina NextSeq 500",
                    "Data processing": "ChIP processing:ChIP-Seq data were mapped to the GRCh38 reference genome using STAR aligner (v2.6.0c), including parameters --alignIntronMax 1 --alignEndsType EndToEnd. Tag directories of the mapped reads were created using homer (v4.11.1 using hg38 v6.4), and peaks were called using the findPeaks function.For some of the ChIP-seq samples we do not have any quantitative data; the bed files were generated to address peaks. The ones for which we generated quantitative data, bigWig files are provided.Supplementary files format and content: peak files in bed formatAssembly: hg38",
                    "Platform ID": "GPL18573"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE213300_Cell_Lines_Raw_Counts_Matrix.txt.gz",
                    "file_size": "298.5 Kb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE213300&format=file&file=GSE213300%5FCell%5FLines%5FRaw%5FCounts%5FMatrix%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE213300_LPS141_Nutlin_Raw_Counts.txt.gz",
                    "file_size": "344.6 Kb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE213300&format=file&file=GSE213300%5FLPS141%5FNutlin%5FRaw%5FCounts%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE213300_RAW.tar",
                    "file_size": "1.9 Gb",
                    "file_type": "TAR (of BED, BEDPE, BW, TXT)",
                    "download_link": "/geo/download/?acc=GSE213300&format=file"
                },
                {
                    "file_name": "GSE213300_lps141_rna_countMatrix.txt.gz",
                    "file_size": "259.1 Kb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE213300&format=file&file=GSE213300%5Flps141%5Frna%5FcountMatrix%2Etxt%2Egz"
                }
            ]
        },
        "GSE201056": {
            "Status": "Public on Mar 03, 2023",
            "Title": "Integrated epigenomic analysis identifies structural alterations associated with oncogenic gene expression in liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencingGenome binding/occupancy profiling by high throughput sequencingOther",
            "Summary": "Liposarcoma (LPS) is the most common soft-tissue sarcoma in adults. The two most frequent subtypes well differentiated (WD) and dedifferentiated (DD) LPS are often marked with the giant chromosome and the amplifications of chromosome 12q13-15. However, it remains unknown how this genomic aberrancy contributes to the dysregulation of the oncogenes. Here, we reported a comprehensive molecular characterization of both tumor and normal tissues from the same batch of LPS patients, including Hi-C, H3K27ac ChIP-seq, RNA-seq and WGS datasets. We identified a library of tumor-specific enhancers that may play a critical role in oncogenesis. We also demonstrated the enhancer co-amplification and hijacking events involved with proto-oncogenes such as MDM2, CDK4 and HMGA2, which have not been previously reported and as a novel mechanism to upregulate these genes. By combining Hi-C, optical mapping, Nanopore long reads and WGS data, we partially resolved complex structure variations (SVs) and reconstructed the local genome and the giant chromosome. We further validated the presence of multiple copies of  MDM2 and CDK4 are located on the giant chromosome by fluorescent in situ hybridization (FISH). Consequently, this study provides a comprehensive resource for further research in LPS.",
            "Overall design": "We started with 5 pairs of WD-LPS, 14 pairs of DD-LPS patient samples, and 1 DD-LPS cell line. Each pair of patient samples contains one tumor tissue and one matched peritumoral tissue as control. To profile the transcribed regions and to reveal the differential transcriptomes between tumors and peritumoral tissues, we performed mRNA sequencing (mRNA-seq) in all patient samples and cell lines. In 4 pairs of DD-LPS patient samples (P241, P298, P69 and P209) and 1 DD-LPS cell line (Lipo863B), we performed 1) chromatin immunoprecipitation followed by DNA-seq (ChIP-seq) for histone modifications H3 lysine 27 acetylation (H3K27ac), to chart the open chromatin regions and DD-LPS-specific regulatory elements, such as enhancers; 2) Hi-C experiments to study high-order chromatin structure and link distal enhancers to their target genes; 3) whole genome sequencing (WGS) to profile CNVs and dissect genome rearrangements. To better reveal the sequence details of genome rearrangements, we performed Nanopore long-read sequencing and BioNano optical mapping in Lipo863B cells to help assemble the rearranged regions. In total, we generated 71 genomic datasets, including 62 for the patient tissue samples and 9 for the cell line Lipo863B.Raw data not provided for patient samples due to patient privacy concerns.",
            "Platforms": "Platforms (2), GPL24676, Illumina NovaSeq 6000 (Homo sapiens), , GPL28975, GridION (Homo sapiens)",
            "Samples": {
                "GSM6049696": {
                    "link": "/geo/query/acc.cgi?acc=GSM6049696",
                    "name": "Lipo863B-rep1-RNAseq",
                    "Supplementary file": [
                        {
                            "file_name": "GSM6049696_Lipo863B-rep1.tpm.txt.gz",
                            "file_size": "249.2 Kb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM6049696&format=file&file=GSM6049696%5FLipo863B%2Drep1%2Etpm%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Mar 03, 2023",
                    "Title": "Lipo863B-rep1-RNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "disease state: Liposarcomacell line: Lipo863B",
                    "Growth protocol": "Liposarcoma cell lines were cultured in Dulbecco's Modified Eagle's Medium supplemented with 15% FBS and additional 1 mM GlutaMax supplement (ThermoFisher, 35050061).",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "20 mg of ground patient samples or 1.5 million liposarcoma cells were used for RNA-seq. The total RNA was extracted from Trizol according to the manufacturer’s protocol (Invitrogen). PolyA RNA was purified from 1,000 ng of total RNA using oligo (dT) beads (Invitrogen).Extracted RNA was first fragmented, then followed by reverse transcription, end-repair, adenylation, adaptor ligation, and subsequent PCR amplification. The final product was checked by size distribution and concentration using a BioAnalyzer High Sensitivity DNA Kit (Agilent) and Kapa Library Quantification Kit (Kapa Biosystems).",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "Cell Line",
                    "Data processing": "RNA-seq reads were aligned to hg38 genome assembly using STAR; The TPM value of gene expression was caculated using RSEM.ChIP-seq and ATAC-seq reads were aligned to hg38 genome assembly using Bowtie2;H3K27ac ChIP-Seq peaks were called using MACS2.Hi-C raw FASTQ files and then mapped the trimmed files against hg38 human reference genome using runHiC pipeline. Hi-C matrix was generated using cooler.WGS raw FASTQ files were first trimmed for adapter and then mapped against hg38 human reference genome using BWA-MEM algorithm (0.7.17-r1188). Duplicate reads were removed using Picard Tools.Nanopore raw FASTQ files were mapped against the hg38 reference genome using the minimap2. The structure variations were identified using Sniffles.Assembly: hg38 (GRCh38)Supplementary files format and content: tab-delimited text files include TPM values for each Sample; the bigwig files included sequencing reads enrichment signal for each Sample; The .cool file were the multi-resolution matrix of Hi-C for each Sample; the .vcf files included the structure variation information.",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE201056_RAW.tar",
                    "file_size": "14.7 Gb",
                    "file_type": "TAR (of BIGWIG, BW, COOL, TXT, VCF)",
                    "download_link": "/geo/download/?acc=GSE201056&format=file"
                }
            ]
        },
        "GSE190438": {
            "Status": "Public on Jan 30, 2023",
            "Title": "Signalling inhibition by ponatinib disrupts alternative lengthening of telomeres (ALT)",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Analyses of gene expression changes in cells treated with ponatinib (experiment 1), and in cells either lacking JUN or overexpressing JUN (experiment 2).",
            "Overall design": "Experiment 1: RNA-seq on SAOS-2 or T1000 cells treated with either DMSO (as a control) or ponatinib (250nM for 24 hours); 2 replicates per condition.  Experiment 2: Identification of potential JUN transcription targets by RNA-seq in SAOS2 cells lacking JUN (cjun sg vs. LacZ sg as a control) or overexpressing JUN (JUN vs. CTRL (GFP overexpressing cells)); 3 replicates per condition",
            "Platforms": "Platforms (2), GPL20301, Illumina HiSeq 4000 (Homo sapiens), , GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM5723801": {
                    "link": "/geo/query/acc.cgi?acc=GSM5723801",
                    "name": "Experiment 1_SAOS2_DMSO_4",
                    "Supplementary file": [
                        {
                            "file_name": "GSM5723801_SAOS2_DMSO_4.tsv.gz",
                            "file_size": "2.7 Mb",
                            "file_type": "TSV",
                            "download_link": "/geo/download/?acc=GSM5723801&format=file&file=GSM5723801%5FSAOS2%5FDMSO%5F4%2Etsv%2Egz"
                        }
                    ],
                    "Status": "Public on Jan 30, 2023",
                    "Title": "Experiment 1_SAOS2_DMSO_4",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell type: osteosarcoma cellstreatment: DMSO (replicate 1)cell line: SAOS2",
                    "Treatment protocol": "Experiment 1: cells were treated with either DMSO or ponatinib (250 nM) for 24 hours before collection. Experiment 2: Cells were transduced with lentiviral particules containing desired plasmids, and then selected with puromycin for at least 7 days before collection.",
                    "Growth protocol": "SAOS2 and T1000 cells were cultured in DMEM and RPMI media, respectively, supplemented with 10% FBS and 1% PS",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was extracted using Qiagen RNeasy Mini kit (experiment 1) or Promega Reliaprep RNA cell miniprep kit (experiment 2).Poly-A mRNAs enrichment",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina HiSeq 4000",
                    "Data processing": "Experiment 1: 100 bp paired-end reads were pseudo-aligned and quantified to Gencode  (hg38)  transcripts using the Kallisto program.Experiment 2: Paired-end reads were aligned to the reference genome using Hisat2 v2.0.5. FeatureCounts v1.5.0-p3 was used to count the reads numbers mapped to each gene and subsequently, FPKM values were calculated for every gene.Supplementary_files_format_and_content: Expression abundances in terms of FPKM or TPM as measured by DESeq2 or Kallisto respectively.",
                    "Platform ID": "GPL20301"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE190438_JUN_targets_gene_fpkm.txt.gz",
                    "file_size": "4.7 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE190438&format=file&file=GSE190438%5FJUN%5Ftargets%5Fgene%5Ffpkm%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE190438_RAW.tar",
                    "file_size": "21.6 Mb",
                    "file_type": "TAR (of TSV)",
                    "download_link": "/geo/download/?acc=GSE190438&format=file"
                }
            ]
        },
        "GSE159848": {
            "Status": "Public on Dec 31, 2022",
            "Title": "Expression data from 50 mixoid liposarcomas",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "Based on the transcriptome analysis of 555 sarcomas, we identified a group of tightly clustered leiomyosarcomas (LMS) due to their gene expression homogeneity. We named them “hLMS” and the other LMS “oLMS”. We derived a transcriptional signature able to identify each group and used it to classify patients from two independent cohorts. In all cohorts, hLMS were preferentially carried by women, located in the internal trunk, highly differentiated, and similarly altered at the genomic level. Based on integrative bioinformatic analysis, we show that hLMS originate from vascular smooth muscle cells presenting both contractile and synthetic characteristics, while oLMS could derive from fibroblasts. We found strong MYOCD expression to be an hLMS-specific driver and show that the MYOCD/SRF axis is essential only for hLMS survival. Identification of hLMS could become standard clinical practice, leading to the development of specific effective treatments with MYOCD/SRF inhibitors.",
            "Overall design": "50 mixoid liposarcomas hybridized to Agilent-014850 Whole Human Genome Microarray 4x44K G4112F",
            "Platforms": "Platforms (1), GPL6480, Agilent-014850 Whole Human Genome Microarray 4x44K G4112F (Probe Name version)",
            "Samples": {
                "GSM4848353": {
                    "link": "/geo/query/acc.cgi?acc=GSM4848353",
                    "name": "mLPS1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM4848353_053135_DY769_1_2.txt.gz",
                            "file_size": "1.9 Mb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM4848353&format=file&file=GSM4848353%5F053135%5FDY769%5F1%5F2%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Dec 31, 2022",
                    "Title": "mLPS1",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "Sex: Mage: 44subject status/id: mixoid liposarcoma patient 1metastasis: 0time_mfs: 9.78630136986301os: 0time_os: 9.78630136986301location: Extremitiesgrade: 1differentiation: 2",
                    "Treatment protocol": "Frozen tissue",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "Total RNA were extracted from frozen tumor samples using the miRNeasy® Mini Kit (Qiagen) and purified using the RNeasy® Min Elute TM Cleanup Kit (Qiagen) according to the manufacturer’s procedures. RNA quality was checked on an Agilent 2100 bioanalyzer (Agilent Technologies, Santa Clara, CA, USA).",
                    "Description": "DY769",
                    "Data processing": "For each series all microarrays were simultaneously normalized using the Quantile algorithm.",
                    "Platform ID": "GPL6480"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE159848_RAW.tar",
                    "file_size": "96.6 Mb",
                    "file_type": "TAR (of TXT)",
                    "download_link": "/geo/download/?acc=GSE159848&format=file"
                }
            ]
        },
        "GSE179720": {
            "Status": "Public on Apr 18, 2022",
            "Title": "The   FUS-DDIT3 fusion oncoprotein inhibits BAF complex targeting and activity in myxoid liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencingGenome binding/occupancy profiling by high throughput sequencingOther",
            "Summary": "Mammalian SWI/SNF (mSWI/SNF or BAF) ATP-dependent chromatin remodeling complexes play critical roles in governing genomic architecture and gene expression and are frequently perturbed in human cancers. Transcription factors (TFs), including fusion oncoproteins, can bind to BAF complex surfaces to direct chromatin targeting and accessibility, often activating oncogenic gene loci. Here, we demonstrate that the FUS-DDIT3 fusion oncoprotein hallmark to myxoid liposarcoma (MLPS) inhibits BAF complex-mediated remodeling of adipogenic enhancer sites via sequestration of the adipogenic TF, CEBPB, from the genome. In mesenchymal stem cells, small molecule inhibition of BAF complex ATPase activity attenuates adipogenesis via failure of BAF-mediated DNA accessibility and gene activation at CEBPB target sites genome-wide. BAF chromatin targeting and gene expression profiles of FUS-DDIT3-expressing cell lines and primary tumors exhibit similarity to SMARCB1-deficient BAF loss-of-function tumor types. These data present a novel mechanism by which fusion oncoproteins generate BAF complex loss-of-function phenotypes, independent of deleterious subunit mutations.",
            "Overall design": "ChIP-seq, Cut & Run, RNA-seq, and ATAC-seq in MLPS-1765-92 (FUS-DDIT3 fusion), MLPS-402-91 (FUS-DDIT3 fusion), 1BD5 (MLPS-1765-92 SMARCB1-null), 3AA3 (MLPS-1765-92 SMARCB1-null), hTERT-MSC, AD-MSC, and MLPS primary tumors to investigate the role of the FUS-DDIT3 fusion oncoprotein on BAF complex targeting and activity, especially in the context of Myxoid Liposarcoma and adipogenesis",
            "Platforms": "Platforms (1), GPL18573, Illumina NextSeq 500 (Homo sapiens)",
            "Samples": {
                "GSM5429774": {
                    "link": "/geo/query/acc.cgi?acc=GSM5429774",
                    "name": "20201216_HJZ063_3AA3_shSCR_INPUT_S7_R1_001",
                    "Supplementary file": [
                        {
                            "file_name": "GSM5429774_20201216_HJZ063_3AA3_shSCR_INPUT_S7_R1_001.bw",
                            "file_size": "269.4 Mb",
                            "file_type": "BW",
                            "download_link": "/geo/download/?acc=GSM5429774&format=file&file=GSM5429774%5F20201216%5FHJZ063%5F3AA3%5FshSCR%5FINPUT%5FS7%5FR1%5F001%2Ebw"
                        }
                    ],
                    "Status": "Public on Apr 18, 2022",
                    "Title": "20201216_HJZ063_3AA3_shSCR_INPUT_S7_R1_001",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: 3AA3experimental condition: genotype: SMARCB1-nullchip antibody: Input",
                    "Treatment protocol": "Constitutive expression of short-hairpin RNA (shRNA) constructs targeting either the C-terminal end of the FUS-DDIT3 fusion (shDDIT3: 5’-CGGCTCAAGCAGGAAATCG-3’), SMARCA4/BRG1 (shBRG1: 5’-AGCCTCAACGACCTAGAGA-3’), or a scrambled, non-silencing sequence (shSCR: 5’-TCTCGCTTGGGCGAGAGTAAG-3’) was achieved using lentiviral infection of the GIPZ vector selected with puromycin (2 μg/ml).    Lentivirus was produced by PEI (Polysciences) transfection of HEK293T LentiX cells (Clontech) with gene delivery vector co-transfected with packaging vectors pspax2 and pMD2.G. Viral supernatants were harvested 72 hr post-transfection and concentrated by ultracentrifugation at 20,000 rpm for 2.5 hr at 4°C. Virus containing pellets were resuspended in PBS and added dropwise to cells in the presence of 10 μg/mL polybrene. Selection of lentivirally-infected cells was achieved with puromycin used at 2 μg/ml. Knockdown efficiency and overexpression was measured by western blot analysis.    The SMARCB1 locus was targeted by the Ini1 (h) CRISPR/Cas9 KO Plasmid (Santa Cruz Biotechnology sc-423027) in MLPS-1765-92 cells following the manufacturer’s protocol with the Lipofectamine 3000 transfection reagent (Invitrogen). Cells were expanded for 72-96 hours and GFP+ cells expressing the KO plasmids were single-cell sorted using FACS (fluorescence-activated cell sorting). Single-cell clones were expanded and screened using immunoblot detection for identification of successful knockouts.",
                    "Growth protocol": "MLPS-1765-92 and MLPS-402-91 cells were cultured in RPMI medium (Gibco) supplemented with 10% fetal bovine serum, 1% Glutamax (Gibco), 1% Sodium Pyruvate (Gibco), and 1% Penicillin-Streptomycin (Gibco). MLPS-DL221 cells were cultured in DMEM medium (Gibco) supplemented with 10% fetal bovine serum, 1% Glutamax (Gibco), 1% Sodium Pyruvate (Gibco), and 1% Penicillin-Streptomycin (Gibco). hTERT-MSC and AD-MSC lines were cultured in Mesenchymal Stem Cell Basal Medium (ATCC No. PCS-500-030) supplemented with the Mesenchymal Stem Cell Growth Kit for Adipose and Umbilical-derived MSCs - Low Serum (ATCC No. PCS-500-040) and 0.1% Penicillin-Streptomycin (Gibco). HEK293T LentiX cells were cultured in DMEM medium (Gibco) supplemented with 10% fetal bovine serum, 1% Glutamax (Gibco), 1% Sodium Pyruvate (Gibco), 1% HEPES (Gibco), 1% MEM NEAA (Gibco), and 1% Penicillin-Streptomycin (Gibco). All cells were maintained in a humidified incubator at 37°C with 5% CO2.     Deidentified myxoid liposarcoma (n=10 for RNA-seq), Ewing sarcoma (n=10 for RNA-seq), cases were identified, with pathology and diagnosis confirmed by two independent pathologists at MD Anderson Cancer Center (MDACC).",
                    "Extracted molecule": "ChIP",
                    "Extraction protocol": "ChIP-seq protocol Cells were harvested following 72-hr exposure to specified lentivirus and 4 day selection with 2 μg/ml of puromycin. ChIP experiments were performed per standard protocols (Millipore, Billerica, MA) with minor modifications. Briefly, cells were cross-linked for 10 min with 1% formaldehyde at 37 °C. This reaction was subsequently quenched with 125 mM glycine for 5 min and 10 million fixed cells were used per ChIP experiment. Chromatin from fixed cells was fragmented by sonication with a Covaris E220 and the solubilized chromatin was incubated with the indicated antibody listed overnight at 4°C. Antibody-chromatin complexes were pulled down by incubation with Protein G-Dynabeads (Thermo Scientific) for 2 hours at 4°C, washed, and eluted. The samples then underwent crosslink reversal, RNase A (Roche) treatment, and proteinase K (Thermo Scientific) treatment before the captured DNA was extracted with AMPure XP beads (Beckman Coulter). ChIP-seq libraries were prepared with Illumina’s NEBNext Ultra II DNA library Prep Kit using standard protocols. ChIP-seq was sequenced on Illumina Next-seq 500 using 75 bp single-end sequencing parameters.ATAC-seq protocol Cells were harvested following 72-hr exposure to lentivirus and 4 days of selection with 2 μg/ml of puromycin. ATAC-seq experiments were performed as previously described. Samples for ATAC-seq prepared using the Nextera DNA sample Prep Kit (Illumina). Briefly, 50K cells were incubated in hypotonic buffer and lysis buffer, then were resuspended in transposase reaction mixture for 30 min at 37°C with gentle shaking followed by DNA purification and 12 cycles of amplification. ATAC-seq samples were sequenced on Next-seq 500 (Illumina) using 37 bp pair-end sequencing parameters.RNA-seq protocol Cells were harvested following 72-hr exposure to the specified lentivirus and either 4 day (day 7 post-transduction) or 11 day (day 14 post-transduction) selection with 2 μg/ml of puromycin for RNA-seq experiments. All RNA was collected using the RNeasy Mini Kit (Qiagen). RNA-seq libraries were prepared using the Nebnext Poly(A) mRNA Magnetic Isolation Module and the Nebnext Ultra II Directional RNA Library Prep Kit for Illumina using standard protocols. RNA was sequenced on Illumina Next-seq 500 (Illumina) using 75 bp single-end sequencing parameters.    Snap-frozen tumor tissue samples were obtained from the MD Anderson Institutional Tissue Bank (ITB) using an IRB-approved protocol. Frozen samples were embedded in O.C.T. (Tissue-Tek), sectioned in a Cryostat (Leica CM1680 UV) and underwent hematoxylin and eosin staining for pathologist review to confirm the presence of viable tumor tissue. Tissues were then excised from O.C.T. using scalpel and forceps and 30 mg samples were placed in RNAlater-ICE (Invitrogen) pre-chilled to -80°C. Samples were thawed overnight at -20°C, then disrupted using a TissueLyser LT (Qiagen) for 5 minutes at 50 Hz. RNA was isolated using the RNeasy Mini Kit (Qiagen), following the manufacturer protocol with on-column DNase I (Qiagen) digestion.Cut & Run protocol Cells were harvested following 24-hr exposure to DMSO or 10uM of CMP12 (generous gift of Jun Qi) followed by 24-hr exposure to DMSO plus base media or StemPro Adipogenesis media (ThermoFisher) or 10uM CMP12 plus base media or StemPro Adipogenesis media. CUT&RUN experiments were performed according to established protocols with minor modifications. Briefly, 500K cells per sample were incubated with Concanavalin A-coated beads (Polysciences) for 10 min and then permeabilized with Triton X-100. Cell-bead complexes were then incubated with the indicated antibody for 2 hr at 4°C. Cell-bead complexes were washed and then incubated with pA-MNase for 1 hr at 4°C. Cell-bead complexes were washed and then cooled to ~0°C. pA-MNase was activated by the addition of calcium chloride and incubated for 30 min at ~0°C. The cleavage reaction was quenched with a solution containing spike-in DNA and RNAase A. Cleaved DNA fragments released into solution were then collected and treated with sodium dodecyl sulfate (SDS) and proteinase K (Thermo Scientific). DNA was then isolated using phenol-chloroform. CUT&RUN libraries were prepared with Illumina’s NEBNext Ultra II DNA library Prep Kit with modifications that aim to preserve short fragments.ChIP-seq libraries were prepared with Illumina’s NEBNext Ultra II DNA library Prep Kit using standard protocols. ChIP-seq was sequenced on Illumina Next-seq 500 using 75 bp single-end sequencing parameters.    CUT&RUN libraries were prepared with Illumina’s NEBNext Ultra II DNA library Prep Kit with modifications that aim to preserve short fragments.    ATAC-seq samples were sequenced on Next-seq 500 (Illumina) using 37 bp pair-end sequencing parameters.    RNA-seq libraries were prepared using the Nebnext Poly(A) mRNA Magnetic Isolation Module and the Nebnext Ultra II Directional RNA Library Prep Kit for Illumina using standard protocols. RNA was sequenced on Illumina Next-seq 500 (Illumina) using 75 bp single-end sequencing parameters.",
                    "Library strategy": "ChIP-Seq",
                    "Library source": "genomic",
                    "Instrument model": "Illumina NextSeq 500",
                    "Data processing": "Illumina NextSeq output data were demultiplexed and converted to FASTQ format using the bcl2fastq software tool.RNAseq reads were aligned to the hg19 genome with STAR v2.5.2b, which output gene count tables to the hg19 refFlat annotation, and ChIPseq reads were aligned with Bowtie2 v2.29 in the -k 1 reporting mode.For the ATACseq data, quality read trimming was performed by Trimmmomatic v0.36, followed by alignment, duplicate read removal, and read quality filtering, using Bowtie2 v2.29, Picard v2.8.0, and SAMtools v0.1.19, respectively.For the ChIPseq and ATACseq data, output BAM files were converted into BigWig track files using MACS2 and UCSC utilities in order to display coverage throughout the genome (in RPM).For Cut & Run libraries, the CutRunTools pipeline was used to perform read trimming, quality filtering, alignment, peak calling, and track building using default parametersGenome_build: hg19Supplementary_files_format_and_content: bigWig files give the normalized coverage of DNA fragments across the genome in reads per million and gene count tables give raw read counts mapped to exons of given genes. Spike-in normalization of bigWig files can be incoporated by scaling the bigWig files by the ratio of fly to human reads in the control sample divided by the ratio of fly to human reads in each sample, i.e. (fly / human)_control / (fly / human)_sample. The total number of mapped fly and human reads can be estimated by aligning the fastq files to the hg19 and dm3 genome and then summing the third column (mapped reads) from the samtools idxstats output.",
                    "Platform ID": "GPL18573"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE179720_RAW.tar",
                    "file_size": "21.9 Gb",
                    "file_type": "TAR (of BW, TAB)",
                    "download_link": "/geo/download/?acc=GSE179720&format=file"
                }
            ]
        },
        "GSE184436": {
            "Status": "Public on Mar 28, 2022",
            "Title": "Fusion protein-driven IGF-IR/PI3K/AKT signals deregulate Hippo pathway promoting oncogenic cooperation of YAP1 and FUS-DDIT3 in myxoid liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Myxoid liposarcoma (MLS) represents a common subtype of liposarcoma molecularly characterized by a recurrent chromosomal translocation that generates a chimeric FUS DDIT3 fusion gene. The FUS-DDIT3 oncoprotein has been shown to be crucial in MLS pathogenesis. Acting as a transcriptional dysregulator, FUS-DDIT3 stimulates proliferation and interferes with adipogenic differentiation. As the fusion protein represents a therapeutically challenging target, a profound understanding of MLS biology is elementary to uncover FUS DDIT3-dependent molecular vulnerabilities. Recently, a specific reliance on the Hippo pathway effector and transcriptional co-regulator YAP1 was detected in MLS; however, details on the molecular mechanism of FUS-DDIT3-dependent YAP1 activation, and YAP1's precise mode of action remain unclear. In elaborate in vitro studies, employing RNA interference-based approaches, small-molecule inhibitors, and stimulation experiments with IGF-II, we show that FUS-DDIT3-driven IGF-IR/PI3K/AKT signaling promotes stability and nuclear accumulation of YAP1 via deregulation of the Hippo pathway. Co-immunoprecipitation and proximity ligation assays revealed nuclear co localization of FUS-DDIT3 and YAP1/TEAD in FUS-DDIT3-expressing mesenchymal stem cells and MLS cell lines. Transcriptome sequencing of MLS cells demonstrated that FUS DDIT3 and YAP1 co-regulate oncogenic gene signatures related to proliferation, cell cycle progression, apoptosis, and adipogenesis. In adipogenic differentiation assays, we show that YAP1 critically contributes to FUS-DDIT3-mediated adipogenic differentiation arrest. Taken together, our study provides mechanistic insights into a complex FUS-DDIT3-driven network involving IGF-IR/PI3K/AKT signals acting on Hippo/YAP1, and uncovers substantial cooperative effects of YAP1 and FUS-DDIT3 in the pathogenesis of MLS.",
            "Overall design": "siRNA-mediated knockdown of FUS-DDIT3 and YAP1 in MLS 402-91",
            "Platforms": "Platforms (1), GPL20301, Illumina HiSeq 4000 (Homo sapiens)",
            "Samples": {
                "GSM5588972": {
                    "link": "/geo/query/acc.cgi?acc=GSM5588972",
                    "name": "MLS402-91_siCTRL_R1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM5588972_ctrl-48h-r1_OE0565_MLS_402-91.fpkm_tpm.featureCounts.tsv.gz",
                            "file_size": "3.6 Mb",
                            "file_type": "TSV",
                            "download_link": "/geo/download/?acc=GSM5588972&format=file&file=GSM5588972%5Fctrl%2D48h%2Dr1%5FOE0565%5FMLS%5F402%2D91%2Efpkm%5Ftpm%2EfeatureCounts%2Etsv%2Egz"
                        }
                    ],
                    "Status": "Public on Mar 28, 2022",
                    "Title": "MLS402-91_siCTRL_R1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: MLS402-91treatment: control siRNA",
                    "Treatment protocol": "MLS402-91 cells were seeded in 6-well plates and transfected with 25 pmol YAP1 siRNA, DDIT3 siRNA or a non-targeting negative control siRNA using Lipofectamine RNAiMAX (Invitrogen). After 6h, the medium was changed to RPMI 1640 supplemented with 2% fetal bovine serum and incubated for 48h.",
                    "Growth protocol": "MLS402-91 cells were cultured in RPMI 1640 supplemented with 10% fetal bovine serum.",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Total RNA was extracted with an RNeasy Plus Mini Kit (QIAGEN, #74134) and DNase treated.Illumina TruSeq Stranded kit was used for library preparation. Each sample was barcoded with an i5/i7 pair of TruSeq DNA/RNA UDI indices. The pooled library was sequenced in two lanes.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina HiSeq 4000",
                    "Data processing": "Basecalling was performed using bcl2fastq 2.20.0.422.The RNAseq data was analysed with the DKFZ/ODCF RNAseq workflow 1.3.0.FASTQ reads for individual samples were aligned by a 2-pass alignment using the STAR aligner 2.5.3a.Duplicate marking of the resultant main alignment file was done with sambamba 0.6.5.The chimeric file was sorted using samtools 1.6.BAM indexes were generated using sambamba 0.6.5.Quality control analysis was performed using samtools flagstat and the rnaseqc tool version 1.1.8. Depth of coverage analysis for rnaseqc was turned off.Gene-specific read counting was performed using featureCounts version 1.5.1 over exon features based on the GENCODE 19 gene models. Only unique alignments were counted. Strand specific counting was also used.A custom script was used to calculate RPKM and TPM expression values. For total library abundance calculations, all genes on chromosomes X, Y, MT as well as rRNA and tRNA genes were omitted, as they are likely to introduce library size estimation biases.Genome_build: 1000 Genomes Project Phase II Reference Genome (hs37d5) based on NCBI GRCh37, and GENCODE 19 gene models.Supplementary_files_format_and_content: Tab-delimited text files with gene IDs, gene names, raw counts, RPKM and TPM values.",
                    "Platform ID": "GPL20301"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE184436_RAW.tar",
                    "file_size": "22.0 Mb",
                    "file_type": "TAR (of TSV)",
                    "download_link": "/geo/download/?acc=GSE184436&format=file"
                }
            ]
        },
        "GSE118336": {
            "Status": "Public on Apr 19, 2021",
            "Title": "HTA2.0 (human transcriptome array) analysis of control iPSC-derived motor neurons (MN), FUS-H517D-hetero-iPSC-MN, and FUS-H517D-homo-iPSC-MNs",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "To assess  RNA regulation in the MN possessing mutated FUS-H517D gene.Fused in sarcoma/translated in liposarcoma (FUS) is a causative gene of familial amyotrophic lateral sclerosis (fALS). Mutated FUS causes accumulation of DNA damage stress and stress granule (SG) formation, etc., thereby motor neuron (MN) death. However, key molecular etiology of mutated FUS-dependent fALS (fALS-FUS) remains unclear. Here, Bayesian gene regulatory networks (GRN) calculated by Super-Computer with transcriptome data sets of induced pluripotent stem cell (iPSC)-derived MNs possessing mutated FUSH517D (FUSH517D MNs) and FUSWT identified TIMELESS, PRKDC and miR-125b-5p as \"hub genes\" which influence fALS-FUS GRNs. miR-125b-5p expression up-regulated in FUSH517D MNs, showed opposite correlations against FUS and TIMELESS mRNA levels as well as reported targets of miR-125b-5p. In addition, ectopic introduction of miR-125b-5p could suppress mRNA expression levels of FUS and TIMELESS in the cells. Furthermore, we found TIMELESS and PRKDC among key players of DNA damage stress response (DDR) were down-regulated in FUSH517D MNs and cellular model analysis validated DDR under impaired DNA-PK activity promoted cytosolic FUS mis-localization to SGs. Our GRNs based on iPSC models would reflect fALS-FUS molecular etiology.",
            "Overall design": "RNA from each control MN,  FALS-derived MN possessing H517D mutation in hetero and isogenic MN possessing H517D mutation in homo.  One array per biological replicate.",
            "Platforms": "Platforms (1), GPL17586, [HTA-2_0] Affymetrix Human Transcriptome Array 2.0 [transcript (gene) version]",
            "Samples": {
                "GSM3325490": {
                    "link": "/geo/query/acc.cgi?acc=GSM3325490",
                    "name": "Control iPSC 201B7, 2wks, biological rep1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM3325490_EA1386_01.CEL.gz",
                            "file_size": "24.8 Mb",
                            "file_type": "CEL",
                            "download_link": "/geo/download/?acc=GSM3325490&format=file&file=GSM3325490%5FEA1386%5F01%2ECEL%2Egz"
                        },
                        {
                            "file_name": "GSM3325490_EA1386_01_2.sst-rma-gene-full.chp.gz",
                            "file_size": "461.5 Kb",
                            "file_type": "CHP",
                            "download_link": "/geo/download/?acc=GSM3325490&format=file&file=GSM3325490%5FEA1386%5F01%5F2%2Esst%2Drma%2Dgene%2Dfull%2Echp%2Egz"
                        }
                    ],
                    "Status": "Public on Apr 19, 2021",
                    "Title": "Control iPSC 201B7, 2wks, biological rep1",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell type: iPSC-MNgenotype: FUSWT/WTtime (differentiation from motor neuron precursor): 2 weeks",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "Total RNA were extracted by miRNeasy Kit with QIAzol (QIAGEN)",
                    "Description": "Gene expression data from iPSC-MN",
                    "Data processing": "The data were analyzed with Expression Console Software 1.4 offered SST-RMA for gene level analysis using Thermo Fisher Scientific default analysis settings.",
                    "Platform ID": "GPL17586"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE118336_RAW.tar",
                    "file_size": "1.5 Gb",
                    "file_type": "TAR (of CEL, CHP)",
                    "download_link": "/geo/download/?acc=GSE118336&format=file"
                }
            ]
        },
        "GSE83690": {
            "Status": "Public on Jun 01, 2017",
            "Title": "miR-193b-regulated signaling networks inhibit adipogenesis and promote oncogenesis in liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "miR-193b functions as a tumor suppressor in liposarcoma cells. Microarray was used to identify the targets of miR-193b. The functions of identified miR-193b targets were further investigated in liposarcoma cells.",
            "Overall design": "Total RNA was isolated after treatment with control miRNA or miR-193b for 72 hours in DDLS and WDLS liposarcoma cells. Samples for each group in triplicate were processed for Illumina bead arrays (Illumina HT-12) by the MSKCC genomics core facility according to manufacturer instructions.",
            "Platforms": "Platforms (1), GPL10558, Illumina HumanHT-12 V4.0 expression beadchip",
            "Samples": {
                "GSM2212765": {
                    "link": "/geo/query/acc.cgi?acc=GSM2212765",
                    "name": "DD8817 Control miRNA rep1",
                    "Status": "Public on Jun 01, 2017",
                    "Title": "DD8817 Control miRNA rep1",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: DD8817 liposarcoma cellstreatment: Control miRNA",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "Total RNA was isolated with Direct-zol RNA miniprep Kit (Zymo).",
                    "Description": "DD_NS_1replicate 1",
                    "Data processing": "The data were analyzed with GenomeStudio using Illumina default analysis settings. No normalization and background correction are performed first, then quantile normalization and background correction are done.",
                    "Platform ID": "GPL10558"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE83690_RAW.tar",
                    "file_size": "26.2 Mb",
                    "file_type": "TAR",
                    "download_link": "/geo/download/?acc=GSE83690&format=file"
                },
                {
                    "file_name": "GSE83690_non-normalized_data.txt.gz",
                    "file_size": "6.7 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE83690&format=file&file=GSE83690%5Fnon%2Dnormalized%5Fdata%2Etxt%2Egz"
                }
            ]
        },
        "GSE57502": {
            "Status": "Public on Feb 09, 2017",
            "Title": "The epigenetic reader protein SPIN1 controls proliferation and survival of liposarcoma by modulating the RET signaling pathway",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencingGenome binding/occupancy profiling by high throughput sequencing",
            "Summary": "This SuperSeries is composed of the SubSeries listed below.",
            "Overall design": "Refer to individual Series",
            "Platforms": "Platforms (1), GPL11154, Illumina HiSeq 2000 (Homo sapiens)",
            "Samples": {
                "GSM1383878": {
                    "link": "/geo/query/acc.cgi?acc=GSM1383878",
                    "name": "Input, T778 cells, biological replicate 1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM1383878_Input_T778_cells_Rpl1.wig.gz",
                            "file_size": "601.6 Mb",
                            "file_type": "WIG",
                            "download_link": "/geo/download/?acc=GSM1383878&format=file&file=GSM1383878%5FInput%5FT778%5Fcells%5FRpl1%2Ewig%2Egz"
                        }
                    ],
                    "Status": "Public on Feb 09, 2017",
                    "Title": "Input, T778 cells, biological replicate 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell type: Liposarcoma cellsgenotype: Controlpassages: 17-20chip antibody: None",
                    "Growth protocol": "Human T778 liposarcoma  cells were maintained in RPMI medium supplemented with 10 % FBS and glutamine.",
                    "Extracted molecule": "ChIP",
                    "Extraction protocol": "Metzger, E., et al. Phosphorylation of histone H3 at threonine 11 establishes a novel chromatin mark for transcriptional regulation. Nat Cell Biol 10, 53-60 (2008).Libraries were prepared from immunoprecipitated DNA according to standard methods. ChIP-seq libraries were sequenced using a HiSeq 2000 (Illumina) and mapped to the hg19 reference genome using bowtie 2Langmead, B., Trapnell, C., Pop, M. & Salzberg, S.L. Ultrafast and memory-efficient alignment of short DNA sequences to the human genome. Genome Biol 10, R25 (2009).",
                    "Library strategy": "ChIP-Seq",
                    "Library source": "genomic",
                    "Instrument model": "Illumina HiSeq 2000",
                    "Data processing": "peak finding algorithm MACS 1.41All peaks with FDR greater than 2 % were excluded from further analysisChIP-seq libraries were sequenced using a HiSeq 2000 (Illumina) and mapped to the mm10 reference genome using bowtie 2Genome_build: hg19Supplementary_files_format_and_content: The processed data are wiggle (wig) and bed files. The wig files include the read data mapped to the hg19 genome. The bed files contain the peaks that were obtained when normalizing the reads of the LSD1 ChIP-Seq to the Input.",
                    "Platform ID": "GPL11154"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE57502_RAW.tar",
                    "file_size": "3.9 Gb",
                    "file_type": "TAR (of BED, TXT, WIG)",
                    "download_link": "/geo/download/?acc=GSE57502&format=file"
                }
            ]
        },
        "GSE57499": {
            "Status": "Public on Feb 09, 2017",
            "Title": "The epigenetic reader protein SPIN1 controls proliferation and survival of liposarcoma by modulating the RET signaling pathway [ChIP-Seq]",
            "Organism": "Homo sapiens",
            "Experiment type": "Genome binding/occupancy profiling by high throughput sequencing",
            "Summary": "The aim of this study is to identify the SPIN1 target genes in liposarcoma cells",
            "Overall design": "Liposarcoma is one of the most common histological subtypes of soft tissue sarcoma and causes high incidence of morbidity and mortality. Since therapeutic options for liposarcoma treatment are insufficient, there is an urgent need to identify novel therapeutic targets. Here, we show that knockdown of SPIN1, a reader of H3K4me3 and H3R8me2a chromatin marks, strongly reduces proliferation and survival of liposarcoma cells in vitro and in xenograft mouse models. Combining genome-wide chromatin binding and transcriptome analyses, we found that SPIN1 in cooperation with the transcription factor MAZ directly enhances expression of GDNF, an activator of the RET signaling pathway. Accordingly, knockdown of SPIN1 results in reduced levels of GDNF and activated RET explaining diminished liposarcoma cell proliferation and survival. In line with these observations, levels of SPIN1, GDNF, and activated RET are highly increased in human liposarcoma compared to lipoma or normal adipose tissue. Importantly, SPIN1-mediated transcriptional control depends on binding to H3K4me3 suggesting that targeting of this interaction with small molecule inhibitors is a novel strategy to treat liposarcoma.",
            "Platforms": "Platforms (1), GPL11154, Illumina HiSeq 2000 (Homo sapiens)",
            "Samples": {
                "GSM1383878": {
                    "link": "/geo/query/acc.cgi?acc=GSM1383878",
                    "name": "Input, T778 cells, biological replicate 1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM1383878_Input_T778_cells_Rpl1.wig.gz",
                            "file_size": "601.6 Mb",
                            "file_type": "WIG",
                            "download_link": "/geo/download/?acc=GSM1383878&format=file&file=GSM1383878%5FInput%5FT778%5Fcells%5FRpl1%2Ewig%2Egz"
                        }
                    ],
                    "Status": "Public on Feb 09, 2017",
                    "Title": "Input, T778 cells, biological replicate 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell type: Liposarcoma cellsgenotype: Controlpassages: 17-20chip antibody: None",
                    "Growth protocol": "Human T778 liposarcoma  cells were maintained in RPMI medium supplemented with 10 % FBS and glutamine.",
                    "Extracted molecule": "ChIP",
                    "Extraction protocol": "Metzger, E., et al. Phosphorylation of histone H3 at threonine 11 establishes a novel chromatin mark for transcriptional regulation. Nat Cell Biol 10, 53-60 (2008).Libraries were prepared from immunoprecipitated DNA according to standard methods. ChIP-seq libraries were sequenced using a HiSeq 2000 (Illumina) and mapped to the hg19 reference genome using bowtie 2Langmead, B., Trapnell, C., Pop, M. & Salzberg, S.L. Ultrafast and memory-efficient alignment of short DNA sequences to the human genome. Genome Biol 10, R25 (2009).",
                    "Library strategy": "ChIP-Seq",
                    "Library source": "genomic",
                    "Instrument model": "Illumina HiSeq 2000",
                    "Data processing": "peak finding algorithm MACS 1.41All peaks with FDR greater than 2 % were excluded from further analysisChIP-seq libraries were sequenced using a HiSeq 2000 (Illumina) and mapped to the mm10 reference genome using bowtie 2Genome_build: hg19Supplementary_files_format_and_content: The processed data are wiggle (wig) and bed files. The wig files include the read data mapped to the hg19 genome. The bed files contain the peaks that were obtained when normalizing the reads of the LSD1 ChIP-Seq to the Input.",
                    "Platform ID": "GPL11154"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE57499_RAW.tar",
                    "file_size": "3.9 Gb",
                    "file_type": "TAR (of BED, WIG)",
                    "download_link": "/geo/download/?acc=GSE57499&format=file"
                }
            ]
        },
        "GSE55465": {
            "Status": "Public on Oct 30, 2014",
            "Title": "Gene expression profiling of myxoid liposarcomas (validation set INT-B)",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "FUS-CHOP and EWS-CHOP balanced translocations characterize myxoid liposarcoma which encompasses myxoid (ML) and round cell (RC) variants initially believed to be distinct diseases. Currently, myxoid and RC liposarcoma are regarded to represent the well differentiated and the poorly differentiated ends, respectively, within spectrum of myxoid liposarcoma where the fusion proteins blocking lipogenic differentiation play a role in tumor initiation while molecular determinants associated to progression to RC remain poorly understood. Activation of AKT pathway sustained by PIK3CA and PTEN mutations and growth factor receptor signalling such as RET and IGF1R have been recently correlated with the increasing of aggressiveness and RC.  Aim of the present study is to elucidate molecular events involved in driving round cell progression analyzing two small series of MLS selected to be representative of the two end of the gamut: the pure myxoid (0% of RC component) and RC with high cellular component (≥80%).",
            "Overall design": "The validation series (INT-B) consisted of cryopreserved samples obtained from 12 patients. Six cases were pure myxoid and six were pure RC. The diagnoses were confirmed by means of FISH analysis, which revealed CHOP rearrangement, or by RT-PCR searching for the transcript type. Different molecular variants of the fusion transcript have been described by Powers MP et al. (Mod Pathol. 2010).",
            "Platforms": "Platforms (1), GPL10558, Illumina HumanHT-12 V4.0 expression beadchip",
            "Samples": {
                "GSM1337386": {
                    "link": "/geo/query/acc.cgi?acc=GSM1337386",
                    "name": "AU05",
                    "Status": "Public on Oct 30, 2014",
                    "Title": "AU05",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: myxoid liposarcomaage: 42gender: Mprimary site: growinsubtype: ML% rc component: 0chop rearrangement  by fish / fusion type by rt-pcr: FUS-CHOP type IIsequencing tp53: wtsequencing pik3ca: wtsequencing pten: wt",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "RNA was extracted with Trizol reagent, followed by clean-up and DNase I treatment with QIAGEN RNeasy mini kit in accordance with the prescribed protocol provided with the kit. Quality control was performed with Agilent Bioanalyser.",
                    "Data processing": "The data were processed and normalised using quantile normalization with BeadStudio software",
                    "Platform ID": "GPL10558"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE55465_RAW.tar",
                    "file_size": "26.2 Mb",
                    "file_type": "TAR",
                    "download_link": "/geo/download/?acc=GSE55465&format=file"
                },
                {
                    "file_name": "GSE55465_non-normalized_INT-B.txt.gz",
                    "file_size": "3.5 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE55465&format=file&file=GSE55465%5Fnon%2Dnormalized%5FINT%2DB%2Etxt%2Egz"
                }
            ]
        },
        "GSE55464": {
            "Status": "Public on Oct 30, 2014",
            "Title": "Gene expression profiling of myxoid liposarcomas (training set INT-A)",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "FUS-CHOP and EWS-CHOP balanced translocations characterize myxoid liposarcoma which encompasses myxoid (ML) and round cell (RC) variants initially believed to be distinct diseases. Currently, myxoid and RC liposarcoma are regarded to represent the well differentiated and the poorly differentiated ends, respectively, within spectrum of myxoid liposarcoma where the fusion proteins blocking lipogenic differentiation play a role in tumor initiation while molecular determinants associated to progression to RC remain poorly understood. Activation of AKT pathway sustained by PIK3CA and PTEN  mutations and growth factor receptor signalling such as RET and IGF1R have been recently correlated with the increasing of aggressiveness and RC.  Aim of the present study is to elucidate molecular events involved in driving round cell progression analyzing two small series of MLS selected to be representative of the two end of the gamut: the pure myxoid (0% of RC component) and RC with high cellular component (≥80%).",
            "Overall design": "The training series (INT-A) was made up of formalin-fixed paraffin embedded samples obtained from 12 patients. The diagnoses were confirmed by means of FISH analysis, which revealed CHOP rearrangement, or by RT-PCR searching for the transcript type. Different molecular variants of the fusion transcript have been described by Powers MP et al. (Mod Pathol. 2010).",
            "Platforms": "Platforms (1), GPL14951, Illumina HumanHT-12 WG-DASL V4.0 R2 expression beadchip",
            "Samples": {
                "GSM1337374": {
                    "link": "/geo/query/acc.cgi?acc=GSM1337374",
                    "name": "AU19",
                    "Status": "Public on Oct 30, 2014",
                    "Title": "AU19",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: myxoid liposarcomaage: 61gender: Mprimary site: thighsubtype: RC% rc component: 15chop rearrangement  by fish / fusion type by rt-pcr: CHOP rearrangementsequencing tp53: wtsequencing pik3ca: wtsequencing pten: C136Y",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "RNA was extracted with QIAGEN FFPE RNeasy mini kit in accordance with the prescribed protocol provided with the kit. Quality control was performed with Agilent Bioanalyser.",
                    "Description": "7943280035_A.AVG",
                    "Data processing": "The data were processed and normalised using quantile normalization with BeadStudio software",
                    "Platform ID": "GPL14951"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE55464_non-normalized_INT-A.txt.gz",
                    "file_size": "2.0 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE55464&format=file&file=GSE55464%5Fnon%2Dnormalized%5FINT%2DA%2Etxt%2Egz"
                }
            ]
        },
        "GSE59520": {
            "Status": "Public on Oct 02, 2014",
            "Title": "Identification of known and novel germ cell cancer specific (embryonic) miRs in serum by high throughput profiling",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by RT-PCR",
            "Summary": "Very recently, a number of independent studies showed that serum levels of embryonic micro-RNA (miR) clusters 371-3 and 302abc/367 are predictive for the presence of testicular type II germ cell tumors. These miRs could be used to sensitively detect SE and EC components which are indeed known to express these miRs [1-7]. This study investigates ca 750 miRs in a high throughput approach to validate these previously identified markers and identify novel potential miR markers for testicular type II germ cell tumors.  1. Belge, G., et al., Serum levels of microRNAs miR-371-3: a novel class of serum biomarkers for testicular germ cell tumors? Eur Urol, 2012. 61(5): p. 1068-9.  2. Dieckmann, K.P., et al., MicroRNAs miR-371-3 in serum as diagnostic tools in the management of testicular germ cell tumours. Br J Cancer, 2012. 107(10): p. 1754-60.  3. Gillis, A.J., et al., Targeted serum miRNA (TSmiR) test for diagnosis and follow-up of (testicular) germ cell cancer patients: a proof of principle. Mol Oncol, 2013. 7(6): p. 1083-92.  4. Gillis, A.J., et al., High-throughput microRNAome analysis in human germ cell tumours. J Pathol, 2007. 213(3): p. 319-28.  5. Murray, M.J. and N. Coleman, Testicular cancer: a new generation of biomarkers for malignant germ cell tumours. Nat Rev Urol, 2012. 9(6): p. 298-300.  6. Murray, M.J., et al., Identification of microRNAs From the miR-371~373 and miR-302 clusters as potential serum biomarkers of malignant germ cell tumors. Am J Clin Pathol, 2011. 135(1): p. 119-25.  7. Voorhoeve, P.M., et al., A genetic screen implicates miRNA-372 and miRNA-373 as oncogenes in testicular germ cell tumors. Cell, 2006. 124(6): p. 1169-81.",
            "Overall design": "35 serum samples were profiled for ca. 750 micro RNAs. These consisted of serum from 10 patients with non-seminomas (2 YS, 2 TE, 2 EC and 4 mixed NS which all contained EC) and 14 SE cases. Controls (C) consisted of serum from 3 individuals with normal testis tissue showing adequate spermatogenesis (Johnson Score 8-10) and serum from 8 patients with non-GCT testicular masses. These contained on epidermoid cyst, three epidermis cysts, one low grade liposarcoma, two neuro-endocrine tumors and a case of paratesticular hemorrhage.",
            "Platforms": "Platforms (1), GPL18971, Applied Biosystems Human Taqman MicroRNA Array v3.0",
            "Samples": {
                "GSM1438703": {
                    "link": "/geo/query/acc.cgi?acc=GSM1438703",
                    "name": "CONTROL-1",
                    "Status": "Public on Oct 02, 2014",
                    "Title": "CONTROL-1",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "sample type: serum from patient with epidermoid cyst",
                    "Treatment protocol": "n/a",
                    "Growth protocol": "Samples were extracted at the Department of Pathology, Erasmus MC, Rotterdam, the Netherlands. Use of tissue samples for scientific reasons was approved by an institutional review board (MEC 02.981 and CCR2041). Samples were used according to the “Code for Proper Secondary Use of Human Tissue in The Netherlands” developed by the Dutch Federation of Medical Scientific Societies (FMWV (Version 2002, update 2011).",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "miRNAs were purified from serum sample using TaqMan® ABC Purification Kit -  Human Panel A and B (Life Technologies,  PN 4473087 and 4473088). All reagents are provided in the kit. These panels consist of superparmagnetic Dynabeads® covalently bound to a unique set of ~380 anti-miRNA oligonucleotides for each panel. The miRNAs in each panel match the miRNAs in Megaplex Pools A and B described below. Each panel includes exogenous and endogenous controls. Briefly, for each panel 100ul of lysis buffer was added to 50 µl of serum. 2 µl of 1nM an external control (ath-miR-159a) was added to monitor the extraction process, followed by the addition of 80 µl of beads (  80 X 10^6 beads). The tubes were shaken at 1200 rpm at 30˚C for 40 minutes then washed three times with wash buffer using a magnetic bead separator. The bound miRNAs were eluted from the beads with 100 µl elution buffer and incubation at 70˚C for 3 minutes. The eluted miRNA was stored at -80˚C until ready to use.",
                    "Data processing": "Raw data files (.eds) were imported and analyzed in using ExpressionSuite v1.0.4 (Life Technologies), a software data analysis tool that can easily import and analyze large raw data files. In these experiments the Cq is defined as the fractional cycle at which the amplification plot crosses the fluorescence threshold (Ct). The baseline was set automatically and the threshold was manually set at 0.2. For gene expression analysis a Ct cutoff that provides reliable results for low expressing targets is identified. The cutoff will depend on the platform, number of replicates (technical and biological) and number of preamplification cycles if preamplification was included. For TaqMan Array cards without preamplification, a Ct <30 is generally considered positive and indicates expression;  Ct between 30 – 32 are considered low but detectable. Ct between 32-40 represent very low expression. A  larger number of replicates or low standard deviation of Ct increases the confidence and power of results in this range. To capture as many differentially expressed miRNAs as possible the threshold was set at 40 and statistical analysis was applied to identify the most relevant and consistent (i.e. significant) results.   Undetermined values were replaced with the maximal number of cycles (40). Non-human RNAs were removed from the dataset before normalization. Each assay was treated as an independent target. Ct values were normalized using global normalization according to [1]. RNU44, RNU48 and U6.snRNA were removed from the dataset before further analysis because these have been shown to be absent in serum [2]. Batch effects were corrected using Combat as implemented in the sva Bioconductor package (v3.10.0).  1. Mestdagh, P., et al., A novel and universal method for microRNA RT-qPCR data normalization. Genome Biol, 2009. 10(6): p. R64.  2. Gillis, A.J., et al., Targeted serum miRNA (TSmiR) test for diagnosis and follow-up of (testicular) germ cell cancer patients: a proof of principle. Mol Oncol, 2013. 7(6): p. 1083-92.",
                    "Platform ID": "GPL18971"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE59520_non-normalized.txt.gz",
                    "file_size": "64.1 Kb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE59520&format=file&file=GSE59520%5Fnon%2Dnormalized%2Etxt%2Egz"
                }
            ]
        },
        "GSE276299": {
            "Status": "Public on Oct 10, 2024",
            "Title": "Comparison of DNA Methylation Based Classification Models for Precision Diagnostics of Central Nervous System Tumors",
            "Organism": "Homo sapiens",
            "Experiment type": "Methylation profiling by genome tiling array",
            "Summary": "As part of the advancement in therapeutic decision-making for brain tumor patients at St. Jude Children’s Research Hospital (SJCRH), we developed three robust classifiers, a deep learning neural network (NN), k-nearest neighbor (kNN), and random forest (RF), trained on a reference series DNA-methylation profiles to classify central nervous system (CNS) tumor types. The models’ performance was rigorously validated against 2,054 samples from two independent cohorts. In addition to classic metrics of model performance, we compared the robustness of the three models to reduced tumor purity, a critical consideration in the clinical utility of such classifiers. Our findings revealed that the NN model exhibited the highest accuracy and maintained a balance between precision and recall. The NN model was the most resistant to drops in performance associated with a reduction in tumor purity, showing good performance until the purity fell below 50%. Through rigorous validation, our study emphasizes the potential of DNA-methylation-based deep learning methods to improve precision medicine for brain tumor classification in the clinical setting.",
            "Overall design": "We validated the performance of these two models and the RFmod with two independent brain tumor cohorts consisting of 1104 samples from GSE109379 and 950 samples from the St. Jude Children’s Research Hospital. Our results showed that although all models performed robustly to missing data, the deep NN model had the highest CNS classification accuracy and the most favorable performance characteristics, especially in minimizing the proportion of subthreshold scores during testing and validation. Average precision and recall of the NNmod started reducing to similar levels of kNNmod and RFmod when tumor purity was less than 50%. This suggests that a deep NN model can be implemented in clinical laboratories as a reliable and essential diagnostic tool to assist in precision therapy for brain tumors.",
            "Platforms": "Platforms (1), GPL21145, Infinium MethylationEPIC",
            "Samples": {
                "GSM8495190": {
                    "link": "/geo/query/acc.cgi?acc=GSM8495190",
                    "name": "Supratentorial ependymoma, ZFTA-fusion positive [200467580018_R03C01]",
                    "Supplementary file": [
                        {
                            "file_name": "GSM8495190_200467580018_R03C01_Grn.idat.gz",
                            "file_size": "7.1 Mb",
                            "file_type": "IDAT",
                            "download_link": "/geo/download/?acc=GSM8495190&format=file&file=GSM8495190%5F200467580018%5FR03C01%5FGrn%2Eidat%2Egz"
                        },
                        {
                            "file_name": "GSM8495190_200467580018_R03C01_Red.idat.gz",
                            "file_size": "7.2 Mb",
                            "file_type": "IDAT",
                            "download_link": "/geo/download/?acc=GSM8495190&format=file&file=GSM8495190%5F200467580018%5FR03C01%5FRed%2Eidat%2Egz"
                        }
                    ],
                    "Status": "Public on Oct 10, 2024",
                    "Title": "Supratentorial ependymoma, ZFTA-fusion positive [200467580018_R03C01]",
                    "Sample type": "genomic",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: FFPESex: Male",
                    "Treatment protocol": "Standard Illumina protocol",
                    "Growth protocol": "FFPE or frozen tumor samples representing pediatric patient samples encountered on the typical pathology service were evaluated.  The samples represented 650 samples expected to be present in the reference series and 300, true negative samples representative of non-brain solid tumors known to be absent from the reference series",
                    "Extracted molecule": "genomic DNA",
                    "Extraction protocol": "We analyzed the 950 independent test samples using Illumina Methylation BeadChip (EPIC) arrays according to the manufacturer's instructions. In summary, DNA was isolated from formalin-fixed paraffin-embedded (FFPE) tumor tissue using the Maxwell® Clinical Sample Concentrator system (Promega, Madison, WI).",
                    "Description": "200467580018_R03C01",
                    "Data processing": "All methylation data were analyzed in R (http://www.r-project.org, version 3.5.3), using a number of packages from Bioconductor and other repositories. Specifically, array data were preprocessed using the minfi package (v.1.28.4) (13). Background correction with dye-bias normalization was performed for all samples using noob (normal-exponential out-of-band) with “single” dye method (14). Filtering was performed to remove probes located on sex chromosomes, probes containing nucleotide polymorphisms (dbSNP132 Common) within five base pairs of and including the targeted CpG-site, or probes mapping to multiple sites on hg19 (allowing for one mismatch), and cross-reactive probes.Average beta values that were normalized by functional normalization from minfi R package",
                    "Platform ID": "GPL21145"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE276299_RAW.tar",
                    "file_size": "13.2 Gb",
                    "file_type": "TAR (of IDAT)",
                    "download_link": "/geo/download/?acc=GSE276299&format=file"
                }
            ]
        },
        "GSE261945": {
            "Status": "Public on Jun 17, 2024",
            "Title": "Spindle cell lesions with oncogenic EGFR kinase domain aberrations: expanding the spectrum of protein kinase-related mesenchymal tumors",
            "Organism": "Homo sapiens",
            "Experiment type": "Methylation profiling by array",
            "Summary": "EGFR aberrations are reported in a subset of myofibroblastic lesions with kinase domain duplication (EGFR-KDD) and exon 20 mutations being assigned to infantile fibrosarcomas (IFS), mesoblastic nephroma and fibrous hamartoma of infancy (FHI), respectively. In this retrospective study, we correlated molecular findings with histomorphology of 14 myofibroblastic lesions harboring such genetic changes identified by NGS. We additionally performed DNA methylation profiling (DNAmp) and immunohistochemistry. Lesions were from 10 males and 4 females with a mean age of 3 years (range, 0.3 -14) and occurred subcutaneously in the upper limbs (n = 5), lower limbs (n = 3), back/thorax (n = 5), and the nasal cavity (n = 1). Eleven were cured by surgery, including one relapsed case. Two patients were lost to follow-up. One case was very recent, and the patient was biopsied. Histologically, the lesions showed a wide spectrum varying from classic FHI (n=9) to IFS (n=1) or lipofibromatosis-like tumors (LFT) (n=2) or dermatofibrosarcoma protuberans-like (DFSP) (n=1) to a predominantly-myxoid spindle cell lesion (n=1). Immunohistochemically, all neoplasms stained with CD34, while S100 was positive in 2/14. EGFR expression was observed in 9/10 cases. Molecularly, the IFS and one LFT harbored EGFR-KDD, while an exon 20 mutation was identified in all FHI, one LFT and in the DFSP and predominantly myxoid spindle cell lesion. By DNAmp, all but two cases formed a well-defined cluster, demonstrating that these lesions are also epigenetically related. In conclusion, EGFR kinase domain aberrations found in FHI, IFS, LFN, DFSP and a spindle cell lesion with a predominant myxoid stroma of children and adolescents show that these neoplasms with a broad morphological spectrum belong to the group of protein kinase-related lesions with a distinct epigenetic signature. Molecular analyses, including DNAmp, help to identify and characterize this emerging category and become mandatory when targeted treatment is considered.",
            "Overall design": "Generated methylation data were compared to sarcoma classifier v12.2-v12.3 (Koelsche et al, 2021), that also allowed for determining copy number alterations. We also carried out t-distributed stochastic neighbor embedding (t-SNE) analysis, with R package Rtsne version 0.16, using the first 94 principal components computed on the top 32000 DNA methylation values with highest standard deviation as described by Capper et al.",
            "Platforms": "Platforms (1), GPL21145, Infinium MethylationEPIC",
            "Samples": {
                "GSM8154968": {
                    "link": "/geo/query/acc.cgi?acc=GSM8154968",
                    "name": "DNA methylation data of EGFR-altered tumor case 1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM8154968_207131890082_R02C01_Grn.idat.gz",
                            "file_size": "7.0 Mb",
                            "file_type": "IDAT",
                            "download_link": "/geo/download/?acc=GSM8154968&format=file&file=GSM8154968%5F207131890082%5FR02C01%5FGrn%2Eidat%2Egz"
                        },
                        {
                            "file_name": "GSM8154968_207131890082_R02C01_Red.idat.gz",
                            "file_size": "6.9 Mb",
                            "file_type": "IDAT",
                            "download_link": "/geo/download/?acc=GSM8154968&format=file&file=GSM8154968%5F207131890082%5FR02C01%5FRed%2Eidat%2Egz"
                        }
                    ],
                    "Status": "Public on Jun 17, 2024",
                    "Title": "DNA methylation data of EGFR-altered tumor case 1",
                    "Sample type": "genomic",
                    "Organism": "Homo sapiens",
                    "Characteristics": "methylation class: Well- / dedifferentiated liposarcoma (score 0.6)",
                    "Extracted molecule": "genomic DNA",
                    "Extraction protocol": "Genomic DNA was extracted from FFPE samples using MagPurix FFPE DNA Extraction Kit according to manufacturer's instructions.",
                    "Data processing": "RStudio (R package ChAMP v2.26.0)",
                    "Platform ID": "GPL21145"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE261945_RAW.tar",
                    "file_size": "356.2 Mb",
                    "file_type": "TAR (of IDAT)",
                    "download_link": "/geo/download/?acc=GSE261945&format=file"
                }
            ]
        },
        "GSE243865": {
            "Status": "Public on Apr 26, 2024",
            "Title": "Copanlisib Microarray Data",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "Chemotherapy is the mainstay treatment stragety for triple negative breast cancer (TNBC). However resistance to chemotherapy is common, leading to disease progression and death. Strategies that improve chemotherapy efficacy has the potential to reduce TNBC mortality. In this research, we demonstrated that the pan-PI3K inhibitor copanlisib, which is already in clinic to treat hematologic malignancies, enhanced the cytotoxicity of eribulin, a common chemotherapy used to treat taxane-resistant TNBC, in a panel of TNBC patient-derived xenograft (PDX) models. The improved tumor growth inhibition was irrespective of PI3K pathway alteration and was corroborated by the enhanced apoptotic induction observed in PDX tumors post combination therapy compared to each drug alone. The combination therapy inhibited eribulin-induced PI3K pathway activation, providing an underlying mechanism of action for its enhanced anti-tumor effect. Based on these results, a Phase I/II trial of this combination in patients with metastatic TNBC was initiated and is ongoing.",
            "Overall design": "27 mRNA microarray experiments were analyzed for 8 different HIM lines.  5 of these lines had data from a patient biospy as well as multiple passages from a mouse xenograft.  3 tumors had data from mouse xenograft passages but no data from the patient biopsy.  Each representative patient tumor sample and mouse xenograft passage was amplified, labeled, and co-hybridized with a reference sample.",
            "Platforms": "Platforms (1), GPL6480, Agilent-014850 Whole Human Genome Microarray 4x44K G4112F (Probe Name version)",
            "Samples": {
                "GSM7797087": {
                    "link": "/geo/query/acc.cgi?acc=GSM7797087",
                    "name": "WHIM10_mouse passage A [re-analysis]",
                    "Supplementary file": [
                        {
                            "file_name": "GSM7797087_HIM_10A_251485038536_S01_GE2-v5_95_Feb07_1_1.txt.gz",
                            "file_size": "14.2 Mb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM7797087&format=file&file=GSM7797087%5FHIM%5F10A%5F251485038536%5FS01%5FGE2%2Dv5%5F95%5FFeb07%5F1%5F1%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Apr 26, 2024",
                    "Title": "WHIM10_mouse passage A [re-analysis]",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue type: xenografttissue: oct block from human:mouse xenograft which contained at least 50% tumor cellularitymolecule type: Total RNA from which cy5 labeled cRNA was generated",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "Trizol extractions followed by Dnase treatment and column purification.",
                    "Description": "re-analysis of GSM4486560HIM_10A",
                    "Data processing": "txt files from Agilent Feature Extraction software were loaded into the UNC-CH Microarray Database. Final loess, normalized log2 ratios (Cy5-sample/Cy3-control) for each probe were retrieved.",
                    "Platform ID": "GPL6480"
                }
            },
            "Supplementary file": []
        },
        "GSE243759": {
            "Status": "Public on Sep 25, 2023",
            "Title": "Antitumor effects of PRMT5 inhibition in sarcomas",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "Patients with advanced soft-tissue sarcomas (STSs) have few therapeutic options. Protein arginine methyltransferase 5 (PRMT5), an anticancer target, has been extensively investigated in recent years in epithelial tumors. To date, no data related to the biological role of PRMT5 inhibition and its potential effect as a treatment in STS have been reported.  To investigate the therapeutic potential of PRMT5 targeting in STS, we first evaluated the prognostic value of PRMT5 expression in 2 different cohorts of patients with STS. We then used the potent and selective GSK3326595 (GSK595) compound to investigate the antitumor effect of the pharmacological inhibition of PRMT5 in vitro via MTT, apoptosis, cell cycle, clonogenicity and proliferation assays. In vivo studies were performed with two animal models to evaluate the effects of GSK595 on tumor growth. The mechanisms of action were investigated by RNA sequencing, metabolic pathway analysis, Western blotting and glucose uptake/lactate production assays.  High PRMT5 gene expression levels were significantly associated with worsened metastasis-free survival of STS patients. GSK595 decreased the global symmetric dimethylarginine level, the proliferation rate and clonogenicity of STS cell lines in vitro and tumor growth in vivo. Moreover, PRMT5 inhibition regulated aerobic glycolysis through downregulation of key enzymes of glycolysis as well as glucose uptake and lactate production.  The present study demonstrated that PRMT5 regulates STS cell metabolism and thus represents a potential therapeutic target for STS. Additional studies in diverse sarcoma subtypes will be essential to confirm and expand upon these findings.",
            "Overall design": "To decipher the mechanism of action of PRMT5 inhibition in STS cell lines, four sarcoma cell lines (the IB111, IB114, IB115, and IB128 cells) were untreated or treated with GSK595 at IC80 every 3 days for 10 days and RNA were analyzed by Nanostring assay using an nCounter Metabolic Pathways Panel in the nCounter Max Analyzer.",
            "Platforms": "Platforms (1), GPL31904, NanoString  nCounter Human  Metabolic Pathways Panel [Gene Symbol version]",
            "Samples": {
                "GSM7795419": {
                    "link": "/geo/query/acc.cgi?acc=GSM7795419",
                    "name": "IB111 cell line, Control, rep1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM7795419_20211109_31020962105_run2_IB111_n1_ctl_07.RCC.gz",
                            "file_size": "8.7 Kb",
                            "file_type": "RCC",
                            "download_link": "/geo/download/?acc=GSM7795419&format=file&file=GSM7795419%5F20211109%5F31020962105%5Frun2%5FIB111%5Fn1%5Fctl%5F07%2ERCC%2Egz"
                        }
                    ],
                    "Status": "Public on Sep 25, 2023",
                    "Title": "IB111 cell line, Control, rep1",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell type: dedifferentiated liposarcoma",
                    "Treatment protocol": "Cells were untreated or treated with GSK595 at their respective IC80 every 3 days for 10 days",
                    "Growth protocol": "Cells were maintained in RPMI medium 1640 GlutaMAX Supplement in the presence of 10% fetal bovine serum and 1% penicillin/streptomycin at 37°C in a humidified atmosphere containing 5% CO2",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "RNA was extracted using an RNeasy Plus Mini Kit (Qiagen). The purity and concentration of the isolated RNA were determined with a NanoDrop spectrophotometer, and capillary electrophoresis using a Bioanalyzer 2100 was carried out to determine the RNA integrity number (RIN).",
                    "Data processing": "Raw gene expression was normalized using the RUVseq pipeline, and differential gene expression was analyzed using Deseq2 (v1.28). Pathway scoring was performed on normalized data using the single-sample GSEA method (ConsensusTME 0.0.1.9), and differences between vehicle and treated samples were evaluated for significance using Wilcoxon tests",
                    "Platform ID": "GPL31904"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE243759_RAW.tar",
                    "file_size": "230.0 Kb",
                    "file_type": "TAR (of RCC)",
                    "download_link": "/geo/download/?acc=GSE243759&format=file"
                }
            ]
        },
        "GSE241031": {
            "Status": "Public on Aug 21, 2023",
            "Title": "Therapy-induced senescence contributes to the efficacy of abemaciclib in patients with dedifferentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Current research on CDK4/6 inhibitors (CDK4/6i) in the pre-clinical and clinical spaces are largely concerned with gaining a deeper understanding of how these drugs delay tumor growth, and how to prevent cancer cell resistance.  By coordinating a first-in-kind phase II clinical trial of the CDK4/6i abemaciclib for patients with progressive dedifferentiated liposarcoma (DDLS) with cellular studies to identify the molecular basis of geroconversion, we have defined how therapy induced senescence contributes to disease management.  Thirty patients with progressing DDLS enrolled in the clinical trial and were treated with 200mg abemaciclib twice daily.  The median progression free survival was 33 weeks at the time of the data lock, with 23 of 30 progression-free at 12 weeks (76.7%, two-sided 95% CI 57.7% - 90.1%).  ANGPTL4 is a necessary late regulator of geroconversion, the pathway from reversible cell cycle exit to a stably arrested inflammation-provoking senescent cell, in liposarcoma cell lines treated with CDK4/6i.  Using ANGPTL4 and CDKN2A expression, we were able to identify patients in which abemaciclib induced tumor cell senescence. We were then able to correlate this with outcomes. Senesence correlated with increased leukocyte infiltration, primarily CD4-positive cells, within a month of therapy, and possibly with an improved initial response to abemaciclib.  However, those individuals with both senescence and increased TILs were also more likely to acquire resistance after six months of therapy.  This suggests that combining senolytics with abemaciclib in a subset of patients may improve the durability of patient responses to this class of compounds.",
            "Overall design": "Two to three independent biological replicates of genetically engineered LS8817 cells were made to arrest in quiescence following doxyxyline and palbociclib treatment and  released from this arrest to progress synchronously into senesecence.  Samples were obtained over the next 28 days, RNA prepared, and correlated to the appearance of different phenotypes associated with senescence.",
            "Platforms": "Platforms (1), GPL16791, Illumina HiSeq 2500 (Homo sapiens)",
            "Samples": {
                "GSM7714143": {
                    "link": "/geo/query/acc.cgi?acc=GSM7714143",
                    "name": "CONTROL-R3 (biological replicate 1)",
                    "Supplementary file": [
                        {
                            "file_name": "GSM7714143_Control-R3.counts.txt.gz",
                            "file_size": "3.0 Mb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM7714143&format=file&file=GSM7714143%5FControl%2DR3%2Ecounts%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Aug 21, 2023",
                    "Title": "CONTROL-R3 (biological replicate 1)",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: LS8817cell type: dedifferentiated liposarcomagenotype: Tet-ON-FMDM2",
                    "Treatment protocol": "cells are pretrated with doxycycline to induce MDM2 and then treated with doxycycline and palbociclib to induce growth arrest.  After all cells have arrested, doxycycline is removed and geroconversion to senescecence is followed over time",
                    "Growth protocol": "LS8817 Tet-On-FMDM2 cells are cultured in DME containing 10% fetal bovine serum and 2mM glutamine in 5% CO2 at 37 degree celsius",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was isolated using Rneasy as described by the manufacturer (QIAGEN).  RNA quality was checked on a BioAnalyzer to ensue a minimume RNA integrity value of 7.  All experiments were performed with three biologic replicatesLibraries were generated using 500 ng of input RNA per sample according to the manufacturer’s instructions for TruSeq mRNA Library Prep Kit V2 (Illumina) with 8 cycles of PCR.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina HiSeq 2500",
                    "Description": "untreated cells",
                    "Data processing": "Libraries were pooled and run on an Illumina HiSeq 2500, high output, to 40 million single, 125 nucleotide-long readsreads aligned to human ref seq hg19 with  RNASeq aligner STAR (version_2.4.0c)raw counts were imputed into R studio version 3.2.0 (cran.r-project.org) and differential gene expression determined with Bioconductor package DEseq2 comparing expression in growth arrested quiescent cells to each time pointGenes annotated in Gencode version 18 were quantified with featureCounts (subhead package version 1.4.3-p1).Assembly: human reference sequence hg19 with the RNASeq aligner STAR (version_2.4.0c).   between the groups of samples. Enrichment of differential expression in sets of genes was determined using Gene Set Enrichment Analysis (GSEA) on gene groupings from MSigDB, as well as custom sets (Subramanian et al, 2005).",
                    "Platform ID": "GPL16791"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE241031_RAW.tar",
                    "file_size": "81.5 Mb",
                    "file_type": "TAR (of TXT)",
                    "download_link": "/geo/download/?acc=GSE241031&format=file"
                }
            ]
        },
        "GSE221493": {
            "Status": "Public on Jul 22, 2024",
            "Title": "Cellular origin and clonal evolution of human dedifferentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Dedifferentiated liposarcoma (DDLPS) is the most frequent high-grade soft tissue sarcoma subtype. It is characterized by a component of undifferentiated tumor cells coexisting with a component of well-differentiated adipocytic tumor cells. Both dedifferentiated (DD) and well-differentiated (WD) components exhibit MDM2 amplification, however their cellular origin remains elusive. Using single-cell RNA sequencing and functional assays in paired WD and DD components from primary DDLPS tumors, we characterized the cellular heterogeneity of DDLPS tumor and micro-environment. We identified a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue. We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution. Last, we show that DD tumor cells keep important biological properties of ASC including pluripotency and that their adipogenic properties are inhibited by a TGF-β high immunosuppressive tumor micro-environment.",
            "Overall design": "Primary DDLPS, WDLPS, liposarcoma and peritumoral fat tissue of untreated patients were isolated and analyzed using scRNAseq.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6876510": {
                    "link": "/geo/query/acc.cgi?acc=GSM6876510",
                    "name": "Tumor patient 1 (DDLPS_WD), scRNAseq",
                    "Status": "Public on Jul 22, 2024",
                    "Title": "Tumor patient 1 (DDLPS_WD), scRNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: DDLPS_WDage at_diagnosis: 42Sex: Flocation: retroperitoneumtumour size_(mm): 380tumour grade: 2",
                    "Treatment protocol": "NANA",
                    "Growth protocol": "NA",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Fresh tumor samples were cut in small pieces then dissociated 30 min at 37C in CO2-independent medium (Gibco) containing 150 mg/ml of Liberase TL (Roche) and DNase 1 (Sigma Aldrich). Dissociated cells were then filtered with a cell strainer and washed in PBS. Debris were removed by centrifugation (3,000 xg for 10 min at 4C), using the debris removal solution (Miltenyi Biotech). Cells were then resuspended in PBS, counted and adjusted at 10⁶ cells/ml. 6,000 cells were loaded on a 10X Chromium (10X Genomics) and libraries were prepared using a Single Cell 30 Reagent Kit (NextGem kit, 10X Genomics), according to the manufacturer’s protocol, targeting 3,000 recovered cells per cell type and sample. Libraries were sequenced on an Illumina NovaSeq 6000 sequencing platform.Library was performed according to the manufacter’s instructions (single cell 3’ v2 protocol, 10x Genomics). Briefly, GCs were resuspended in the master mix and loaded together with partitioning oil and gel beads into the chip to generate the gel bead-in-emulsion (GEM). The poly-A RNA from the cell lysate contained in every single GEM was retrotranscripted to cDNA, which contains an Ilumina R1 primer sequence, Unique Molecular Identifier (UMI) and the 10x Barcode. The pooled barcoded cDNA was then cleaned up with Silane DynaBeads, amplified by PCR and the apropiated sized fragments were selected with SPRIselect reagent for subsequent library construction. During the library construction Ilumina R2 primer sequence, paired-end constructs with P5 and P7 sequences and a sample index were added.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic single cell",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "10x Genomics",
                    "Data processing": "Alignment with cellranger (v3.0.0 to v6.0.0 according to sample), default optionsAmbient RNA correction with SoupX v1.5.2Doublet removal with DoubletFinder (v2.0.3), scDblFinder (v1.4.0) and scds (v1.6.0) in hybrid mode, default options, union of the three methodsRemove cells with more than 20% of reads mapping mitochondrial genesApply additional coverage based filters to remove low quality cellsNormalization and downstream analysis with Seurat v4.0.1Assembly: GRCh38Supplementary files format and content: Tab-delimited text and MatrixMarket files containing raw counts generated by CellRanger and corresponding normalized counts generated by Seurat v3",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_barcodes.tsv.gz",
                    "file_size": "2.6 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Fbarcodes%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_barcodes_only.tsv.gz",
                    "file_size": "513.4 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Fbarcodes%5Fonly%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_features.tsv.gz",
                    "file_size": "274.9 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Ffeatures%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_matrix.mtx.gz",
                    "file_size": "527.2 Mb",
                    "file_type": "MTX",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Fmatrix%2Emtx%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_raw_counts_barcodes.tsv.gz",
                    "file_size": "513.4 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fraw%5Fcounts%5Fbarcodes%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_raw_counts_features.tsv.gz",
                    "file_size": "231.4 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fraw%5Fcounts%5Ffeatures%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_raw_counts_matrix.mtx.gz",
                    "file_size": "551.3 Mb",
                    "file_type": "MTX",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fraw%5Fcounts%5Fmatrix%2Emtx%2Egz"
                }
            ]
        },
        "GSE221492": {
            "Status": "Public on Jul 22, 2024",
            "Title": "Cellular origin and clonal evolution of human dedifferentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Dedifferentiated liposarcoma (DDLPS) is the most frequent high-grade soft tissue sarcoma subtype. It is characterized by a component of undifferentiated tumor cells coexisting with a component of well-differentiated adipocytic tumor cells. Both dedifferentiated (DD) and well-differentiated (WD) components exhibit MDM2 amplification, however their cellular origin remains elusive. Using single-cell RNA sequencing and functional assays in paired WD and DD components from primary DDLPS tumors, we characterized the cellular heterogeneity of DDLPS tumor and micro-environment. We identified a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue. We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution. Last, we show that DD tumor cells keep important biological properties of ASC including pluripotency and that their adipogenic properties are inhibited by a TGF-β high immunosuppressive tumor micro-environment.",
            "Overall design": "Primary DDLPS, WDLPS, liposarcoma and peritumoral fat tissue of untreated patients were isolated and analyzed using RNAseq.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6876457": {
                    "link": "/geo/query/acc.cgi?acc=GSM6876457",
                    "name": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Status": "Public on Jul 22, 2024",
                    "Title": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: DDLPS_DDage at_diagnosis: 42Sex: Flocation: retroperitoneumtumour size_(mm): 380tumour grade: 2",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Total RNAs were extracted using the Trizol reagent and dosed. 1 ug of total RNA was used for the construction of sequencing libraries.RNA libraries for RNA-seq were prepared using SMARTER mRNA-Seq Library Prep Kit following manufacturer's protocols.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "FastQC (v0.11.8 or v0.11.9 according to sample) and trimming with TrimGalore (v0.6.2) or Altropos according to sample, default optionsSTAR (v2.6.1a_08-27), Picard MarkDuplicates (v2.18.14) and Cufflinks (v2.2.1), default optionsTPM-normalization of raw read counts generated by STAR (1)log2-transformation of FPKM from Cufflinks with pseudo-count +2 and normalization between samples with limma in quantil mode (2)Assembly: GRCh38Supplementary files format and content: Tab-delimited text files containing raw counts generated by STAR and corresponding TPM-normalized or FPKM-normalized counts",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE221492_bulk_LPS_atlas_TPM_counts_matrix.tsv.gz",
                    "file_size": "11.8 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221492&format=file&file=GSE221492%5Fbulk%5FLPS%5Fatlas%5FTPM%5Fcounts%5Fmatrix%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221492_bulk_LPS_atlas_log2_FPKM_counts_matrix.tsv.gz",
                    "file_size": "2.6 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221492&format=file&file=GSE221492%5Fbulk%5FLPS%5Fatlas%5Flog2%5FFPKM%5Fcounts%5Fmatrix%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221492_bulk_LPS_atlas_raw_counts_matrix.tsv.gz",
                    "file_size": "2.4 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221492&format=file&file=GSE221492%5Fbulk%5FLPS%5Fatlas%5Fraw%5Fcounts%5Fmatrix%2Etsv%2Egz"
                }
            ]
        },
        "GSE220882": {
            "Status": "Public on Aug 02, 2023",
            "Title": "Genome-wide mapping of i-Motifs reveals their association with transcription regulation in live human cells",
            "Organism": "Homo sapiens",
            "Experiment type": "Genome binding/occupancy profiling by high throughput sequencingExpression profiling by high throughput sequencing",
            "Summary": "This SuperSeries is composed of the SubSeries listed below.",
            "Overall design": "Refer to individual Series",
            "Platforms": "Platforms (1), GPL18573, Illumina NextSeq 500 (Homo sapiens)",
            "Samples": {
                "GSM6825451": {
                    "link": "/geo/query/acc.cgi?acc=GSM6825451",
                    "name": "HEK293T-H3K4me3-C&T",
                    "Supplementary file": [
                        {
                            "file_name": "GSM6825451_HEK293T_H3K4me3.bigwig",
                            "file_size": "58.6 Mb",
                            "file_type": "BIGWIG",
                            "download_link": "/geo/download/?acc=GSM6825451&format=file&file=GSM6825451%5FHEK293T%5FH3K4me3%2Ebigwig"
                        }
                    ],
                    "Status": "Public on Aug 02, 2023",
                    "Title": "HEK293T-H3K4me3-C&T",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: HEK293Tcell type: Human embryonic kidneyantibodies used: anti-H3K4me3 (C42D8)",
                    "Growth protocol": "WDLPS cell line was cultured in RPMI-1640 supplemented with 10% FBS and1x Penicillin-Streptomycin. HEK293T cell line was cultured in DMEM supplemented with 10% FBS and 1x Penicillin-Streptomycin. Cells were grown under standard conditions (5 % CO2, 95 % humidity, 37 °C).",
                    "Extracted molecule": "other",
                    "Extraction protocol": "Cells were harvested with trypsin and subjected to CUT&Tag protocolpA-Tn5 adaptor complex was used for library preparation",
                    "Library strategy": "OTHER",
                    "Library source": "genomic",
                    "Instrument model": "Illumina NextSeq 500",
                    "Data processing": "Sequencing data were uploaded to the Galaxy web platform and the public server at usegalaxy.org, together with R (version 3.4), were used to analyze all data.Raw FASTQ reads were trimmed with TrimGalore! (v0.6.7) and aligned to GRCh38 using Bowtie2 (v2.4.2)Normalized (RPGC, 1x Genome Coverage) coverage tracks were generated using deepTools (v3.5.1) bamCoverage with binSize 5 and the respective genome size. Peaks were called with MACS2 (v2.1.1) and high confidence peaks sets between biological replicates were obtained with BEDTools merge function considering overlapping peaks within 250 bp as maximum peak distance. Annotation of peaks was performed with the R packages “ChIPseeker” and \"ChipPeakAnno\".For GVIZ visualization of genomic regions, bigwig files were merged using deeptools2 BigwigCompare function and scaled referring to the sample with the lowest sequencing depth. BEDTools intersect function was used to identify iM/G4-unique and common peaks.Assembly: hg38Supplementary files format and content: bed file of narrow peaks called by MACS2Library strategy: CUT&Tag",
                    "Platform ID": "GPL18573"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE220882_RAW.tar",
                    "file_size": "799.5 Mb",
                    "file_type": "TAR (of BIGWIG, TXT)",
                    "download_link": "/geo/download/?acc=GSE220882&format=file"
                }
            ]
        },
        "GSE220878": {
            "Status": "Public on Aug 02, 2023",
            "Title": "Genome-wide mapping of i-Motifs reveals their association with transcription regulation in live human cells [CUT&Tag]",
            "Organism": "Homo sapiens",
            "Experiment type": "Genome binding/occupancy profiling by high throughput sequencing",
            "Summary": "i-Motifs (iMs) are four-stranded DNA structures that form at cytosine (C)-rich sequences and in acidic conditions in vitro. However, their formation and distribution in cells is still under debate. Here we performed CUT&Tag sequencing using the anti-iM antibody iMab and showed that iMs form within the human genome in live cells. We mapped native iMs in two different human cell lines and recovered C-rich sequences that were confirmed to fold into iMs in vitro. We found that iMs in cells are mainly present at actively transcribing gene promoters and that their abundance and distribution are specific to each cell type. iMs with both long and short C-tracts were recovered, further extending the relevance of iMs throughout the genome. By simultaneously mapping G-quadruplexes (G4s), four-stranded structures that form at guanine-rich regions, and comparing the results with iMs, we proved that the two structures can form in independent genomic regions; however, when both iMs and G4s are present in the same genomic tract, their formation is favored. Our findings support the in vivo formation of iM structures and provide new insights into their interplay with G4s as new regulatory elements in the human genome.",
            "Overall design": "i-motifs and G-quadruplex analysis in HEK293T (ATCC #CRL-3216) and WDLPS (ATCC #CRL-3043) through CUT&Tag method",
            "Platforms": "Platforms (1), GPL18573, Illumina NextSeq 500 (Homo sapiens)",
            "Samples": {
                "GSM6825451": {
                    "link": "/geo/query/acc.cgi?acc=GSM6825451",
                    "name": "HEK293T-H3K4me3-C&T",
                    "Supplementary file": [
                        {
                            "file_name": "GSM6825451_HEK293T_H3K4me3.bigwig",
                            "file_size": "58.6 Mb",
                            "file_type": "BIGWIG",
                            "download_link": "/geo/download/?acc=GSM6825451&format=file&file=GSM6825451%5FHEK293T%5FH3K4me3%2Ebigwig"
                        }
                    ],
                    "Status": "Public on Aug 02, 2023",
                    "Title": "HEK293T-H3K4me3-C&T",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: HEK293Tcell type: Human embryonic kidneyantibodies used: anti-H3K4me3 (C42D8)",
                    "Growth protocol": "WDLPS cell line was cultured in RPMI-1640 supplemented with 10% FBS and1x Penicillin-Streptomycin. HEK293T cell line was cultured in DMEM supplemented with 10% FBS and 1x Penicillin-Streptomycin. Cells were grown under standard conditions (5 % CO2, 95 % humidity, 37 °C).",
                    "Extracted molecule": "other",
                    "Extraction protocol": "Cells were harvested with trypsin and subjected to CUT&Tag protocolpA-Tn5 adaptor complex was used for library preparation",
                    "Library strategy": "OTHER",
                    "Library source": "genomic",
                    "Instrument model": "Illumina NextSeq 500",
                    "Data processing": "Sequencing data were uploaded to the Galaxy web platform and the public server at usegalaxy.org, together with R (version 3.4), were used to analyze all data.Raw FASTQ reads were trimmed with TrimGalore! (v0.6.7) and aligned to GRCh38 using Bowtie2 (v2.4.2)Normalized (RPGC, 1x Genome Coverage) coverage tracks were generated using deepTools (v3.5.1) bamCoverage with binSize 5 and the respective genome size. Peaks were called with MACS2 (v2.1.1) and high confidence peaks sets between biological replicates were obtained with BEDTools merge function considering overlapping peaks within 250 bp as maximum peak distance. Annotation of peaks was performed with the R packages “ChIPseeker” and \"ChipPeakAnno\".For GVIZ visualization of genomic regions, bigwig files were merged using deeptools2 BigwigCompare function and scaled referring to the sample with the lowest sequencing depth. BEDTools intersect function was used to identify iM/G4-unique and common peaks.Assembly: hg38Supplementary files format and content: bed file of narrow peaks called by MACS2Library strategy: CUT&Tag",
                    "Platform ID": "GPL18573"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE220878_RAW.tar",
                    "file_size": "791.7 Mb",
                    "file_type": "TAR (of BIGWIG)",
                    "download_link": "/geo/download/?acc=GSE220878&format=file"
                }
            ]
        },
        "GSE214891": {
            "Status": "Public on May 12, 2023",
            "Title": "Proteasome Inhibition Sensitizes Liposarcoma to Nutlin-3-induced Apoptosis via the ATF4/CHOP Axis",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencingOther",
            "Summary": "This SuperSeries is composed of the SubSeries listed below.",
            "Overall design": "Refer to individual Series",
            "Platforms": "Platforms (2), GPL16791, Illumina HiSeq 2500 (Homo sapiens), , GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6617491": {
                    "link": "/geo/query/acc.cgi?acc=GSM6617491",
                    "name": "Lipo246_DMSO_1",
                    "Status": "Public on May 12, 2023",
                    "Title": "Lipo246_DMSO_1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "treatment: 16 hr 0.05% DMSOlibrary type: strand-specific",
                    "Treatment protocol": "94T778 and Lipo-246 cells were treated with vehicle (DMSO 0.05%), or 10 uM Nutlin3R for 16 hr",
                    "Growth protocol": "94T778 and Lipo-246 cells were cultured in DMEM/F12 supplemented with 10% Equa Fetal and 1x anti-anti and were maintained at 37°C in a humidified atmosphere with 5% CO2.",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Qiagen RNeasyStrand-specific poly(A)+-enriched mRNA (Illumina TruSEQ mRNA)",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "Signal processing, base-calling, and quality scoring was carried out automatically by the NovaSeq 6000 software (Illumina).Demultiplexing and conversion to FASTQ format was carried out using bcl2fastq (Illumina).Data quality was assessed using FASTQC (v0.11.5) (https://www.bioinformatics.babraham.ac.uk/projects/fastqc/) and FastQ Screen (v0.11.0, https://www.bioinformatics.babraham.ac.uk/projects/fastq_screen/).For some samples, FASTQ files from multiple sequencing runs were merged to obtain ≥40x10^6 raw reads.Trimming and filtering of low-quality reads was performed using bbduk from BBTools (v37.99) and fastq-mcf from ea-utils (v1.05, https://expressionanalysis.github.io/ea-utils/).Alignment to the human reference genome (GRCh38) was carried out using HISAT2 (v2.1.0) in paired, spliced-alignment mode with a GRCh38 index with a Gencode v33 annotation GTF.Alignments were sorted and filtered for mapping quality (MAPQ>10) using Samtools (v1.5).Gene-level count data were quantified using HTSeq-count (v0.6.1) with the following options (--stranded=reverse –minaqual=10 –type=exon --mode=intersection-nonempty) using a Gencode v33 GTF annotation file.Assembly: GRCh38Supplementary files format and content: Tab-delimited text files containing per gene strand-specific fragment counts or normalized fragments-per-kilobase-per-million-mapped (FPKM).",
                    "Platform ID": "GPL24676"
                }
            }
        },
        "GSE214890": {
            "Status": "Public on May 12, 2023",
            "Title": "Genome-wide Nutlin-3 Sensitizing Gene (NSG) loss-of-function CRISPR screen data",
            "Organism": "Homo sapiens",
            "Experiment type": "Other",
            "Summary": "SLN screen highlights the 26s proteasome as a putitive theraputic target.",
            "Overall design": "94T778 cells transduced with the GeCKOv2 A and B libraries were treated with Nutlin3a for 72 hrs.",
            "Platforms": "Platforms (1), GPL16791, Illumina HiSeq 2500 (Homo sapiens)",
            "Samples": {
                "GSM6617499": {
                    "link": "/geo/query/acc.cgi?acc=GSM6617499",
                    "name": "94T778, 72 hr DMSO, replicate 1",
                    "Status": "Public on May 12, 2023",
                    "Title": "94T778, 72 hr DMSO, replicate 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: 94T778 liposarcoma cellscell type: Well-differentiatedgecko library: HGLibA+Bculture condition: 37°C, 5% CO2, 72 hrtreatment: DMSO 0.05%",
                    "Treatment protocol": "Cells were treated with vehicle (DMSO 0.05%), or 10 uM Nutlin3R for 72 hr94T778 cells were transduced with the GeCKOv2 A or B libraries and propogated for 10 days to clear sgRNAs targeting essential genes. The resulting cell populations were treated in triplicate with 0.05% DMSO (vehicle) or 10 uM Nutlin3R for 72 hr.",
                    "Growth protocol": "94T778 cells were cultured in DMEM/F12 supplemented with 10% Equa Fetal and 1x anti-anti and were maintained at 37°C in a humidified atmosphere with 5% CO2.",
                    "Extracted molecule": "other",
                    "Extraction protocol": "Genomic DNA was extracted using a DNeasy Blood and Tissue kit (Qiagen)Custom",
                    "Library strategy": "OTHER",
                    "Library source": "genomic",
                    "Instrument model": "Illumina HiSeq 2500",
                    "Description": "sgRNA cassette amplicon",
                    "Data processing": "Signal processing, base-calling, and quality scoring was carried out automatically by the NovaSeq 6000 software (Illumina).Demultiplexing and conversion to FASTQ format was carried out using bcl2fastq (Illumina).Samples were demultiplexed using fastx_barcode_splitter from the fastx_toolkit (v0.0.13.2), allowing up to 2 mismatches.FASTQC v0.11.2 was used to assess sequence data quality.Sequences were trimmed using fastx_trimmer from the fastx_toolkit (v0.0.13.2), with the following options: -Q33 -f 27 -l 46. This keeps only the section of each read corresponding to the unique sgRNA sequences (positions 27-46 inclusive).Bases with qual ≥10 were removed with fastx_quality_filter from the fastx_toolkit (v0.0.13.2), with the following options: -Q33 -q 10 -p 94.Trimmed and filtered sequences were mapped with Bowtie2 v2.2.3 using the following options (--phred33 --end-to-end --very-sensitive).Alignments were filtered to keep primary alignments with 0 mismatches using Samtools view.Observed counts for each sgRNA were obtained using Samtools idxstats.To avoid large differences in total sgRNA counts, samples with >20 million sgRNA-aligned reads were downsampled to 20 million reads.Assembly: A reference index was generated for Bowtie2 using only the unique sgRNA sequences from the Human GeCKOv2 library annotation available from https://media.addgene.org/cms/filer_public/7d/87/7d87eaa7-e940-41bf-bf2f-47b43c7ab905/zhang_human_geckov2_grna_sequences.zip (PMID: 24336571; PMID: 25075903)Supplementary files format and content: Tab delimited text files containing raw sgRNA counts for each sample",
                    "Platform ID": "GPL16791"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE214890_LPS_SLN_GeCKOscreen_counts.txt.gz",
                    "file_size": "2.2 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE214890&format=file&file=GSE214890%5FLPS%5FSLN%5FGeCKOscreen%5Fcounts%2Etxt%2Egz"
                }
            ]
        },
        "GSE200434": {
            "Status": "Public on Apr 08, 2022",
            "Title": "Vanished MDM2 amplification in a poorly differentiated sarcoma with amplified TERT-TRIO fusion gene: a targeted effect of radiotherapy?",
            "Organism": "Homo sapiens",
            "Experiment type": "Genome variation profiling by SNP array",
            "Summary": "The identification of genetic alterations in sarcoma may give precious clues for the diagnosis. The detection of MDM2 amplification has an important impact since it may orientate towards a dedifferentiated liposarcoma (DDLPS) or more rarely towards an intimal sarcoma. Here we describe a poorly differentiated sarcoma initially diagnosed as a DDLPS, mainly on the basis of FISH analysis that detected MDM2 amplification. The patient was treated by adjuvant radiotherapy and, when the tumor recurred a few years later, MDM2 amplification was not observed anymore. We report the clinical, immunohistological, genomic and molecular description of the primary tumors and his recurrences.",
            "Overall design": "Genetic alterations in sarcoma",
            "Platforms": "Platforms (1), GPL21558, [OncoScan_CNV] Affymetrix OncoScan CNV FFPE Assay",
            "Samples": {
                "GSM6033634": {
                    "link": "/geo/query/acc.cgi?acc=GSM6033634",
                    "name": "220602-2",
                    "Supplementary file": [
                        {
                            "file_name": "GSM6033634_220602-2-A_OncoScan_CNV_.CEL.gz",
                            "file_size": "4.5 Mb",
                            "file_type": "CEL",
                            "download_link": "/geo/download/?acc=GSM6033634&format=file&file=GSM6033634%5F220602%2D2%2DA%5FOncoScan%5FCNV%5F%2ECEL%2Egz"
                        },
                        {
                            "file_name": "GSM6033634_220602-2-C_OncoScan_CNV_.CEL.gz",
                            "file_size": "4.4 Mb",
                            "file_type": "CEL",
                            "download_link": "/geo/download/?acc=GSM6033634&format=file&file=GSM6033634%5F220602%2D2%2DC%5FOncoScan%5FCNV%5F%2ECEL%2Egz"
                        },
                        {
                            "file_name": "GSM6033634_220602-2.OSCHP.gz",
                            "file_size": "15.5 Mb",
                            "file_type": "OSCHP",
                            "download_link": "/geo/download/?acc=GSM6033634&format=file&file=GSM6033634%5F220602%2D2%2EOSCHP%2Egz"
                        },
                        {
                            "file_name": "GSM6033634_220602-2.probeset.txt.gz",
                            "file_size": "5.3 Mb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM6033634&format=file&file=GSM6033634%5F220602%2D2%2Eprobeset%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Apr 08, 2022",
                    "Title": "220602-2",
                    "Sample type": "genomic",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: sarcoma",
                    "Extracted molecule": "genomic DNA",
                    "Extraction protocol": "DNA was extracted from formol fixed-paraffin embedded fragments using Maxwell FFPE DNA LEV Kit (PROMEGA).",
                    "Data processing": "The array image was acquired using Affymetrix GeneChip® Command Console Software (version 3.2.2). Copy number values for individual SNPs were extracted and converted from CEL files into signal intensities using CHAs (version 4.0). Genomic Smoothing analysis was performed by CHAsThe CNV value is the logarithm base 2 of the sample signal divided by a reference value from the OncoScan_CNV.FFPE.na33.r2.REF_MODEL library. The allelic status is determined accordind the B-Allelic Frequency (BAF = B/(A+B) ; AA : BAF = 0, BB : BAF = 1, AB : BAF = 0,5) or the Allele Difference (Diff = A - B where each A and B allele are 0,5 units. AA : Diff = 1, AB : Diff = 0, BB : Diff = -1)",
                    "Platform ID": "GPL21558"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE200434_RAW.tar",
                    "file_size": "118.8 Mb",
                    "file_type": "TAR (of CEL, OSCHP, TXT)",
                    "download_link": "/geo/download/?acc=GSE200434&format=file"
                }
            ]
        },
        "GSE221494": {
            "Status": "Public on Jul 22, 2024",
            "Title": "Cellular origin and clonal evolution of human dedifferentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "This SuperSeries is composed of the SubSeries listed below.",
            "Overall design": "Refer to individual Series",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6876457": {
                    "link": "/geo/query/acc.cgi?acc=GSM6876457",
                    "name": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Status": "Public on Jul 22, 2024",
                    "Title": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: DDLPS_DDage at_diagnosis: 42Sex: Flocation: retroperitoneumtumour size_(mm): 380tumour grade: 2",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Total RNAs were extracted using the Trizol reagent and dosed. 1 ug of total RNA was used for the construction of sequencing libraries.RNA libraries for RNA-seq were prepared using SMARTER mRNA-Seq Library Prep Kit following manufacturer's protocols.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "FastQC (v0.11.8 or v0.11.9 according to sample) and trimming with TrimGalore (v0.6.2) or Altropos according to sample, default optionsSTAR (v2.6.1a_08-27), Picard MarkDuplicates (v2.18.14) and Cufflinks (v2.2.1), default optionsTPM-normalization of raw read counts generated by STAR (1)log2-transformation of FPKM from Cufflinks with pseudo-count +2 and normalization between samples with limma in quantil mode (2)Assembly: GRCh38Supplementary files format and content: Tab-delimited text files containing raw counts generated by STAR and corresponding TPM-normalized or FPKM-normalized counts",
                    "Platform ID": "GPL24676"
                }
            }
        },
        "GSE202361": {
            "Status": "Public on Jan 01, 2024",
            "Title": "Neoadjuvant immune checkpoint blockade in retroperitoneal dedifferentiated liposarcoma and extremity/trunk undifferentiated pleomorphic sarcoma (NCT03307616)",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Recent evidence suggests that immune checkpoint blockade (ICB) has some activity in metastatic dedifferentiated liposarcoma (DDLPS) and undifferentiated pleomorphic sarcoma (UPS). We conducted a randomized, non-comparative phase 2 trial (NCT03307616) of nivolumab or nivolumab/ipilimumab in patients with resectable retroperitoneal DDLPS (n=17) and extremity/truncal UPS (n=10), with UPS patients receiving concurrent radiation therapy. The primary endpoint of pathologic response as assessed by percent hyalinization was observed to be a median of 8.8% in DDLPS patients and 89% in UPS patients and similar in nivolumab and ipilimumab/nivolumab arms in both cohorts . Higher intratumoral densities of T-regulatory cells were associated with absence of pathologic response (hyalinization<30%). Tumor infiltration by B-cells was associated with higher densities of T-regulatory cells before treatment;  this association was lost upon ICB treatment. Our data demonstrate that neoadjuvant ICB with concurrent radiation may have significant efficacy in UPS and is associated complex immune changes in the tumor microenvironment in DDLPS and UPS.",
            "Overall design": "Tumor samples were collected at baseline, on treatment and at surgery for all patients, and analyzed using bulk RNA sequencing.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6111908": {
                    "link": "/geo/query/acc.cgi?acc=GSM6111908",
                    "name": "Sarcoma tumor tissue, Sample 1",
                    "Status": "Public on Jan 01, 2024",
                    "Title": "Sarcoma tumor tissue, Sample 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: Sarcoma tumor tissuedisease state: Soft-Tissue Sarcomatreatment: Immune checkpoint blockadecollected date: 12-05-2017collected: baselineage: 49Sex: Moutcome: PDgrade: High Grade",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was extracted by NORGEN Total RNA Purification Kit (Cat. 37500) (NORGEN BIOTEK CORP). The extracted RNA was treated with DNase I. The treated RNA then was cleaned-up using the AMPure XP beads (Beckman Coulter Life Sciences) and eluted into 1x TE buffer. The purified RNA was quantified using Quant-iT™ RiboGreen™ RNA Assay Kit (ThermoFisher SCIENTIFIC) and the RNA quality was accessed using Agilent RNA 6000 Nano Kit and the 2100 Bioanalyzer Instrument (Agilent Technologies).Up to 200 ng of each cDNA sample based on the PicoGreen quantification was sheared (mechanically fragmented) using the E220 Focused-ultrasonicator Covaris (Covaris). The sonication was performed under the following conditions: Peak Incident Power 200, Duty Cycle 25%, Cycles per Burst 50, and duration 10 seconds for 120 iterations. To ensure the proper fragment size, samples were examined on TapeStation 4200 using the DNA High Sensitivity kit (Agilent Technologies). The sheared cDNA was proceeded to library preparation using SureSelect XT Low Input Reagent Kit with indexes 1-96 (Agilent Technologies) as automated method on the Sciclone G3 NGSx Workstation (PerkinElmer, Inc.).This protocol consists of 3 enzymatic reactions for end repair, A-tailing and Adaptor ligation, followed by barcode insertion by PCR using Herculase II Fusion DNA Polymerase (8 to 14 cycles, based on input DNA quality and quantity). PCR primers were removed by using 1x volume of Agencourt AMPure PCR Purification kit (Agencourt Bioscience Corporation). The quality and quantity of the prepared libraries were evaluated using TapeStation 4200 and the DNA High Sensitivity kit (Agilent Technologies) to verify correct fragment size and to ensure complete removal of primer dimers.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "Raw RNA sequencing reads of the samples were mapped to the hg19 reference genome using the STAR aligner.RSEM was used to quantify aligned reads and produce raw counts of known transcriptsThe raw count of transcripts in the samples were then converted to transcripts per million that normalize counts for library size and gene length.Assembly: hg19Supplementary files format and content: rawcounts and TPMs",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE202361_AllSamples_TPM.txt.gz",
                    "file_size": "3.5 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE202361&format=file&file=GSE202361%5FAllSamples%5FTPM%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE202361_AllSamples_rawcount.txt.gz",
                    "file_size": "2.9 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE202361&format=file&file=GSE202361%5FAllSamples%5Frawcount%2Etxt%2Egz"
                }
            ]
        },
        "GSE247026": {
            "Status": "Public on Nov 09, 2023",
            "Title": "SAR-096: Phase II clinical trial of ribociclib in combination with everolimus in advanced dedifferentiated liposarcoma (DDL), and leiomyosarcoma (LMS)",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Purpose: DDL and LMS are two common subtypes of soft tissue sarcoma, a rare group of diseases for which new treatments are needed. Chemotherapy remains the standard option for advanced disease. Targeting CDK4/6 in DDL and mTOR in LMS is of biologic interest. When combined, the CDK4 inhibitor ribociclib and the mTOR inhibitor everolimus, have shown synergistic growth inhibition in multiple tumor models, suggesting that this combination could be beneficial in patients.Methods: This was a single arm, open label, multi-center phase II study of the combination of ribociclib and everolimus. Patients were enrolled into one of two cohorts: DDL or LMS with intact Rb. The primary endpoint was progression free rate (PFR) at 16 weeks. Secondary endpoints included progression free (PFS) and overall survival, safety and biomarker analyses. Results: In the DDL cohort, 33.3% (95% CI 15.6%-55.3%) of patients were progression free at 16 weeks. Median PFS in this cohort was 15.4 weeks (95% CI, 8-36 weeks) with 2 partial responses. In the LMS cohort the PFR at 16 weeks was 29.2% (95% CI 12.6%-51.1%). Median PFS in this cohort was 15.7 weeks (95% CI 7.7-NA). Most common toxicities included fatigue (66.7%), anorexia (43.8%) and hyperglycemia (43.8%). Concordance between Rb testing methodologies was poor.Conclusions: The combination of ribociclib and everolimus demonstrates activity in DDL with prolonged stable disease (≥16 weeks) meeting the primary endpoint. Notably partial responses were observed. The primary endpoint was not reached in the LMS cohort. The combination was well tolerated with expected side effects.",
            "Overall design": "We have collected total RNAs of sarcoma patient samples which are either responders or non-responders. We want to study the gene expression changes between the two groups.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM7882289": {
                    "link": "/geo/query/acc.cgi?acc=GSM7882289",
                    "name": "LMS_responder.0",
                    "Status": "Public on Nov 09, 2023",
                    "Title": "LMS_responder.0",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: leiomyosarcoma (LMS)cell type: sarcoma",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was extracted from FFPE tissue samples and RNA-seq was performed by Novogene (https://en.novogene.com) using the Illumina TrueSeq RNA exome pipeline.RNA sequence library was contructed using NEBNext Ultra II Directional RNA library prep kit.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "LMS_responder.0(S1.A_H_039)",
                    "Data processing": "Raw reads were aligned to hg38 genome using tophatCufflinks algorithm was implemented to assemble transcripts and estimate their abundance. Cuffdiff was used to statistically assess expression changes in quantified genes across different conditions.Supplementary files format and content: fpkm value in tab-delimited format",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE247026_Sample_genes_fpkm.xlsx",
                    "file_size": "5.3 Mb",
                    "file_type": "XLSX",
                    "download_link": "/geo/download/?acc=GSE247026&format=file&file=GSE247026%5FSample%5Fgenes%5Ffpkm%2Exlsx"
                }
            ]
        }
    }
}