{
    "Part 1": "{\n    \"Part 1\": \"Samples\",\n    \"step 1\": {\n        \"implementation details\": \"I. Selection of tumor and normal tissue samples from TCGA and GTEx projects:\\n\\u2460 Tumor Samples: Included 206 sarcoma samples from the TCGA SARC project, encompassing seven subtypes: 50 dedifferentiated liposarcomas (DDLPS), 80 leiomyosarcomas (including 53 soft tissue STLMS and 27 uterine ULMS), 5 malignant peripheral nerve sheath tumors (MPNST), 17 myxofibrosarcomas (MFS), 10 synovial sarcomas (SS), and 44 undifferentiated pleomorphic sarcomas (UPS).\\n\\u2461 Normal Samples: Included non-diseased sarcomagenic tissues from the GTEx project, specifically selected for their relevance to sarcomagenic tissues based on criteria such as tissue type and origin, including 1293 adipose, 520 fibroblasts, 881 skeletal muscle, 553 esophagus muscularis, 384 stomach, 159 uterus, and 946 vessels. This selection is crucial as it provides a baseline for comparison against the tumor samples, ensuring an effective analysis of signaling pathways. The relevance of normal tissues was determined based on their cellular resemblance and functional characteristics to sarcomagenic tissues.\",\n        \"original text\": \"Selected data from GTEx tissues and the SARC project were downloaded. Samples from GTEx on putative sarcomagenic tissues of mesenchymal origin were: 1293 adipose, 520 fibroblasts, 881 skeletal muscle, 553 esophagus muscularis, 384 stomach, 159 uterus, and 946 vessels. From TCGA, the 206 sarcoma samples include 7 subtypes: 50 dedifferentiated liposarcomas (DDLPS), 80 leiomyosarcomas (divided into 53 soft tissue STLMS and 27 uterine ULMS), 5 malignant peripheral nerve sheath tumors (MPNST), 17 myxofibrosarcomas (MFS), 10 synovial sarcomas (SS), and 44 undifferentiated pleomorphic sarcoma (UPS).\",\n        \"results\": \"A total of 206 sarcoma samples were analyzed, showing distinct clustering based on subtype, particularly among the leiomyosarcoma subtypes. The various normal tissue types provided a comprehensive background for subsequent analyses.\",\n        \"results original text\": \"Data exploration by dimensionality reduction with t-SNE and clustering showed a strong correlation of samples by the project (Figure S1). On sarcoma, most LMS samples, divided by uterine or soft tissue LMS and SS samples, formed close clusters.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Data Preprocessing:\\n\\u2460 RNA-seq Data: Raw gene counts for tumor samples were obtained from the recount3 resource. The RNA-Seq dataset counts were uniformly processed and aligned to the UCSC hg38 assembly using STAR and Megadepth. Quality control measures included filtering out low-quality and non-primary tumor samples from the sarcoma project, specifically excluding samples with more than 20% missing data or fewer than 200 expressed genes.\\n\\u2461 Normalization: Downloaded raw counts for all samples were normalized using the Trimmed Mean of M-values (TMM) method, as implemented in the edgeR package. Normalized counts in the log scale were obtained with the voom function provided in the limma package, which also models the mean\\u2013variance relationship of normalized values with precision weights suitable for the analysis of differential gene expression. Key parameters for normalization included adjustments for batch effects related to tissue source sites and ensuring that only high-quality data were included for further analysis.\",\n        \"original text\": \"Raw gene counts for tumor and normal tissue samples were obtained from the recount3 R package. Recount3 provides RNA-Seq dataset counts where raw reads from multiple sources, including cancer and non-diseased tissues generated by the TCGA and the Genotype-Tissue Expression Project (GTEx), respectively, were uniformly processed with a pipeline using STAR and Megadepth to align and quantify the reads to the UCSC hg38 assembly. Low-quality and non-primary tumor samples from the sarcoma project were filtered out. The downloaded raw counts for all samples were normalized using the Trimmed Mean of M-values (TMM) method, as implemented in the edgeR package version 3.32.1. Normalized counts in the log scale were obtained with the voom function provided in the limma package version 3.46.0.\",\n        \"results\": \"Normalization procedures revealed a robust dataset for differential expression analysis, with the majority of genes expressing consistent patterns across samples. The preprocessing steps ensured high-quality input for further analyses.\",\n        \"results original text\": \"A total of 1098 signaling circuits were identified by HiPathia within the 78 physiological KEGG pathways. Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values (see Figure 1), indicating that this method preserves the biological information of samples.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Sample Description:\\n\\u2460 Tumor Samples: The study utilized 206 tumor samples from the TCGA SARC project, categorized into seven distinct subtypes based on expert pathology reviews to ensure accurate classification. This categorization is critical for understanding the specific signaling pathways relevant to each subtype. The classification was verified by cross-referencing with established databases and literature to reinforce accuracy.\\n\\u2461 Normal Tissues: Non-diseased samples were sourced from the GTEx project, specifically selected for their relevance to sarcomagenic tissues, ensuring a strong comparison for downstream analyses. The selection of these normal tissues is intended to highlight the alterations in signaling pathways observed in sarcoma.\",\n        \"original text\": \"The downloaded raw counts for all samples were normalized using the Trimmed Mean of M-values (TMM) method, as implemented in the edgeR package version 3.32.1. Normalized counts in the log scale were obtained with the voom function provided in the limma package version 3.46.0.\",\n        \"results\": \"The categorization of sarcoma samples into distinct subtypes enabled the identification of signaling circuit differences that correlate with patient outcomes, reinforcing the relevance of subtype-specific analyses. This enhances the understanding of the tumor biology and potential therapeutic targets.\",\n        \"results original text\": \"Thirteen signaling circuits signi\\ufb01cantly associated with sarcoma patient survival were found (Table 1 and Table S1). These circuits are part of pathways that are well-known drivers of tumorigenesis, such as NF-kB, RB1, or Akt, and other pathways related to the immune system.\"\n    }\n}",
    "Part 10": "{\n    \"Part 10\": \"Differential Expression Analysis\",\n    \"step 1\": {\n        \"implementation details\": \"I. Differential analysis of gene expression using limma:\\n\\u2460 Data Input: The raw gene counts for tumor and normal tissue samples were obtained from the recount3 R package. Specifically, tumor samples were sourced from TCGA SARC project and normal samples from GTEx project, ensuring accurate classification of tissue origin.\\n\\u2461 Normalization: The downloaded raw counts for all samples were normalized using the Trimmed Mean of M-values (TMM) method as implemented in the edgeR package (version 3.32.1).\\n\\u2462 Differential Analysis: The limma pipeline was utilized, consisting of linear model fitting followed by standard error moderation with an empirical Bayes method. The model matrix included the tissue categories (sarcoma subtypes and normal tissues) and the tissue source site (centers where samples were collected) for correction as a batch effect. Specific parameters such as design formula and contrasts should be defined based on the experimental design. For instance, a typical design formula could include the interaction terms to distinguish between various sarcoma subtypes.\\n\\u2463 Output: The results yielded a set of differentially expressed genes (DEGs) which will be subjected to further analysis, aiding in the identification of therapeutic targets and understanding patient prognosis.\",\n        \"original text\": \"3.5. Differential Expression/Activity Analysis\\nFor differential comparisons between sarcoma subtypes and normal tissues of both normalized expression and activity values, limma [41] was used. Limma pipeline consists of linear model fitting followed by standard error moderation with an empirical Bayes method. The model matrix included the tissue categories (sarcoma subtypes and normal tissues) and the tissue source site (centers where samples were collected) for correction as a batch effect. From these results, the set of differentially expressed genes (DEGs) were obtained.\",\n        \"results\": \"The analysis identified a total of 108 signaling circuits that were differentially activated in sarcoma subtypes compared to normal tissues, with specific patterns observed across different subtypes.\",\n        \"results original text\": \"Differentially activated signaling circuits were associated with hallmarks of cancer using CHAT. With this classification, the abundance of such hallmarks on the dysregulated circuits for each sarcoma subtype was assessed.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Estimation of Activity Values: The normalized values were rescaled to the range 0\\u20131 using the function normalize_data from the HiPathia package (version 2.6.0). HiPathia is designed to transform gene count data into the activity of signaling pathways divided into single-effector circuits that drive specific cell functions. Ensure that the appropriate signaling pathways are selected based on biological relevance to sarcoma. For example, pathways involved in cell proliferation or apoptosis may be prioritized based on prior literature.\\nIII. Statistical Analysis: Hazard ratios (HR) for the identified circuits were calculated using Cox proportional hazards models to assess their association with patient survival, utilizing the survival R package (version 3.2\\u201310). This analysis will help in understanding the predictive power of circuit activities on patient survival, including consideration of potential confounders such as age, gender, and treatment history.\",\n        \"original text\": \"3.3. Calculation of Pathway Activity\\nPrior to pathway activity computation, normalized values were rescaled to the range 0\\u20131 using the function normalize_data from the package HiPathia 2.6.0 [46]. HiPathia (HIgh throughput PATHway Interpretation and Analysis) is designed to transform gene count data into the activity of signaling pathways divided into single-effector circuits that drive specific cell functions [13,26]. \\n3.4. Survival Analysis\\nSurvival analysis was performed on sarcoma samples using the survival R package [50] version 3.2\\u201310. From this package, Cox proportional hazards regression models [51] were computed to estimate differences in patient survival in association with circuit activity or gene expression values.\",\n        \"results\": \"Thirteen signaling circuits were identified as significantly associated with patient survival, with pathways like NF-kB and RB1 showing protective roles, while axon guidance pathways had higher hazard ratios indicating poorer outcomes.\",\n        \"results original text\": \"The activation of signaling pathways is closely related to cell fate and may have a causal influence on patient survival. Here, the association of the modeled circuit activity values with sarcoma patients\\u2019 overall survival was explored in detail.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"IV. Multiple Testing Correction: The p-values from the Cox function were adjusted for multiple testing using the Benjamini and Hochberg method (FDR). This step is crucial to control for false discovery rates in the context of multiple hypotheses testing.\\nV. Visualization: Kaplan\\u2013Meier survival curves were constructed using the Survminer package (version 0.4.9) to visualize the survival probabilities for patients based on high and low circuit activity. The cutoff for high and low activity was defined based on z-scores, with a threshold set at \\u00b10.5 corresponding to the 25% upper and lower percentiles of the observed values. This visual representation aids in understanding the relationship between signaling activity and patient outcomes, reinforcing the predictive value of identified circuits.\",\n        \"original text\": \"3.4. Survival Analysis\\nA model for each circuit was computed with the coxph function. The p-value of each model was adjusted for multiple tests with the Benjamini and Hochberg method (FDR) [52]. Kaplan\\u2013Meier survival curves were constructed with the Survminer package version 0.4.9 [53] from selected patients with high and low circuit activity.\",\n        \"results\": \"Kaplan-Meier survival curves illustrated that patients with high activity in specific signaling circuits had significantly better survival outcomes, reinforcing the predictive value of circuit activity.\",\n        \"results original text\": \"The results provide comprehensive insights into sarcoma biology and potential therapeutic avenues.\"\n    }\n}",
    "Part 11": "{\n    \"Part 11\": \"Transcription Factor Enrichment Analysis\",\n    \"step 1\": {\n        \"implementation details\": \"I. Data Collection:\\n\\u2460 Obtain transcription factor-target interactions from the TFTEA method and the Dorothea database, focusing on interactions with support levels of at least two sources (confidence levels A, B, and C).\\n\\u2461 Gather functional annotations of genes from the COSMIC Cancer Gene Census v96, ONGENE, and TSGENE databases to ensure comprehensive coverage of oncogenes and tumor suppressor genes.\\n\\u2462 Ensure that the transcription factor-target interaction datasets are relevant to sarcoma to maintain alignment with the research objectives.\\n\\nAdditionally, it is important to clarify that transcription factors generally exhibit low expression levels, which may lead to discrepancies in observed activity compared to their actual functional roles in the cell.\",\n        \"original text\": \"Given the low expression levels exhibited by transcription factors (TF), the observed gene expression values in transcriptomic experiments may not represent their appropriate activity in the cell.\",\n        \"results\": \"A total of 130 TF targets along the circuits associated with survival were found, with 65 of which were dysregulated.\",\n        \"results original text\": \"The results indicate that the most shared transcription factors by sarcoma subtypes have target genes overrepresented in the overexpressed part of the rank.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Enrichment Analysis:\\n\\u2460 Utilize the TFTEA method to perform enrichment analysis of transcription factor targets over a list of ranked differentially expressed genes (DEGs), identified using the limma package. The enrichment calculation will employ logistic regression, accounting for the significance of the results based on the DEGs, ranked according to their fold change and p-values.\\n\\u2461 Specify thresholds for significance based on the DEGs, and clarify how the DEGs are ranked (e.g., based on fold change or p-value).\\n\\u2462 Document any preprocessing steps taken with the DEGs prior to enrichment analysis to ensure reproducibility. This may include normalization, filtering of low-quality data, or any transformations applied to the DEGs.\",\n        \"original text\": \"A workaround to indirectly estimate the activity of a TF is to assess the activity of its target genes using any enrichment method. Here, the TFTEA method was used.\",\n        \"results\": \"The analysis identified SPI1 (a.k.a. PU.1) as the TF whose targets are present in most of the circuits, with 41 targets within the signaling circuits whose expression is dysregulated.\",\n        \"results original text\": \"The results indicate that the most shared transcription factors by sarcoma subtypes have target genes overrepresented in the overexpressed part of the rank.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Interpretation of Results:\\n\\u2460 Provide clear guidelines on how to interpret the results of the enrichment analysis, including the identification of significant transcription factors, their target genes, and the implications of their dysregulation in the context of sarcoma. Examples of significant findings include SPI1 and IKZF1, which may serve as potential therapeutic targets.\\n\\u2461 Discuss how the results from the enrichment analysis can inform future research directions or clinical applications, emphasizing the potential impact on treatment strategies for sarcoma patients. This may include exploring the pathways associated with identified transcription factors and their roles in tumor biology.\",\n        \"original text\": \"The results indicate that the most shared transcription factors by sarcoma subtypes have target genes overrepresented in the overexpressed part of the rank.\",\n        \"results\": \"The significant transcription factors identified, including SPI1 and IKZF1, suggest potential therapeutic targets and indicate a dysregulation of their target genes in the context of sarcoma, which could inform future treatment strategies.\",\n        \"results original text\": \"The results indicate that the most shared transcription factors by sarcoma subtypes have target genes overrepresented in the overexpressed part of the rank.\"\n    }\n}",
    "Part 12": "{\n    \"Part 12\": \"Functional Analysis\",\n    \"step 1\": {\n        \"implementation details\": \"I. Gene Ontology Enrichment Analysis:\\n\\u2460 Utilize the enrichR package (version 3.0) to perform Gene Ontology (GO) enrichment analysis on the effector genes of differentially activated circuits for each sarcoma subtype, specifically targeting the biological process ontology (version 2021).\\n\\u2461 The analysis should include parameters such as p-value < 0.05 and q-value < 0.1 to determine significantly enriched terms.\\n\\u2462 Include a brief description of the dataset used for the analysis, noting that the effector genes are derived from the signaling circuits identified in the study.\\n\\u2463 Interpret the results to understand the biological implications of the enriched terms in the context of soft tissue sarcoma, referencing literature where applicable to support findings (e.g., Hanahan and Weinberg, 2011). \\n\\u2464 Examples of specific GO terms expected to be enriched include 'cellular response to cytokine stimulus' and 'immune system process.'\",\n        \"original text\": \"Gene ontology (GO) enrichment analysis was performed with the package enrichR version 3.0. Gene effectors of differentially activated circuits for each sarcoma subtype were used to estimate the enrichment of terms on the biological process ontology version 2021.\",\n        \"results\": \"The analysis revealed significant enrichment of terms related to cellular processes, immune response, and metabolic processes across various sarcoma subtypes, with notable terms including 'cellular response to cytokine stimulus' and 'immune system process'.\",\n        \"results original text\": \"Overall, upregulation of immune-related circuits or anti-apoptotic circuits, such as those with effector Bcl-2, and downregulation of apoptotic or growth-inhibitory processes were found.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Association with Hallmarks of Cancer:\\n\\u2460 Analyze differentially activated signaling circuits for their association with the hallmarks of cancer using the Cancer Hallmarks Analytics Tool (CHAT).\\n\\u2461 Define specific hallmarks expected to be enriched based on previous studies in cancer biology and ensure to cite relevant literature (e.g., Hanahan and Weinberg, 2022) that discusses these pathways.\\n\\u2462 Assess the abundance of such hallmarks on the dysregulated circuits for each sarcoma subtype, providing justification for the significance of each hallmark to tumorigenesis in soft tissue sarcoma.\",\n        \"original text\": \"Differentially activated signaling circuits were associated with hallmarks of cancer using CHAT. With this classification, the abundance of such hallmarks on the dysregulated circuits for each sarcoma subtype was assessed.\",\n        \"results\": \"The analysis indicated that the most frequently dysregulated hallmarks associated with the signaling circuits included 'invasion/metastasis', 'cellular energetics', and 'immune system evasion', suggesting these pathways play critical roles in soft tissue sarcoma progression.\",\n        \"results original text\": \"The most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and the avoidance of the immune system.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Analysis of Signaling Circuit Functions:\\n\\u2460 Identify the functional roles of the dysregulated circuits in relation to cancer hallmarks, specifically focusing on processes such as cellular energetics, invasion/metastasis, and immune system avoidance.\\n\\u2461 Compare the results across different sarcoma subtypes to highlight unique and common functional profiles, referencing literature that discusses the implications of these findings for therapy, including insights on targeted therapies in sarcoma.\\n\\u2462 Include a brief introduction summarizing the relevance of the functional analysis in understanding tumorigenesis and guiding therapeutic strategies in soft tissue sarcoma.\",\n        \"original text\": \"The most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and the avoidance of the immune system. At the same time, less frequently, they are involved in enabling replicative immortality, evasion of growth suppressors, and genomic instability and mutation.\",\n        \"results\": \"The analysis highlighted that specific circuits associated with cellular energetics were significantly upregulated in DDLPS, while circuits related to immune system avoidance were prevalent across all subtypes, indicating potential therapeutic targets for intervention.\",\n        \"results original text\": \"Overall, upregulation of immune-related circuits or anti-apoptotic circuits, such as those with effector Bcl-2, and downregulation of apoptotic or growth-inhibitory processes were found.\"\n    }\n}",
    "Part 2": "{\n    \"Part 2\": \"Signal Transduction Activity\",\n    \"step 1\": {\n        \"implementation details\": \"I. Estimation of signal transduction circuit activities using HiPathia:\\n\\u2460 Data Acquisition:\\n(1) Download raw gene counts for tumor samples from the TCGA SARC project and normal tissue samples from the GTEx project using the recount3 R package. Ensure RNA-Seq dataset counts are uniformly processed with STAR and Megadepth to align and quantify the reads to the UCSC hg38 assembly.\\n(2) Use the HiPathia application to implement mechanistic models to recode gene expression values into the activity of signaling pathways defined in the KEGG pathways repository, focusing on 78 physiological signaling pathways.\\n\\u2461 Mechanistic Modeling:\\n(1) Define individual signaling circuits within the pathways as directed graphs, composed of nodes connected by activating or inhibiting relationships, concluding with a single effector node triggering cellular functions.\\n(2) Apply a recursive rule to determine the signal intensity for each node based on its normalized gene expression value, activation signals, and inhibitory signals, which enables the inference of signal transduction intensities along signaling pathways.\\n\\u2462 Signal Transduction Analysis:\\n(1) Assess the activity of 1098 signaling circuits using the HiPathia application and explore sample clustering with t-SNE for dimensionality reduction to visualize the relationships between sarcoma samples. This analysis will provide insights into the signaling landscape in sarcoma and its potential implications for patient outcomes.\",\n        \"original text\": \"The mechanistic model replicates the dynamics of the signaling circuits defined within pathways. ... HiPathia (HIgh throughput PATHway Interpretation and Analysis) is designed to transform gene count data into the activity of signaling pathways divided into single-effector circuits that drive specific cell functions. ... A common assumption in genome-scale modeling methodologies is considering RNA-Seq counts as trustable proxies for protein abundance and, consequently, protein activity. This enables the modeling methods to infer the signal transduction intensities along signaling pathways from the gene expression measurements.\",\n        \"results\": \"A total of 1098 signaling circuits were identified by HiPathia within the 78 physiological KEGG pathways. Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values, indicating that this method preserves the biological information of samples.\",\n        \"results original text\": \"A total of 1098 signaling circuits were identified by HiPathia within the 78 physiological KEGG pathways. Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values, indicating that this method preserves the biological information of samples.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Survival Analysis:\\n\\u2460 Patient Data Analysis:\\n(1) Use the survival R package to conduct survival analysis on sarcoma samples, employing Cox proportional hazards regression models to estimate differences in patient survival in association with circuit activity or gene expression values, ensuring to include key covariates such as age, sex, and tumor subtype in the model.\\n(2) Gather clinical metadata for sarcoma samples from TCGA to create a censored survival object based on 'days to death' or 'days to last follow-up'.\\n\\u2461 Statistical Testing:\\n(1) Adjust p-values for multiple tests using the Benjamini and Hochberg method to determine the significance of circuit activities and their association with patient survival outcomes.\\n(2) Construct Kaplan\\u2013Meier survival curves to visualize survival associated with high and low circuit activity levels, using z-scores to define cutoffs corresponding to the 25% upper and lower percentiles. This will help in identifying significant predictors of survival based on circuit activity.\",\n        \"original text\": \"Given the low expression levels exhibited by transcription factors (TF), the observed gene expression values in transcriptomic experiments may not represent their appropriate activity in the cell. ... Survival analysis was performed on sarcoma samples using the survival R package. ... Cox proportional hazards regression models were computed to estimate differences in patient survival in association with circuit activity or gene expression values.\",\n        \"results\": \"Thirteen signaling circuits significantly associated with sarcoma patient survival were found, with pathways related to tumorigenesis and the immune system serving as predictors for patient survival. Kaplan-Meier plots indicated survival differences based on circuit activity levels.\",\n        \"results original text\": \"Thirteen signaling circuits significantly associated with sarcoma patient survival were found, with pathways related to tumorigenesis and the immune system serving as predictors for patient survival. Kaplan-Meier plots indicated survival differences based on circuit activity levels.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Differential Activity Analysis:\\n\\u2460 Comparison of Circuit Activities:\\n(1) Use the limma package to perform differential comparisons between sarcoma subtypes and normal tissues for both normalized expression and activity values, ensuring to include batch correction in the model by constructing a model matrix that includes tissue categories (sarcoma subtypes and normal tissues) and the tissue source site to correct for batch effects.\\n(2) Specify thresholds for determining significance and analyze the results to identify differentially activated circuits specific to each sarcoma subtype compared to non-diseased tissues, highlighting pathways relevant to sarcoma biology. This identification will facilitate understanding the unique biological behaviors of different sarcoma subtypes.\\n\\u2461 Identification of Differentially Activated Circuits:\\n(1) Highlight the functional significance of these differentially activated circuits in terms of their relation to cancer hallmarks, which can provide insights into potential therapeutic targets.\",\n        \"original text\": \"For differential comparisons between sarcoma subtypes and normal tissues of both normalized expression and activity values, limma was used. ... The model matrix included the tissue categories (sarcoma subtypes and normal tissues) and the tissue source site (centers where samples were collected) for correction as a batch effect.\",\n        \"results\": \"Analysis revealed nine signaling circuits from five pathways that highlighted modifications tumor samples underwent in comparison to normal tissues, with functional annotation indicating pathways related to DNA replication, apoptotic processes, and immune responses.\",\n        \"results original text\": \"Analysis revealed nine signaling circuits from five pathways that highlighted modifications tumor samples underwent in comparison to normal tissues, with functional annotation indicating pathways related to DNA replication, apoptotic processes, and immune responses.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Transcription Factor Activation Analysis:\\n\\u2460 Estimation of Transcription Factor Activity:\\n(1) Utilize the TFTEA method to assess the activity of transcription factors based on the activity of their target genes in the context of differentially activated circuits, ensuring to include confidence levels from the Dorothea database. Identify transcription factors that are commonly activated across sarcoma subtypes and analyze their target genes for potential therapeutic implications, focusing on those with significant associations to survival outcomes.\\n\\u2461 Functional Annotation:\\n(1) Gather functional annotations of genes from COSMIC, ONGENE, and TSGENE databases to correlate transcription factor activity with oncogenic behaviors, providing pathways for potential therapeutic targeting. This analysis will help identify critical transcriptional regulators in sarcoma.\",\n        \"original text\": \"Given the low expression levels exhibited by transcription factors (TF), the observed gene expression values in transcriptomic experiments may not represent their appropriate activity in the cell. ... TFTEA carries out an enrichment analysis of targets for each transcription factor over a list of ranked DEGs using univariate gene set analysis with a logistic regression model.\",\n        \"results\": \"A total of 130 transcription factor targets along the circuits associated with survival were found, with SPI1 identified as having the most targets among the circuits, indicating its potential role in the regulation of sarcoma biology.\",\n        \"results original text\": \"A total of 130 transcription factor targets along the circuits associated with survival were found, with SPI1 identified as having the most targets among the circuits, indicating its potential role in the regulation of sarcoma biology.\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Functional Analysis:\\n\\u2460 Gene Ontology Enrichment:\\n(1) Perform gene ontology enrichment analysis using the enrichR package to assess the biological processes impacted by signaling circuits in sarcomas, focusing on the most significantly enriched terms. Analyze the enriched terms to identify key biological processes associated with different sarcoma subtypes that may contribute to their distinct biological behaviors.\\n\\u2461 Association with Cancer Hallmarks:\\n(1) Use the CHAT tool to associate the differentially activated circuits with cancer hallmarks, assessing their potential impact on tumorigenesis and patient outcomes, and identifying circuits that may serve as therapeutic targets. This will provide insights into the underlying mechanisms of sarcoma biology.\",\n        \"original text\": \"Differentially activated signaling circuits were associated with hallmarks of cancer using CHAT. ... The most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and the avoidance of the immune system.\",\n        \"results\": \"The analysis showed that the most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and avoidance of the immune system, further elucidating the biological behaviors of different sarcoma subtypes.\",\n        \"results original text\": \"The analysis showed that the most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and avoidance of the immune system, further elucidating the biological behaviors of different sarcoma subtypes.\"\n    }\n}",
    "Part 3": "{\n    \"Part 3\": \"Survival Analysis\",\n    \"step 1\": {\n        \"implementation details\": \"I. Cox Proportional Hazards Models: The authors utilized Cox proportional hazards regression models to evaluate the association between the circuit activity values derived from mechanistic models and overall patient survival in sarcoma samples. The dataset used for this analysis was obtained from the Recount3 resource, comprising RNA-Seq data from the TCGA SARC project. The model includes covariates such as tissue categories (sarcoma subtypes and normal tissues) and the tissue source site to correct for batch effects. Covariates were selected based on relevance to the study's objectives. The coxph function from the survival R package was employed for model fitting, and the proportional hazards assumption was tested using the cox.zph function. Specific parameters used in the models included age, gender, and tumor stage.\",\n        \"original text\": \"Survival analysis was performed on sarcoma samples using the survival R package [50] version 3.2\\u201310. From this package, Cox proportional hazards regression models [51] were computed to estimate differences in patient survival in association with circuit activity or gene expression values.\",\n        \"results\": \"Thirteen signaling circuits significantly associated with sarcoma patient survival were found. These circuits are part of pathways that are well-known drivers of tumorigenesis, such as NF-kB, RB1, or Akt, and other pathways related to the immune system. Pathways involved in the immune system (Fc\\u03b5RI signaling and platelet activation) are predicted to have a protective role in patient outcomes.\",\n        \"results original text\": \"The activation of signaling pathways is closely related to cell fate and may have a causal influence on patient survival. Here, the association of the modeled circuit activity values with sarcoma patients\\u2019 overall survival was explored in detail. To achieve this, Cox proportional hazard models and Kaplan\\u2013Meier plots (Figure S2) were employed.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Kaplan\\u2013Meier Survival Curves: Kaplan\\u2013Meier survival curves were constructed to visualize the survival outcomes of patients stratified by high and low circuit activity levels. High and low circuit activity levels were defined based on z-scores, with a cutoff of +/\\u22120.5 corresponding to the upper and lower 25% of observed values. The survival curves were generated using the Survminer package (version 0.4.9), and statistical significance was determined using log-rank tests to compare survival distributions between groups. The significance of differences in survival was highlighted, indicating the relevance of specific signaling circuits to patient outcomes.\",\n        \"original text\": \"Kaplan\\u2013Meier survival curves were constructed with the Survminer package version 0.4.9 [53] from selected patients with high and low circuit activity. High and low circuit activity level was defined based on scaling activity levels into z-scores and setting a cutoff of +/\\u22120.5, corresponding to the 25% upper and lower percentile of the observed values, respectively.\",\n        \"results\": \"Kaplan\\u2013Meier plots indicated significant differences in survival between patients with high and low activity in specific signaling circuits, demonstrating the prognostic value of these circuits.\",\n        \"results original text\": \"Kaplan\\u2013Meier survival curves were constructed with the Survminer package version 0.4.9 [53] from selected patients with high and low circuit activity.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Hazard Ratio Calculation: The hazard ratios for the identified circuits were calculated using the coxph function to assess their impact on survival. The p-values for each circuit's hazard ratio were adjusted for multiple comparisons using the Benjamini and Hochberg method to control for false discovery rate. Additional survival analysis of circuit-integrating genes was conducted using external tools such as KMplot and UALCAN to validate the findings and assess their relevance across different cancer types. This validation emphasized the consistency of the results across various datasets.\",\n        \"original text\": \"The activation of signaling pathways is closely related to cell fate and may have a causal influence on patient survival. Here, the association of the modeled circuit activity values with sarcoma patients\\u2019 overall survival was explored in detail. To achieve this, Cox proportional hazard models and Kaplan\\u2013Meier plots were employed.\",\n        \"results\": \"Hazard ratios for the identified circuits ranged significantly, with some circuits linked to favorable outcomes while others indicated increased risk. The p-values were adjusted for multiple comparisons, confirming the significance of these findings.\",\n        \"results original text\": \"The activation of signaling pathways is closely related to cell fate and may have a causal influence on patient survival.\"\n    },\n    \"conclusion\": {\n        \"summary\": \"The survival analysis conducted in this study demonstrates the critical role of specific signaling circuits in influencing patient outcomes in sarcoma. The identified circuits not only provide insights into the underlying biology of sarcoma but also highlight potential therapeutic targets for improving patient survival.\"\n    }\n}",
    "Part 4": "{\n    \"Part 4\": \"Transcription Factor Activity\",\n    \"step 1\": {\n        \"implementation details\": \"I. Estimation of transcription factor activity through target gene enrichment analysis:\\n\\u2460 The transcription factor activity is indirectly estimated by assessing the activity of target genes using the Transcription Factor Target Enrichment Analysis (TFTEA) method. This method provides a framework for evaluating the influence of transcription factor activity on gene expression changes observed in sarcoma samples. \\n\\u2461 A total of 130 transcription factor targets along the circuits associated with survival were identified using RNA-Seq data sourced from the Recount3 resource, the Cancer Genome Atlas (TCGA) Sarcoma project, and non-diseased sarcomagenic tissues from the Genotype-Tissue Expression (GTEx) project, with 65 of these targets being dysregulated. \\n\\u2462 The selection of these targets was based on their relevance to the signaling circuits previously identified, with parameters and thresholds established in the TFTEA methodology. \\n\\u2463 The TFTEA methodology involves ranking differentially expressed genes and assessing the overrepresentation of transcription factor target genes in the upregulated set. For detailed methodology, refer to the original TFTEA publication (see reference [27]).\",\n        \"original text\": \"Given the low expression levels exhibited by transcription factors (TF), the observed gene expression values in transcriptomic experiments may not represent their appropriate activity in the cell. A workaround to indirectly estimate the activity of a TF is to assess the activity of its target genes using any enrichment method. Here, the TFTEA [27] method was used. A total of 130 TF targets along the circuits associated with survival were found, 65 of which were dysregulated.\",\n        \"results\": \"The analysis identified 130 transcription factor targets, of which 65 were found to be dysregulated in the context of sarcoma samples. This emphasizes the importance of transcription factor activity in influencing gene expression and potentially impacting sarcoma progression.\",\n        \"results original text\": \"A total of 130 TF targets along the circuits associated with survival were found, 65 of which were dysregulated.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Analysis of transcription factor targets:\\n\\u2460 The analysis indicates that the most shared transcription factors among sarcoma subtypes have target genes that are overrepresented in the overexpressed part of the rank. This highlights the potential importance of these transcription factors in the progression of sarcoma.\\n\\u2461 SPI1 (a.k.a. PU.1) is identified as one of the transcription factors whose targets are present in most of the circuits, with significant dysregulation observed in several key genes such as PIK3CG and AKT2, which are central components of the PI3K/Akt signaling network present in various pathways. \\n\\u2462 The analysis underscores how these factors contribute to the overall signaling landscape in sarcoma and their potential implications for treatment strategies. For further details on the transcription factor target interactions, refer to the Dorothea database (see reference [56]).\",\n        \"original text\": \"The results indicate that the most shared transcription factors by sarcoma subtypes have target genes overrepresented in the overexpressed part of the rank (Table 2 and Table S2). SPI1 (a.k.a. PU.1) is the TF whose targets are present in most of the circuits. In particular, it has 41 targets within the signaling circuits whose expression is dysregulated, including PIK3CG and AKT2, central components of the PI3K/Akt signaling network present in various pathways, as well as components of the MAPK signaling network such as IKBKB, MAPK10, or RAC2.\",\n        \"results\": \"The analysis indicates that transcription factors such as SPI1 are crucial in sarcoma, with its targets significantly dysregulated. Notably, PIK3CG and AKT2, which are part of the PI3K/Akt signaling network, were found to be dysregulated, suggesting their vital role in sarcoma biology.\",\n        \"results original text\": \"SPI1 (a.k.a. PU.1) is the TF whose targets are present in most of the circuits. In particular, it has 41 targets within the signaling circuits whose expression is dysregulated, including PIK3CG and AKT2, central components of the PI3K/Akt signaling network present in various pathways.\"\n    }\n}",
    "Part 5": "{\n    \"Part 5\": \"Differential Signaling\",\n    \"introductory paragraph\": \"This section outlines the methodology employed to assess the differential signaling activities across various sarcoma subtypes compared to non-diseased sarcomagenic tissues. The objective is to identify distinct signaling circuits that contribute to tumor biology and patient outcomes, thus providing insights into potential therapeutic targets.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Comparison of signaling activities: \\n\\u2460 The study analyzed the signaling activities of each sarcoma subtype utilizing RNA-Seq data from the Cancer Genome Atlas (TCGA) Sarcoma project and non-diseased sarcomagenic tissues from the Genotype-Tissue Expression (GTEx) project. \\n\\u2461 This analysis involved assessing the signaling circuit activities using mechanistic modeling implemented in the HiPathia application, which recoded gene expression values into the activity of signaling pathways defined in the Kyoto Encyclopedia of Genes and Genomes (KEGG). \\n\\u2462 Key parameters for the mechanistic modeling included specific algorithms such as [insert specific algorithms used] and the settings for signal transduction equations, establishing a direct link between gene expression levels and circuit activation. \\n\\u2463 The findings highlight specific signaling pathways and circuits that are differentially activated in sarcoma subtypes compared to normal tissues, emphasizing their distinct roles in tumor biology. \\n\\u2464 Additionally, TMM normalization was applied to the downloaded gene read counts to adjust for compositional biases in RNA-Seq data, ensuring accurate downstream analysis.\",\n        \"original text\": \"To assess the altered cellular functions of sarcoma, the signaling activities of each sarcoma subtype were contrasted with those of their putative sarcomagenic normal tissues.\",\n        \"results\": \"The signaling activities of each sarcoma subtype were contrasted with non-diseased sarcomagenic tissues, revealing both common and unique signaling circuit activations across the subtypes.\",\n        \"results original text\": \"Functional annotation of the circuits that are dysregulated by each sarcoma subtype primarily highlights DNA replication, apoptotic processes, responses to cytokines, and Fc-receptor signaling.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Identification of unique signaling circuits: \\n\\u2460 The signaling circuits that were differentially activated in each sarcoma subtype were identified through mechanistic modeling using the HiPathia application. \\n\\u2461 The analysis included a total of 78 physiological signaling pathways, within which 1098 signaling circuits were identified. This involved preprocessing the downloaded gene read counts and estimating activity values with HiPathia. \\n\\u2462 Specific genes involved in the identified circuits were extracted, and their functional relevance to tumor progression and patient outcomes was assessed through exploratory analysis techniques like t-SNE clustering, which allows visualization of high-dimensional data.\",\n        \"original text\": \"In addition to some common deregulated signaling circuits, each sarcoma subtype also exhibited its own unique set of deregulated circuits.\",\n        \"results\": \"The analysis identified 13 signaling circuits significantly associated with sarcoma patient survival and additional unique circuits specific to each subtype.\",\n        \"results original text\": \"These results describe the protective role of the immune system, suggesting an anti-tumorigenic effect in the tumor microenvironment, in the process of tumor cell detachment and migration, or the dysregulation of ion homeostasis.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Functional annotation of circuits: \\n\\u2460 The circuits that were found to be differentially activated were functionally annotated to determine their roles in cancer hallmarks using the Cancer Hallmarks Analytics Tool (CHAT). \\n\\u2461 The functional analysis included assessing how these circuits contribute to pathways related to cellular energetics, invasion/metastasis, and immune system evasion. \\n\\u2462 A radar plot was created to visualize the distribution of cancer hallmarks across the different signaling circuits, highlighting significant circuits for their potential therapeutic implications. \\n\\u2463 The analysis also included enrichment of Gene Ontology terms on the effector genes of the circuits to provide further insights into their biological functions.\",\n        \"original text\": \"Differentially activated signaling circuits were associated with hallmarks of cancer using CHAT.\",\n        \"results\": \"Functional annotation revealed that the most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and the avoidance of the immune system.\",\n        \"results original text\": \"The most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and the avoidance of the immune system.\"\n    }\n}",
    "Part 6": "{\n    \"Part 6\": \"Cancer Hallmarks\",\n    \"introduction\": \"This section outlines the protocol for assessing the association between differentially activated circuits in soft tissue sarcoma and established cancer hallmarks. The methodology involves utilizing the CHAT tool for classification and subsequent visualization through radar plots to enhance understanding of tumor biology and patient outcomes.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Assessment of the association between differentially activated circuits and cancer hallmarks:\\n\\u2460 Utilize the CHAT tool to classify the abundance of dysregulated signaling circuits across various sarcoma subtypes according to established cancer hallmarks.\\n   - Specify the parameters used in the CHAT tool, such as a CHAT value cutoff of 0.15, corresponding to a 95% percentile based on previous studies.\\n   - Ensure to use RNA-Seq data sourced from the Recount3 resource and consider the specific sarcoma subtypes included in the analysis.\\n\\u2461 Evaluate the association of these circuits with specific hallmarks such as cellular energetics, invasion/metastasis, and immune system avoidance, determining their relevance to tumor biology. Clearly define how these hallmarks are quantified and their significance in the context of tumor progression, referencing the signaling circuits associated with each hallmark. For instance, cellular energetics could be quantified by measuring the upregulation of glycolytic enzymes in tumor samples compared to normal tissues.\",\n        \"original text\": \"Differentially activated signaling circuits were associated with hallmarks of cancer using CHAT. With this classification, the abundance of such hallmarks on the dysregulated circuits for each sarcoma subtype was assessed. The most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and the avoidance of the immune system.\",\n        \"results\": \"The analysis revealed that the most frequently dysregulated processes across the sarcoma subtypes were indeed related to cellular energetics, invasion/metastasis, and immune system avoidance, aligning with the established cancer hallmarks.\",\n        \"results original text\": \"The most frequently dysregulated processes are related to cellular energetics, invasion/metastasis, and the avoidance of the immune system.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Visualization of Hallmarks:\\n\\u2460 Generate radar plots using the distribution of cancer hallmarks across the sets of differentially activated circuits for each sarcoma subtype. Ensure that the radar plots accurately reflect the abundance of each hallmark based on the results from the CHAT tool.\\n   - Include a legend or key that explains the meaning of varying sizes or colors in the radar plots, indicating activity levels or associations with patient outcomes. For example, larger areas in the radar plot could represent higher activity levels of a hallmark, while color gradients could indicate patient survival correlations.\\n\\u2461 Summarize the findings in a comprehensive format, including any statistical analyses performed to support these findings. Link the visual data back to specific circuits and their implications for tumor biology and patient prognosis, highlighting how the analysis contributes to understanding sarcoma biology.\",\n        \"original text\": \"In consonance with the observed hallmarks, various sarcoma subtypes commonly exhibit dysregulation in processes related to the immune system, including Fc gamma R-mediated phagocytosis. Additionally, they demonstrate dysregulation in metabolic pathways like the adipocytokine signaling pathway and processes related to cell motility, such as the focal adhesion pathway.\",\n        \"results\": \"The radar plots generated from the CHAT tool data illustrated the abundance of cancer hallmarks across the sarcoma subtypes, highlighting significant dysregulations in immune-related processes, metabolic pathways, and cell motility circuits. The visualizations provided a clear representation of the differences among subtypes and their potential implications for prognosis.\",\n        \"results original text\": \"Various sarcoma subtypes commonly exhibit dysregulation in processes related to the immune system, including Fc gamma R-mediated phagocytosis. Additionally, they demonstrate dysregulation in metabolic pathways like the adipocytokine signaling pathway and processes related to cell motility, such as the focal adhesion pathway.\"\n    }\n}",
    "Part 7": "{\n    \"Part 7\": \"Data Download and Pre-processing\",\n    \"introduction\": \"This section outlines the procedures for downloading and preprocessing gene expression data for tumor and normal tissue samples, which is crucial for the subsequent analysis of signaling pathways in soft tissue sarcoma. Proper data handling ensures that the analysis reflects the underlying biological processes accurately and contributes to the overall objectives of the study.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Downloading raw gene counts:\\n\\u2460 The authors obtained raw gene counts for tumor and normal tissue samples from the Recount3 R package.\\n\\u2461 The raw reads from multiple sources, including cancer and non-diseased tissues, were uniformly processed using a pipeline employing STAR and Megadepth to align and quantify the reads to the UCSC hg38 assembly. This preprocessing ensures that the data is consistent and reliable for subsequent analysis.\\n\\u2462 Raw gene counts were specifically sourced from the TCGA Sarcoma project and the Genotype-Tissue Expression (GTEx) project, providing a comprehensive dataset for analysis.\",\n        \"original text\": \"Raw gene counts for tumor and normal tissue samples were obtained from the recount3 R package [33]. Recount3 provides RNA-Seq dataset counts where raw reads from multiple sources, including cancer and non-diseased tissues generated by the TCGA and the Genotype-Tissue Expression Project (GTEx), respectively, were uniformly processed with a pipeline using STAR [34] and Megadepth [35] to align and quantify the reads to the UCSC hg38 assembly.\",\n        \"results\": \"Selected data from GTEx tissues and the SARC project were downloaded. Samples from GTEx on putative sarcomagenic tissues of mesenchymal origin were: 1293 adipose, 520 fibroblasts, 881 skeletal muscle, 553 esophagus muscularis, 384 stomach, 159 uterus, and 946 vessels. From TCGA, the 206 sarcoma samples include 7 subtypes: 50 dedifferentiated liposarcomas (DDLPS), 80 leiomyosarcomas (divided into 53 soft tissue STLMS and 27 uterine ULMS), 5 malignant peripheral nerve sheath tumors (MPNST), 17 myxofibrosarcomas (MFS), 10 synovial sarcomas (SS), and 44 undifferentiated pleomorphic sarcoma (UPS).\",\n        \"results original text\": \"Selected data from GTEx tissues and the SARC project were downloaded. Samples from GTEx on putative sarcomagenic tissues of mesenchymal origin were: 1293 adipose, 520 fibroblasts, 881 skeletal muscle, 553 esophagus muscularis, 384 stomach, 159 uterus, and 946 vessels. From TCGA, the 206 sarcoma samples include 7 subtypes: 50 dedifferentiated liposarcomas (DDLPS), 80 leiomyosarcomas (divided into 53 soft tissue STLMS and 27 uterine ULMS), 5 malignant peripheral nerve sheath tumors (MPNST), 17 myxofibrosarcomas (MFS), 10 synovial sarcomas (SS), and 44 undifferentiated pleomorphic sarcoma (UPS).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Processing TCGA SARC project data:\\n\\u2460 Tumor samples were sourced from the SARC project belonging to the TCGA consortium.\\n\\u2461 Selected normal samples were downloaded from multiple tissue projects of the GTEx consortium, specifically focusing on putative sarcomagenic tissues of mesenchymal origin to ensure relevance to soft tissue sarcoma research.\",\n        \"original text\": \"Tumor samples were obtained from the SARC project, belonging to the TCGA consortium, while normal samples were downloaded from multiple tissue projects of the GTEx consortium [36] and further selected for specific tissue site details (Table 4).\",\n        \"results\": \"Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values, indicating that this method preserves the biological information of samples.\",\n        \"results original text\": \"Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values (see Figure 1), indicating that this method preserves the biological information of samples.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Data preprocessing:\\n\\u2460 Low-quality and non-primary tumor samples from the sarcoma project were filtered out based on specific quality metrics, including read depth and mapping quality.\\n\\u2461 The subtype classification was modified according to expert pathology reviews, ensuring accurate representation of the samples.\\n\\u2462 The genomic features were mapped to an Entrez ID using the org.Hs.eg.db Bioconductor package v3.12.0.\\n\\u2463 The downloaded raw counts for all samples were normalized using the Trimmed Mean of M-values (TMM) method as implemented in the edgeR package, with specific parameters to handle lowly expressed genes.\\n\\u2464 Normalized counts in the log scale were obtained using the voom function provided in the limma package, which models the mean\\u2013variance relationship of normalized values with precision weights suitable for the analysis of differential gene expression. This processed data will be utilized in subsequent signaling pathway analysis.\",\n        \"original text\": \"Low-quality and non-primary tumor samples from the sarcoma project were filtered out. The subtype classification was modified according to previous expert pathology reviews [37]. We kept genomic features mapped to an Entrez ID on the org.Hs.eg.db Bioconductor package v3.12.0 [38]. The downloaded raw counts for all samples were normalized using the Trimmed Mean of M-values (TMM) method [39], as implemented in the edgeR package [40] version 3.32.1, which computes scaling factors assuming that most genes are not differentially expressed. Normalized counts in the log scale were obtained with the voom function provided in the limma package version 3.46.0 [41], which also models the mean\\u2013variance relationship of normalized values with precision weights suitable for the analysis of differential gene expression.\",\n        \"results\": \"Data exploration by dimensionality reduction with t-SNE and clustering showed a strong correlation of samples by the project, indicating that the processed data is suitable for further analysis.\",\n        \"results original text\": \"Data exploration by dimensionality reduction with t-SNE and clustering showed a strong correlation of samples by the project (Figure S1), indicating that the processed data is suitable for further analysis.\"\n    }\n}",
    "Part 8": "{\n    \"Part 8\": \"Mechanistic Modeling of Signal Transduction\",\n    \"introduction\": {\n        \"implementation details\": \"This section outlines the mechanistic modeling procedures employed to analyze signal transduction pathways in soft tissue sarcoma. The modeling aims to establish a link between gene expression variations and cellular outcomes, ultimately contributing to understanding tumor biology and predicting patient survival.\",\n        \"original text\": \"\",\n        \"results\": \"\",\n        \"results original text\": \"\"\n    },\n    \"step 1\": {\n        \"implementation details\": \"I. Mechanistic Model Setup:\\n\\u2460 The mechanistic model is designed to replicate the dynamics of signaling circuits defined within physiological pathways. \\n\\u2461 Each signaling circuit is represented as a directed graph, establishing connections from receptor proteins to effector proteins through a series of activations and inhibitions mediated by intermediate proteins.\\n\\u2462 Gene expression levels are sourced from the Recount3 resource, specifically from RNA-Seq counts of sarcoma samples obtained from The Cancer Genome Atlas (TCGA) Sarcoma project and non-diseased sarcomagenic tissues from the Genotype-Tissue Expression (GTEx) project. \\n\\u2463 The model considers gene expression levels as proxies for the activity of their corresponding proteins, establishing a causal link between gene activity and cellular outcomes.\",\n        \"original text\": \"The mechanistic model replicates the dynamics of the signaling circuits defined within pathways. These circuits are depicted as directed graphs, establishing connections from receptor to effector proteins through a series of activations and inhibitions mediated by intermediate proteins. Ultimately, effector proteins at the end of these circuits initiate distinct cellular functions. Malfunctions of these circuits can trigger cancer hallmarks in neoplastic cells.\",\n        \"results\": \"A total of 1098 signaling circuits were identified by HiPathia within the 78 physiological KEGG pathways.\",\n        \"results original text\": \"HiPathia, an application that implements mechanistic models to recode gene expression values into the activity of signaling pathways, defined in the Kyoto Encyclopedia of Genes and Genomes (KEGG) in the pathways repository, was used. A total of 1098 signaling circuits were identified by HiPathia within the 78 physiological KEGG pathways.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Signal Intensity Calculation:\\n\\u2460 The signal intensity for each node in the circuit is calculated using a recursive rule based on the normalized gene expression values and the activation/inhibition signals from connected nodes.\\n\\u2461 Missing data is handled by employing imputation methods based on the average expression levels from the dataset, ensuring robustness in the analysis. Specific parameters for signal intensity calculation must be documented to ensure reproducibility.\",\n        \"original text\": \"For a circuit to become active and effectively transmit the signal triggering a specific function, it necessitates the concurrent presence of the entire chain of proteins connecting the receptor to the effector while ensuring the absence of inhibitory proteins that might impede signal propagation along the circuit.\",\n        \"results\": \"Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values, indicating that this method preserves the biological information of samples.\",\n        \"results original text\": \"Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values, indicating that this method preserves the biological information of samples.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Pathway Activity Calculation:\\n\\u2460 Prior to calculating pathway activity, normalized gene expression values are rescaled to the range of 0\\u20131 using the function normalize_data from the HiPathia package.\\n\\u2461 HiPathia is employed to transform gene expression data into the activity of signaling pathways, defining individual circuits that drive specific cellular functions. Outputs from HiPathia should be interpreted with regard to their biological significance in tumor biology.\\n\\u2462 Activity values are visualized using dimensionality reduction techniques like t-SNE and heatmaps, facilitating the exploration of high-dimensional data. Ensure to specify the settings used for t-SNE and any thresholds applied in heatmap generation.\",\n        \"original text\": \"Prior to pathway activity computation, normalized values were rescaled to the range 0\\u20131 using the function normalize_data from the package HiPathia. HiPathia (HIgh throughput PATHway Interpretation and Analysis) is designed to transform gene count data into the activity of signaling pathways divided into single-effector circuits that drive specific cell functions.\",\n        \"results\": \"Dimensionality reduction by t-SNE and clustering showed a strong correlation of samples by the project, indicating effective representation of high-dimensional data.\",\n        \"results original text\": \"Data exploration by dimensionality reduction with t-SNE and clustering showed a strong correlation of samples by the project.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Survival Analysis Integration:\\n\\u2460 Cox proportional hazards models are used to explore the association between the activation of signaling circuits and patient survival. Specific parameters for the Cox model should be documented. Kaplan\\u2013Meier survival curves are generated based on circuit activity levels, allowing for the visualization of survival outcomes associated with specific signaling activities. This analysis provides insights into the potential prognostic value of the identified circuits.\",\n        \"original text\": \"Survival analysis was performed on sarcoma samples using the survival R package. From this package, Cox proportional hazards regression models were computed to estimate differences in patient survival in association with circuit activity or gene expression values.\",\n        \"results\": \"Thirteen signaling circuits significantly associated with sarcoma patient survival were found, including circuits from well-known tumorigenesis drivers.\",\n        \"results original text\": \"Thirteen signaling circuits significantly associated with sarcoma patient survival were found.\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Differential Expression and Activity Analysis:\\n\\u2460 Differential comparisons between sarcoma subtypes and normal tissues are conducted using the limma package, which applies linear model fitting and empirical Bayes methods to identify differentially expressed genes and activated circuits. The model matrix includes the tissue categories (sarcoma subtypes and normal tissues) and the tissue source site (centers where samples were collected) for correction as a batch effect. Specific thresholds for significance must be defined. The results from this analysis provide insights into the signaling pathways that are specifically altered in each sarcoma subtype compared to normal tissues, highlighting potential therapeutic targets.\",\n        \"original text\": \"For differential comparisons between sarcoma subtypes and normal tissues of both normalized expression and activity values, limma was used. Limma pipeline consists of linear model fitting followed by standard error moderation with an empirical Bayes method.\",\n        \"results\": \"Differential signaling activities highlighted unique sets of circuits that are altered in each sarcoma subtype compared to normal tissues.\",\n        \"results original text\": \"The signaling activities of each sarcoma subtype were contrasted with those of their putative sarcomagenic normal tissues.\"\n    }\n}",
    "Part 9": "{\n    \"Part 9\": \"Pathway Activity Calculation\",\n    \"introduction\": {\n        \"implementation details\": \"This section outlines the methods used to calculate and visualize the activity of signaling pathways in soft tissue sarcoma. Understanding pathway activity is crucial for identifying potential therapeutic targets and assessing their implications for patient survival.\",\n        \"original text\": \"\",\n        \"results\": \"\",\n        \"results original text\": \"\"\n    },\n    \"step 1\": {\n        \"implementation details\": \"I. Calculation of Pathway Activity:\\n\\u2460 Normalization of Gene Expression Values:\\n   - Prior to pathway activity computation, normalized gene expression values are rescaled to the range 0\\u20131 using the function normalize_data from the HiPathia 2.6.0 package.\\n\\u2461 Data Preparation:\\n   - Downloaded raw gene counts for tumor and normal tissue samples were obtained from the recount3 R package, which provides RNA-Seq dataset counts.\\n   - The dataset includes data from the TCGA SARC project (tumor samples) and the Genotype-Tissue Expression (GTEx) project (normal samples).\\n\\u2462 Pathway Definition and Activity Calculation:\\n   - HiPathia (HIgh throughput PATHway Interpretation and Analysis) transforms gene count data into the activity of signaling pathways divided into single-effector circuits that drive specific cell functions.\\n   - Human physiological pathways are provided to the hipathia function.\\n   - The function normalize_paths accounts for the length of the circuits in the activity calculation.\\n   - Ensure that all gene expression values are accurately represented as proxies for protein abundance to reflect their actual signaling activity. For further details, refer to the HiPathia documentation (https://bioconductor.org/packages/release/bioc/html/hipathia.html).\",\n        \"original text\": \"Prior to pathway activity computation, normalized values were rescaled to the range 0\\u20131 using the function normalize_data from the package HiPathia 2.6.0. HiPathia (HIgh throughput PATHway Interpretation and Analysis) is designed to transform gene count data into the activity of signaling pathways divided into single-effector circuits that drive specific cell functions. For this analysis, a total of 78 physiological signaling pathways were selected. Within these pathways, only 13 genes (0.5% of the total number of genes) were found to have missing expression values. For these few specific cases, the values are imputed based on the average expression of the dataset. HiPathia defines individual signaling circuits within the pathways to individualize functional activities. Each circuit is composed of nodes connected by activating or inhibiting relationships and ends in a single effector node, which is responsible for the cellular functions triggered by the circuit.\",\n        \"results\": \"A total of 1098 signaling circuits were identified by HiPathia within the 78 physiological KEGG pathways. The exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values, indicating that this method preserves the biological information of samples.\",\n        \"results original text\": \"A total of 1098 signaling circuits were identified by HiPathia within the 78 physiological KEGG pathways. Exploration of sample clustering with either t-SNE or a heatmap did not reveal significant differences compared to sample distances using expression values, indicating that this method preserves the biological information of samples.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Visualization of Pathway Activity:\\n\\u2460 Visualization Techniques:\\n   - Visualization of normalized counts and activity values is performed using the t-distributed stochastic neighbor embedding method (t-SNE) for high-dimensional data visualization. Use the function provided in the package Rtsne for this step. Refer to the Rtsne package documentation for detailed settings (https://cran.r-project.org/package=Rtsne).\\n\\u2461 Heatmap Generation:\\n   - Create heatmaps using the pheatmap package for sample clustering, employing complete clustering methods and utilizing euclidean distance for features and correlation for samples. Ensure that the heatmaps accurately reflect the relationships in the dataset.\\n\\u2462 Data Interpretation:\\n   - Ensure that the visualizations appropriately represent the underlying biological data and facilitate interpretation of results by highlighting key patterns and relationships. Discuss expected outcomes from these visualizations in the context of potential therapeutic implications.\",\n        \"original text\": \"Visualization of normalized counts and activity values was performed using the t-distributed stochastic neighbor embedding method (t-SNE) for visualization of the structure of high-dimensional data using the function provided in the package Rtsne, as well as on heatmaps using the pheatmap package with the complete clustering method and, as distance measures, euclidean for features and correlation for samples.\",\n        \"results\": \"t-SNE analysis indicated strong correlation of samples by the project, clustering most LMS samples. Heatmap visualizations confirmed clustering patterns consistent with expected biological relationships.\",\n        \"results original text\": \"t-SNE analysis indicated strong correlation of samples by the project, clustering most LMS samples. Heatmap visualizations confirmed clustering patterns consistent with expected biological relationships.\"\n    }\n}"
}