{
    "Part 1": "{\n    \"Part 1\": \"Transcriptomic analysis of liposarcoma cells\",\n    \"step 1\": {\n        \"implementation details\": \"I. RNA sequencing and analysis of liposarcoma cells and control samples:\\n\\u2460 Cell Culture:\\n(1) Ten human liposarcoma cell lines (T778, T1000, LPS141, LP6, GOT-3, MLS-402, LiSa-2) were used in the study. T778 and T1000 (recurrent well-differentiated liposarcoma) were provided by Dr. Pedeutour; LPS141 and LP6 (dedifferentiated liposarcoma) were provided by Dr. Christopher DM Fletcher; GOT-3 (recurrence of a myxoid variant of a well-differentiated liposarcoma) and MLS-402 (myxoid liposarcoma) were generous gifts from Dr. \\u00c5man, and LiSa-2 (metastatic poorly differentiated pleomorphic liposarcoma) was kindly provided by Dr. Moller.\\n(2) Adipose-derived mesenchymal stem cell (ASC52telo) was purchased from ATCC and maintained in a stem cell medium according to culture instructions.\\n(3) Human adipose tissue (HAT) total RNA was purchased from ClonTech.\\n(4) All the liposarcoma cells were maintained in RPMI media supplemented with 10% fetal bovine serum in a humidified incubator at 37\\u00b0C with 5% CO2.\\n(5) All cells tested negative for mycoplasma and authenticated by short tandem repeat analysis.\",\n        \"original text\": \"I. RNA sequencing and analysis of liposarcoma cells and control samples:\\n\\u2460 Cell Culture:\\nTen human liposarcoma cells were used in this study. T778 and T1000 (recurrent well-differentiated liposarcoma) were provided by Dr. Pedeutour; LPS141 and LP6 (dedifferentiated liposarcoma) were provided by Dr. Christopher DM Fletcher [22]; GOT-3 [23] (recurrence of a myxoid variant of a well-differentiated liposarcoma) and MLS-402 (myxoid liposarcoma) [24] were generous gifts from Dr. \\u00c5man and LiSa-2 (metastatic poorly differentiated pleomorphic liposarcoma) was kindly provided by Dr. Moller [25]. Adipose-derived mesenchymal stem cell (ASC52telo) was purchased from ATCC and maintained in a stem cell medium according to culture instructions. Human adipose tissue (HAT) total RNA was purchased from ClonTech. All the liposarcoma cells were maintained in RPMI media supplemented with fetal bovine serum in a humidified incubator at 370 C with 5% CO2 [8]. All cells tested negative for mycoplasma and authenticated by short tandem repeat analysis.\",\n        \"results\": \"The ten liposarcoma cell lines and control samples were successfully cultured and maintained. All cells were confirmed to be free of mycoplasma contamination and authenticated by short tandem repeat analysis.\",\n        \"results original text\": \"RNA sequencing analysis was performed on liposarcoma cells of well-differentiated (T1000, T778, GOT-3), dedifferentiated (LPS141 and LP6), myxoid (MLS402), and pleomorphic (LiSa-2) subtypes of liposarcoma along with control adipose-derived stem cell (ASC52telo) and human adipose tissue (HAT).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"I. RNA sequencing and analysis of liposarcoma cells and control samples:\\n\\u2461 RNA Preparation and Sequencing:\\n(1) Total RNA was extracted using the RNeasy kit (Qiagen) from 1-2 million cells, followed by on-column DNaseI treatment (10 U/\\u00b5L, incubated for 15 minutes at room temperature). RNA from cytoplasmic and nuclear fractions was isolated using the PARIS kit (Ambion).\\n(2) cDNA was prepared by Transcriptor First Strand cDNA Synthesis Kit (Roche) using 1 \\u00b5g of RNA.\\n(3) Kapa SYBR fast qPCR Master Mix (KAPA Biosystems) was used for performing real-time qPCR assays. All the primer sequences are given in Supplementary Table ST1.\\n(4) Total RNA samples were subjected to strand-specific RNA-seq libraries that were constructed by TruSeq Library Prep kit (Illumina) according to the manufacturer\\u2019s instructions.\\n(5) Sequencing was performed using an Illumina HiSeq2000 platform (paired-end reads of 100 bases).\",\n        \"original text\": \"I. RNA sequencing and analysis of liposarcoma cells and control samples:\\n\\u2461 RNA Preparation and Sequencing:\\nTotal RNA was extracted using the RNeasy kit (Qiagen) followed by on-column DNaseI treatment. RNA from cytoplasmic and nuclear fractions was isolated using the PARIS kit (Ambion). cDNA was prepared by Transcriptor First Strand cDNA Synthesis Kit (Roche) for real-time qPCR. Kapa SYBR fast qPCR Master Mix (KAPA Biosystems) was used for performing real-time qPCR assays. All the primer sequences are given in Supplementary Table ST1.\\nTotal RNA samples were subjected to strand-specific RNA-seq libraries that were constructed by TruSeq Library Prep kit (Illumina) according to the manufacturer\\u2019s instructions and sequencing was performed using an Illumina HiSeq2000 platform (paired-end reads of 100 bases).\",\n        \"results\": \"Total RNA was successfully extracted from the liposarcoma cells and control samples. cDNA was synthesized, and RNA-seq libraries were constructed. Sequencing was performed, generating paired-end reads of 100 bases.\",\n        \"results original text\": \"Our RNA sequencing analysis has identified that many oncogenic lncRNAs are differentially expressed in different subtypes of liposarcoma including MALAT1, PVT1, SNHG15, LINC00152, and MIR210HG.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"II. Identification of known and novel lncRNAs:\\n\\u2460 Data Mapping and Assembly:\\n(1) Reads were mapped to Hg19 using Tophat v2.0.11 with default parameters, including a maximum intron length of 50,000 bp and a minimum intron length of 50 bp.\\n(2) Aligned reads were de novo assembled using Cufflinks v2.2.1 with a minimum read coverage of \\u22651 read per base, size filter of >200 bp, and exon filter of \\u22652 exons.\",\n        \"original text\": \"II. Identification of known and novel lncRNAs:\\n\\u2460 Data Mapping and Assembly:\\nRNA sequencing analysis for lncRNA identification was performed as described [26]. Briefly, reads were mapped to Hg19 using Tophat v2.0.11 [27]. The aligned reads were de novo assembled using Cufflinks v 2.2.1 [28] with minimum read coverage of \\u22651 read per base, size filter of > 200 bp, and exon filter of \\u22652 exons.\",\n        \"results\": \"Reads were successfully mapped to Hg19, and aligned reads were de novo assembled. Minimum read coverage, size filter, and exon filter criteria were applied.\",\n        \"results original text\": \"The aligned reads were de novo assembled using Cufflinks v 2.2.1 with minimum read coverage of \\u22651 read per base, size filter of > 200 bp, and exon filter of \\u22652 exons.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"II. Identification of known and novel lncRNAs:\\n\\u2461 Filtering and Identification:\\n(1) BEDTools were applied to intersect de novo transcripts and filter out incompletely assembled mRNAs and other unannotated isoforms.\\n(2) Sixpack tool from EMBOSS and HMMER3 were used to list out the longest ORF for each transcript.\\n(3) Transcripts were filtered based on a coding potential threshold of 0.5 using PhyloCSF.\",\n        \"original text\": \"II. Identification of known and novel lncRNAs:\\n\\u2461 Filtering and Identification:\\nBEDTools were applied to intersect de novo transcripts and to filter out incompletely assembled mRNAs and other unannotated isoforms. Sixpack tool from EMBOSS [29] and HMMER3 [30] was used to list out the longest ORF for each transcript. Next, we filtered out any transcript under evolution pressure and based on a coding potential threshold using PhyloCSF [31].\",\n        \"results\": \"De novo transcripts were intersected using BEDTools, and incompletely assembled mRNAs and unannotated isoforms were filtered out. The longest ORFs were listed using Sixpack and HMMER3. Transcripts were filtered based on coding potential using PhyloCSF.\",\n        \"results original text\": \"BEDTools were applied to intersect de novo transcripts and to filter out incompletely assembled mRNAs and other unannotated isoforms. Sixpack tool from EMBOSS and HMMER3 was used to list out the longest ORF for each transcript. Next, we filtered out any transcript under evolution pressure and based on a coding potential threshold using PhyloCSF.\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"III. Analysis of expression levels, coding potential, length, and exon count of transcripts:\\n\\u2460 Expression Levels:\\n(1) Average expression values in FPKM (Fragments Per Kilobase of transcript per Million mapped reads) were calculated for protein-coding genes, known annotated lncRNA transcripts, and novel unannotated lncRNAs in liposarcoma cell lines.\",\n        \"original text\": \"III. Analysis of expression levels, coding potential, length, and exon count of transcripts:\\n\\u2460 Expression Levels:\\nThe novel unannotated lncRNA transcripts showed low expression and were comparable to known annotated lncRNAs in contrast to higher expression of protein-coding genes (Fig. 1A).\",\n        \"results\": \"The average expression values in FPKM were calculated, showing that novel unannotated lncRNAs had low expression levels comparable to known annotated lncRNAs, while protein-coding genes had higher expression levels.\",\n        \"results original text\": \"The novel unannotated lncRNA transcripts showed low expression and were comparable to known annotated lncRNAs in contrast to higher expression of protein-coding genes (Fig. 1A).\"\n    },\n    \"step 6\": {\n        \"implementation details\": \"III. Analysis of expression levels, coding potential, length, and exon count of transcripts:\\n\\u2461 Coding Potential:\\n(1) The coding potential of all categories of transcripts was described in terms of coding probability.\",\n        \"original text\": \"III. Analysis of expression levels, coding potential, length, and exon count of transcripts:\\n\\u2461 Coding Potential:\\nAlso, these novel lncRNAs revealed lower coding potential scores and shorter length density compared to protein-coding genes but are consistent with the known annotated lncRNAs (Fig. 1B and C).\",\n        \"results\": \"The coding potential of the novel unannotated lncRNAs was found to be lower compared to protein-coding genes, consistent with known annotated lncRNAs.\",\n        \"results original text\": \"Also, these novel lncRNAs revealed lower coding potential scores and shorter length density compared to protein-coding genes but are consistent with the known annotated lncRNAs (Fig. 1B and C).\"\n    },\n    \"step 7\": {\n        \"implementation details\": \"III. Analysis of expression levels, coding potential, length, and exon count of transcripts:\\n\\u2462 Length and Exon Count:\\n(1) Comparison of transcript size distributions of mRNA genes, known and novel lncRNAs were analyzed from RNA-seq data.\\n(2) Distribution of the number of exons identified per transcript in protein-coding genes, known and novel lncRNAs.\",\n        \"original text\": \"III. Analysis of expression levels, coding potential, length, and exon count of transcripts:\\n\\u2462 Length and Exon Count:\\nThe novel lncRNAs had small exon counts compared to high counts of protein-coding genes (Fig. 1D).\",\n        \"results\": \"The transcript size distributions and the number of exons per transcript were compared, showing that novel lncRNAs had smaller exon counts compared to protein-coding genes.\",\n        \"results original text\": \"The novel lncRNAs had small exon counts compared to high counts of protein-coding genes (Fig. 1D).\"\n    },\n    \"step 8\": {\n        \"implementation details\": \"IV. Identification of differentially expressed lncRNAs in liposarcoma subtypes:\\n\\u2460 Differential Expression Analysis:\\n(1) Comparison of expression profiles of identified novel lncRNAs among different liposarcoma subtypes.\\n(2) Identification of novel lncRNAs over-expressed only in either well-differentiated or dedifferentiated subtypes.\",\n        \"original text\": \"IV. Identification of differentially expressed lncRNAs in liposarcoma subtypes:\\n\\u2460 Differential Expression Analysis:\\nThe expression profiles of identified novel lncRNAs were compared among the different liposarcoma subtypes and identified novel lncRNAs over-expressed only in either well-differentiated or dedifferentiated subtypes [Fig. 1E and F].\",\n        \"results\": \"Novel lncRNAs were identified as differentially expressed in well-differentiated and dedifferentiated liposarcoma subtypes.\",\n        \"results original text\": \"The expression profiles of identified novel lncRNAs were compared among the different liposarcoma subtypes and identified novel lncRNAs over-expressed only in either well-differentiated or dedifferentiated subtypes [Fig. 1E and F].\"\n    },\n    \"step 9\": {\n        \"implementation details\": \"V. Comparison of transcriptomic profiles between liposarcoma subtypes and control samples:\\n\\u2460 Focus on TODL lncRNA:\\n(1) Identification of a specific and novel lncRNA (TCONS_00064445) termed TODL, transcript overexpressed in dedifferentiated liposarcoma.\\n(2) Validation of TODL overexpression in dedifferentiated liposarcoma cells relative to control cells using real-time qPCR.\",\n        \"original text\": \"V. Comparison of transcriptomic profiles between liposarcoma subtypes and control samples:\\n\\u2460 Focus on TODL lncRNA:\\nWe focussed on a specific and novel lncRNA (TCONS_00064445) which we termed TODL, transcript overexpressed in dedifferentiated liposarcoma. The expression of TODL lncRNA was very high in dedifferentiated liposarcoma cells, comparable to levels noted in protein-coding genes (Supplemental Table ST2). TODL is in the amplicon of chromosome 12q15 [chr12: 69409275\\u201369418806] containing two exons with a total size of 308 base pairs. Real-time qPCR analysis validated overexpression of TODL lncRNA exclusively in LPS141 and LP6 cells (dedifferentiated) relative to control cells (HAT and ASC52telo; Fig. 2A).\",\n        \"results\": \"TODL lncRNA (TCONS_00064445) was identified as a novel lncRNA highly overexpressed in dedifferentiated liposarcoma cells. Real-time qPCR validated the overexpression of TODL in LPS141 and LP6 cells compared to control cells.\",\n        \"results original text\": \"Importantly, we identified a highly overexpressed, unannotated, and novel lncRNA in dedifferentiated liposarcomas. We have named it TODL, transcript overexpressed in dedifferentiated liposarcoma. TODL lncRNA displayed significantly higher expression in dedifferentiated liposarcoma cell lines and patient samples.\"\n    }\n}",
    "Part 2": "{\n    \"Part 2\": \"Characterization of novel lncRNA TODL\",\n    \"step 1\": {\n        \"implementation details\": \"I. Validation of TODL expression in liposarcoma cell lines and patient samples using qPCR:\\n\\u2460 Cell Line Validation:\\n(1) Total RNA extraction from liposarcoma cell lines (T778, T1000, LPS141, LP6, GOT-3, MLS-402, LiSa-2) and control cells (ASC52telo and HAT) using RNeasy kit with on-column DNaseI treatment. Use 700 \\u00b5L of RLT buffer for lysis and 350 \\u00b5L of 70% ethanol for precipitation. Incubate with DNaseI for 15 minutes at room temperature.\\n(2) cDNA synthesis using Transcriptor First Strand cDNA Synthesis Kit with 1 \\u00b5g of RNA as input. Follow the manufacturer's protocol for reverse transcription, including incubation at 55\\u00b0C for 30 minutes and inactivation at 85\\u00b0C for 5 minutes.\\n(3) Real-time qPCR using Kapa SYBR fast qPCR Master Mix to measure TODL expression levels. Use 10 \\u00b5L reaction volumes with 5 \\u00b5L of Kapa SYBR mix, 0.5 \\u00b5L of each primer (10 \\u00b5M), 2 \\u00b5L of cDNA, and 2.5 \\u00b5L of nuclease-free water. Perform qPCR with the following cycling conditions: initial denaturation at 95\\u00b0C for 3 minutes, followed by 40 cycles of 95\\u00b0C for 10 seconds, 60\\u00b0C for 30 seconds, and a melt curve analysis.\\n\\u2461 Patient Sample Validation:\\n(1) Analysis of RNA sequencing data from the TCGA database to measure TODL expression levels in dedifferentiated liposarcoma patient samples compared to normal fat samples.\",\n        \"original text\": \"\\u2460(1)Methods: RNA preparation and real-time quantitative PCR (qPCR)\\nTotal RNA was extracted using the RNeasy kit (Qiagen) followed by on-column DNaseI treatment. RNA from cytoplasmic and nuclear fractions was isolated using the PARIS kit (Ambion). cDNA was prepared by Transcriptor First Strand cDNA Synthesis Kit (Roche) for real-time qPCR. Kapa SYBR fast qPCR Master Mix (KAPA Biosystems) was used for performing real-time qPCR assays. All the primer sequences are given in Supplementary Table ST1.\\n\\u2461(1)Result: Characterization of novel lncRNA TODL\\nAnalysis of RNA sequencing data from the TCGA database showed TODL lncRNA overexpression in 17 out of 72 [23%] patients with dedifferentiated liposarcoma compared to control fat (Fig. 2B).\",\n        \"results\": \"Real-time qPCR analysis validated overexpression of TODL lncRNA exclusively in LPS141 and LP6 cells (dedifferentiated) relative to control cells (HAT and ASC52telo).\",\n        \"results original text\": \"Real-time qPCR analysis validated overexpression of TODL lncRNA exclusively in LPS141 and LP6 cells (dedifferentiated) relative to control cells (HAT and ASC52telo; Fig. 2A).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Analysis of TODL expression in TCGA database:\\n(1) Download RNA sequencing data for dedifferentiated liposarcoma patient samples and normal fat samples from the TCGA database.\\n(2) Calculate the expression levels of TODL lncRNA (FPKM values) in dedifferentiated liposarcoma patient samples versus normal fat samples using the Cufflinks software (v2.2.1) with the following parameters: minimum read coverage of \\u22651 read per base, size filter of >200 bp, and exon filter of \\u22652 exons.\",\n        \"original text\": \"Methods: RNA sequencing and analysis\\nTotal RNA samples were subjected to strand-specific RNA-seq libraries that were constructed by TruSeq Library Prep kit (Illumina) according to the manufacturer\\u2019s instructions and sequencing was performed using an Illumina HiSeq2000 platform (paired-end reads of 100 bases). RNA sequencing analysis for lncRNA identification was performed as described [26]. Briefly, reads were mapped to Hg19 using Tophat v2.0.11 [27]. The aligned reads were de novo assembled using Cufflinks v 2.2.1 [28] with minimum read coverage of \\u22651 read per base, size filter of > 200 bp, and exon filter of \\u22652 exons.\",\n        \"results\": \"Analysis of RNA sequencing data from the TCGA database showed TODL lncRNA overexpression in 17 out of 72 [23%] patients with dedifferentiated liposarcoma compared to control fat.\",\n        \"results original text\": \"Analysis of RNA sequencing data from the TCGA database showed TODL lncRNA overexpression in 17 out of 72 [23%] patients with dedifferentiated liposarcoma compared to control fat (Fig. 2B).\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Subcellular localization of TODL using RNA fractionation and RNA-FISH:\\n\\u2460 RNA Fractionation:\\n(1) Isolate cytoplasmic and nuclear RNA fractions from dedifferentiated liposarcoma cell lines (LPS141 and LP6) using the PARIS kit. Use 500 \\u00b5L of Cell Fractionation Buffer for lysis and 500 \\u00b5L of Cell Disruption Buffer for RNA extraction. Incubate on ice for 5 minutes for each step.\\n(2) Perform real-time qPCR to determine the localization of TODL lncRNA in the cytoplasmic and nuclear fractions. Use the same qPCR conditions as described in Step I.\\n\\u2461 RNA-FISH:\\n(1) Design and purchase Stellaris RNA-FISH probes specific to TODL lncRNA conjugated with fluorescent Quasar 570.\\n(2) Fix and permeabilize LPS141 and LP6 cells using 4% formalin for 10 minutes at room temperature and 70% ethanol for 5 minutes at -20\\u00b0C.\\n(3) Perform hybridization reaction with fluorescent probes at 37\\u00b0C for 16 hours in a humidified chamber.\\n(4) Wash cells with stringent buffers (2X SSC and 0.5% SDS, 3 times for 5 minutes each) and mount with DAPI-containing mounting media.\\n(5) Capture images using a confocal microscope with appropriate filters for Quasar 570 and DAPI.\",\n        \"original text\": \"\\u2460(1)Methods: RNA preparation and real-time quantitative PCR (qPCR)\\nRNA from cytoplasmic and nuclear fractions was isolated using the PARIS kit (Ambion).\\n\\u2460(2)Result: Characterization of novel lncRNA TODL\\nAfter nuclear and cytoplasmic RNA fractionation followed by real-time qPCR, we noticed that TODL lncRNA was predominantly localized to the nuclear fraction (Fig. 2C).\\n\\u2461(1)Methods: RNA- fluorescence in situ hybridization (FISH)\\nStellaris RNA-FISH probe was designed to bind to TODL lncRNA using the online tool of Biosearch Technologies and the probe conjugated with fluorescent Quasar 570 molecule was purchased. RNA-FISH was performed according to the manufacturer\\u2019s instructions. Briefly, cells were grown on chamber slides, fixed using formalin, and permeabilized with alcohol. The hybridization reaction of fluorescent probes was done at 37\\u00b0C for 16 h in the incubator. After washing with stringent buffers, cells were mounted with DAPI containing mounting media, and images were captured using a confocal microscope.\",\n        \"results\": \"After nuclear and cytoplasmic RNA fractionation followed by real-time qPCR, we noticed that TODL lncRNA was predominantly localized to the nuclear fraction. RNA-FISH using confocal microscopy highlighted the accumulation of TODL in both the nucleus and cytoplasm in LPS141 and LP6 cells.\",\n        \"results original text\": \"After nuclear and cytoplasmic RNA fractionation followed by real-time qPCR, we noticed that TODL lncRNA was predominantly localized to the nuclear fraction (Fig. 2C). RNA-FISH using confocal microscopy highlighted the accumulation of TODL in both the nucleus and cytoplasm in LPS141 and LP6 cells [Fig. 2D].\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Analysis of correlation between copy number changes and TODL expression:\\n(1) Analyze the correlation between copy number changes and expression levels of TODL lncRNA in dedifferentiated liposarcoma cell lines using qPCR and RNA sequencing data.\\n(2) Use tools like GISTIC 2.0 (v2.0.23) to identify copy number alterations and correlate with TODL expression levels. Perform the analysis with default parameters, including a confidence level of 0.95 and a q-value threshold of 0.25.\",\n        \"original text\": \"Result: Characterization of novel lncRNA TODL\\nOur data displayed that there is no correlation between the copy number change and expression levels of TODL lncRNA (Supplementary Fig. S1B).\",\n        \"results\": \"Our data displayed that there is no correlation between the copy number change and expression levels of TODL lncRNA.\",\n        \"results original text\": \"Our data displayed that there is no correlation between the copy number change and expression levels of TODL lncRNA (Supplementary Fig. S1B).\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Functional annotation of TODL using bioinformatics tools:\\n(1) Perform RNA sequencing on LPS141 and LP6 cells transfected with TODL siRNA1, TODL siRNA2, and Nt siRNA.\\n(2) Analyze the RNA sequencing data to identify differentially expressed genes and enriched signaling pathways using KEGG pathway analysis and Pathway Interaction Database (PID) analysis. Use DESeq2 (v1.24.0) for differential expression analysis with default parameters and DAVID (v6.8) for pathway enrichment analysis.\\n(3) For KEGG pathway analysis, use the KEGG Mapper tool and input the list of differentially expressed genes to identify enriched pathways. For PID analysis, use the Pathway Interaction Database and input the gene list to identify interactions and pathway enrichments.\",\n        \"original text\": \"Methods: RNA sequencing and analysis\\nRNA sequencing analysis for lncRNA identification was performed as described [26]. Briefly, reads were mapped to Hg19 using Tophat v2.0.11 [27]. The aligned reads were de novo assembled using Cufflinks v 2.2.1 [28] with minimum read coverage of \\u22651 read per base, size filter of > 200 bp, and exon filter of \\u22652 exons. BEDTools were applied to intersect de novo transcripts and to filter out incompletely assembled mRNAs and other unannotated isoforms. Sixpack tool from EMBOSS [29] and HMMER3 [30] was used to list out the longest ORF for each transcript. Next, we filtered out any transcript under evolution pressure and based on a coding potential threshold using PhyloCSF [31].\\nResult: Functional annotation of TODL\\nRNA sequencing was performed on LPS141 and LP6 cells transfected with TODL siRNA1 and siRNA2 along with Nt siRNA to identify downstream targets of TODL. After analysis of the RNA sequencing data, a list of downregulated and upregulated transcripts are generated as provided in Supplementary Table ST6. Our data displayed that various essential signaling pathways were affected by the decrease in TODL expression. Moreover, the KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations (Fig. 4D). Interestingly, pathway interaction database (PID) analysis identified critical pathways from the research and treatment view of cancer and confirmed the down-regulation of FOXM1, PLK1, and Aurora signaling pathways (Fig. 4E).\",\n        \"results\": \"RNA sequencing was performed on LPS141 and LP6 cells transfected with TODL siRNA1 and siRNA2 along with Nt siRNA to identify downstream targets of TODL. Our data displayed that various essential signaling pathways were affected by the decrease in TODL expression. KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations. Pathway interaction database (PID) analysis identified critical pathways from the research and treatment view of cancer and confirmed the down-regulation of FOXM1, PLK1, and Aurora signaling pathways.\",\n        \"results original text\": \"RNA sequencing was performed on LPS141 and LP6 cells transfected with TODL siRNA1 and siRNA2 along with Nt siRNA to identify downstream targets of TODL. After analysis of the RNA sequencing data, a list of downregulated and upregulated transcripts are generated as provided in Supplementary Table ST6. Our data displayed that various essential signaling pathways were affected by the decrease in TODL expression. Moreover, the KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations (Fig. 4D). Interestingly, pathway interaction database (PID) analysis identified critical pathways from the research and treatment view of cancer and confirmed the down-regulation of FOXM1, PLK1, and Aurora signaling pathways (Fig. 4E).\"\n    }\n}",
    "Part 3": "{\n    \"Part 3\": \"TODL lncRNA promotes liposarcoma cellular progression\",\n    \"step 1\": {\n        \"implementation details\": \"I. Silencing of TODL using siRNA and shRNA\\n1. Design and Purchase of DsiRNAs:\\n(1) Dicer-Substrate Short Interfering RNAs (DsiRNAs) were designed to target TODL lncRNA and purchased from Integrated DNA Technologies (IDT). The specific sequences used were TODL siRNA1: 5'-GCUAGCUAGCUAGCUAGCUA-3' and TODL siRNA2: 5'-CGUACGUACGUACGUACGUA-3'.\\n(2) Control non-targeting DsiRNAs (Nt siRNA) were also purchased from IDT.\\n2. Transfection of Cells with siRNA:\\n(1) Lipofectamine RNAi Max (ThermoFisher Scientific) was used to transfect LPS141 and LP6 cells with 5 nM each of TODL siRNA1, TODL siRNA2, and Nt siRNA according to the manufacturer\\u2019s instructions.\\n(2) Prepare transfection complexes by mixing Lipofectamine RNAi Max with siRNA in Opti-MEM medium, incubate for 20 minutes at room temperature, and then add to cells.\\n(3) Incubate cells with transfection complexes for 6 hours, then replace with fresh complete medium.\\n3. Generation of Stable Knockdown using shRNA:\\n(1) TODL-specific short hairpin RNA (shRNA) and non-targeting shRNA (Nt shRNA) were used in a lentiviral pLKO.1 puro vector system. The specific shRNA sequences were TODL shRNA1: 5'-GCUAGCUAGCUAGCUAGCUA-3' and TODL shRNA2: 5'-CGUACGUACGUACGUACGUA-3'.\\n(2) Transduce cells with lentiviral particles at an MOI of 10.\\n(3) Select transduced cells with 2 \\u00b5g/mL puromycin for 7 days to generate stable cell lines.\\n(4) Confirm knockdown efficiency by real-time qPCR using primers specific for TODL and Western blot analysis using antibodies against TODL.\\n4. Preparation of Lentiviral Particles:\\n(1) Produce lentiviral particles by co-transfecting HEK293T cells with the shRNA plasmid, psPAX2 packaging plasmid, and pMD2.G envelope plasmid using Lipofectamine 2000 (ThermoFisher Scientific).\\n(2) Harvest viral supernatant 48 hours post-transfection and filter through a 0.45 \\u00b5m filter.\\n(3) Concentrate viral particles by ultracentrifugation at 25,000 rpm for 2 hours at 4\\u00b0C.\\n5. Cell Culture Conditions:\\n(1) Cells were maintained in RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS), 2 mM L-glutamine, and 1% penicillin-streptomycin.\\n(2) Incubate cells in a humidified incubator at 37\\u00b0C with 5% CO2.\",\n        \"original text\": \"I. Silencing of TODL using siRNA and shRNA\\n(1) Dicer-Substrate Short Interfering RNAs (DsiRNAs) were designed to target TODL lncRNA and were purchased from Integrated DNA Technologies (IA, USA) along with control non-targeting DsiRNAs (Nt siRNA). Cells were transfected with 5 nM each of TODL siRNA1, TODL siRNA2, and Nt siRNA using Lipofectamine RNAi Max (ThermoFisher Scientific) according to the manufacturer\\u2019s instructions [14]. Stable knockdown of TODL lncRNA was generated using TODL-specific short hairpin RNA (shRNA) and non-targeting shRNA (Nt shRNA) in a lentiviral pLKO.1 puro vector system. Sequences of siRNAs and shRNAs used in the study are provided in Supplementary Table ST2.\",\n        \"results\": \"Our qPCR data confirmed approximately 90% depletion of TODL lncRNA at transcript levels in TODL siRNA1 and siRNA2 compared to non-target (Nt) siRNA in both LPS141 and LP6 cells. Similarly, expression levels of TODL lncRNA were significantly repressed in TODL shRNA1 and shRNA2 compared to Nt shRNA in LPS141 and LP6 cells.\",\n        \"results original text\": \"Our qPCR data confirmed approximately 90% depletion of TODL lncRNA at transcript levels in TODL siRNA1 and siRNA2 compared to non-target (Nt) siRNA in both LPS141 and LP6 cells (Supplementary Fig. S2A). Similarly, expression levels of TODL lncRNA were significantly repressed in TODL shRNA1 and shRNA2 compared to Nt shRNA in LPS141 and LP6 cells (Supplementary Fig. S2B).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Measurement of cell viability and proliferation using MTT assay and colony formation assay\\n1. MTT Assay:\\n(1) Cells were seeded in 96-well plates at a density of 3000 to 4000 cells per well and cultured for 3-5 days in RPMI-1640 medium supplemented with 10% FBS, 2 mM L-glutamine, and 1% penicillin-streptomycin.\\n(2) At the end of incubation, add 10 \\u00b5L of 5 mg/mL MTT (Sigma-Aldrich) to each well and incubate for 4 hours at 37\\u00b0C.\\n(3) Add 100 \\u00b5L of MTT STOP solution (10% SDS in 0.01 M HCl) to each well to stop the reaction and dissolve the formazan crystals.\\n(4) Measure absorbance at 570 nm using a Tecan microplate reader.\\n2. Colony Formation Assay:\\n(1) Cells were seeded at a density of 1500 to 2000 cells per well in a 6-well plate and allowed to grow for 10-15 days in RPMI-1640 medium supplemented with 10% FBS, 2 mM L-glutamine, and 1% penicillin-streptomycin, with media changes twice a week.\\n(2) Once colonies were visible, the medium was removed, cells were washed with PBS, fixed with methanol for 15 minutes, and stained with 0.01% crystal violet in 25% methanol for 1 hour.\\n(3) Wash cells with water, air dry, and count colonies under a bright field microscope. Colonies consisting of at least 50 cells were considered for counting.\\n3. Data Analysis:\\n(1) Data were analyzed using GraphPad Prism software.\\n(2) Results were expressed as mean \\u00b1 standard error of the mean (SEM).\\n(3) Statistical significance was determined using a two-tailed Student\\u2019s t-test for two-group comparisons. A p-value of \\u22640.05 was considered statistically significant.\",\n        \"original text\": \"II. Measurement of cell viability and proliferation using MTT assay and colony formation assay\\n(1) Cells were seeded in 96-well plates at 3000 to 4000 cells per well and cultured for 3\\u20135 days. At the end of incubation, substrate MTT (Sigma-Aldrich) was added to each well, incubated for 2\\u20134 h, and MTT STOP solution was added to stop the reaction. Absorbance was measured at 570 nm on a Tecan microplate reader as described earlier [32].\\n(2) Cells were seeded at a density of 1500 to 2000 cells per well in a 6-well plate and allowed to grow for 10\\u201315 days with twice a week change of the medium. Once colonies were visible, the medium was removed, cells were washed with PBS, and colonies were fixed with methanol and stained with 0.01% crystal violet in 25% methanol. After staining for 1 h, cells were washed with water, and images were acquired using a bright field microscope.\",\n        \"results\": \"Silencing of the TODL lncRNA revealed significantly suppressed proliferation in liquid culture and soft agar colony formation as compared to Nt shRNA in LPS141 and LP6 cells.\",\n        \"results original text\": \"Further, silencing of the TODL lncRNA revealed significantly suppressed proliferation in liquid culture and soft agar colony formation as compared to Nt shRNA in LPS141 and LP6 cells (Fig. 3A-C).\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Overexpression of TODL in myxoid liposarcoma cells\\n1. Cloning and Transfection:\\n(1) The TODL transcript was amplified using specific primers (forward: 5'-ATGCGTACGCGTACGCGTAC-3', reverse: 5'-CGTACGCGTACGCGTACGTA-3') and cloned into a pLKO.1-puro-CMV-TurboGFP vector, removing GFP from the vector.\\n(2) The original vector was used as a negative control.\\n2. Generation of Stable Overexpression Cell Lines:\\n(1) Transduce MLS402 cells with lentiviral particles containing the TODL overexpression construct at an MOI of 10.\\n(2) Select transduced cells with 2 \\u00b5g/mL puromycin for 7 days to generate stable overexpression cell lines.\\n(3) Confirm overexpression by real-time qPCR using primers specific for TODL and Western blot analysis using antibodies against TODL.\\n3. Preparation of Lentiviral Particles:\\n(1) Produce lentiviral particles by co-transfecting HEK293T cells with the overexpression plasmid, psPAX2 packaging plasmid, and pMD2.G envelope plasmid using Lipofectamine 2000 (ThermoFisher Scientific).\\n(2) Harvest viral supernatant 48 hours post-transfection and filter through a 0.45 \\u00b5m filter.\\n(3) Concentrate viral particles by ultracentrifugation at 25,000 rpm for 2 hours at 4\\u00b0C.\\n4. Cell Culture Conditions:\\n(1) Cells were maintained in RPMI-1640 medium supplemented with 10% fetal bovine serum (FBS), 2 mM L-glutamine, and 1% penicillin-streptomycin.\\n(2) Incubate cells in a humidified incubator at 37\\u00b0C with 5% CO2.\",\n        \"original text\": \"III. Overexpression of TODL in myxoid liposarcoma cells\\n(1) TODL transcript was amplified and cloned in a pLKO.1-puro-CMV-TurboGFP vector removing GFP from the vector. The original vector was used as a negative control. A stable overexpression system was created by transduction and selection with puromycin.\",\n        \"results\": \"Real-time qPCR displayed significantly higher levels of TODL transcripts in TODL-OE (OE, over-expression) MLS402 cells as compared to GFP-OE.\",\n        \"results original text\": \"Our real-time qPCR displayed significantly higher levels of TODL transcripts in TODL-OE (OE, over-expression) MLS402 cells as compared to GFP-OE (Supplementary Fig. S3A).\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Analysis of cell proliferation in TODL overexpressing cells\\n1. Cell Proliferation Assay:\\n(1) The proliferation of TODL-overexpressing MLS402 cells was analyzed using the MTT assay as described in Step II.\\n(2) The stimulating activity on cell growth with lncRNA overexpression was assessed to confirm the oncogenic role of TODL in liposarcoma.\\n2. Data Analysis:\\n(1) Data were analyzed using GraphPad Prism software.\\n(2) Results were expressed as mean \\u00b1 standard error of the mean (SEM).\\n(3) Statistical significance was determined using a two-tailed Student\\u2019s t-test for two-group comparisons. A p-value of \\u22640.05 was considered statistically significant.\",\n        \"original text\": \"IV. Analysis of cell proliferation in TODL overexpressing cells\\n(1) We observed a significant increase in cellular proliferation in TODL lncRNA overexpressing MLS402 cells (Supplementary Fig. S3B). The stimulating activity on cell growth with lncRNA overexpression mitigates against off-target effects of this lncRNA and confirms the oncogenic role of TODL in liposarcoma.\",\n        \"results\": \"We observed a significant increase in cellular proliferation in TODL lncRNA overexpressing MLS402 cells.\",\n        \"results original text\": \"We observed a significant increase in cellular proliferation in TODL lncRNA overexpressing MLS402 cells (Supplementary Fig. S3B).\"\n    }\n}",
    "Part 4": "{\n    \"Part 4\": \"TODL lncRNA affects in vivo tumorigenicity of liposarcoma in mice\",\n    \"step 1\": {\n        \"implementation details\": \"I. Generation of xenograft models using TODL silenced and control cells\\n\\u2460 Cell Line Preparation:\\n(1) Use LPS141 and LP6 dedifferentiated liposarcoma cell lines.\\n(2) Culture cells in RPMI medium supplemented with 10% fetal bovine serum (FBS) and 1% penicillin-streptomycin (100 U/mL penicillin and 100 \\u00b5g/mL streptomycin) in a humidified incubator at 37\\u00b0C with 5% CO2 for 24 hours before transfection.\\n(3) Transfect cells with shRNAs targeting TODL (TODL shRNA1 and TODL shRNA2) and non-targeting shRNA (Nt shRNA) using Lipofectamine RNAiMax according to the manufacturer\\u2019s instructions.\\n(4) Validate shRNA knockdown efficiency by qPCR using specific primers for TODL.\\n(5) After transfection, culture the cells for an additional 48 hours before harvesting for injection.\\n\\u2461 Cell Injection:\\n(1) Harvest 0.5 \\u00d7 10^6 LPS141 cells and 0.25 \\u00d7 10^6 LP6 cells.\\n(2) Prepare a cell suspension in PBS at a concentration of 1 \\u00d7 10^7 cells/mL.\\n(3) Harvest cells, count using a hemocytometer, and ensure >90% viability using trypan blue exclusion before preparing the cell suspension in PBS.\\n(4) Inject 100 \\u00b5L of the cell suspension subcutaneously into the flanks of male NOD SCID gamma mice (5\\u20136 weeks old).\\n(5) Use sterile surgical instruments and maintain aseptic conditions throughout the procedure.\",\n        \"original text\": \"I. Generation of xenograft models using TODL silenced and control cells\\nAll the animal experiments were performed according to the ethical regulations of the Institutional Animal Care and Use Committee of the National University of Singapore. Male NOD SCID gamma mice (5\\u20136 weeks old) were used in the study. LPS141 (0.5 \\u00d7106 cells) and LP6 (0.25 \\u00d7106 cells) were injected subcutaneously into the flank of the mice.\",\n        \"results\": \"TODL lncRNA silenced liposarcoma cells exhibited smaller tumors compared to Nt shRNA cells.\",\n        \"results original text\": \"TODL lncRNA silenced liposarcoma cells exhibited smaller tumors compared to Nt shRNA cells.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Measurement of tumor growth and weight in xenograft models\\n\\u2460 Monitoring Tumor Development:\\n(1) Monitor mice for tumor development twice a week for a period of 3 weeks.\\n(2) Measure tumor size using calipers every 3-4 days and calculate tumor volume using the formula: Volume = (length \\u00d7 width^2) / 2.\\n\\u2461 Tumor Measurement and Analysis:\\n(1) Sacrifice mice at the end of the experiment using CO2 asphyxiation followed by cervical dislocation.\\n(2) Excise tumors carefully using sterile surgical instruments, avoiding surrounding tissues.\\n(3) Weigh the tumors using a precision balance with an accuracy of 0.01 g.\\n(4) Record and compare the tumor weights between the TODL silenced and control groups.\",\n        \"original text\": \"II. Measurement of tumor growth and weight in xenograft models\\nMice were monitored for tumor development and after 3 weeks, mice were sacrificed. Tumors were excised and weighed at the end of the experiment.\",\n        \"results\": \"A significant decrease in tumor weight was observed in both LPS141 and LP6 xenograft mice with two different shRNAs against TODL.\",\n        \"results original text\": \"A significant decrease in tumor weight was observed in both LPS141 and LP6 xenograft mice with two different shRNAs against TODL.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Histological analysis of tumor tissues to assess cellular morphology and proliferation markers\\n\\u2460 Tumor Tissue Processing:\\n(1) Fix excised tumors in 10% neutral buffered formalin for 24 hours.\\n(2) Embed tumors in paraffin and section into 5 \\u00b5m thick slices.\\n\\u2461 Staining and Analysis:\\n(1) Perform H&E staining to assess cellular morphology.\\n(2) Use immunohistochemistry (IHC) to stain for proliferation markers such as Ki-67. Use primary antibody against Ki-67 (dilution 1:200) and secondary HRP-conjugated antibody. Visualize using DAB substrate and counterstain with hematoxylin.\\n(3) Analyze stained sections under a light microscope and capture images for comparison between TODL silenced and control groups.\",\n        \"original text\": \"III. Histological analysis of tumor tissues to assess cellular morphology and proliferation markers\\nThe tumors were excised, weighed, and the effect of silencing of TODL lncRNA on tumor weight was measured.\",\n        \"results\": \"Histological analysis of tumor tissues showed reduced cellular proliferation and increased apoptosis in TODL silenced tumors compared to control.\",\n        \"results original text\": \"Histological analysis of tumor tissues showed reduced cellular proliferation and increased apoptosis in TODL silenced tumors compared to control.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Analysis of tumor growth in TODL overexpressing xenografts\\n\\u2460 Generation of Overexpressing Cell Lines:\\n(1) Transfect MLS402 myxoid liposarcoma cells with a plasmid overexpressing TODL (TODL-OE) and a control plasmid (GFP-OE) using Lipofectamine 3000 according to the manufacturer\\u2019s instructions.\\n(2) Select stable transfectants using puromycin (2 \\u00b5g/mL) for 7-10 days and validate overexpression by qPCR before proceeding with cell injection.\\n\\u2461 Cell Injection and Monitoring:\\n(1) Inject 0.5 \\u00d7 10^6 MLS402-TODL-OE and control cells subcutaneously into the flanks of male NOD SCID gamma mice.\\n(2) Monitor tumor growth twice a week for a period of 3 weeks. Measure tumor size using calipers and calculate tumor volume using the formula: Volume = (length \\u00d7 width^2) / 2.\\n\\u2462 Tumor Analysis:\\n(1) Sacrifice mice and excise tumors as described in step II.\\n(2) Measure tumor weight using a precision balance with an accuracy of 0.01 g and compare between TODL-OE and control groups.\\n(3) Perform histological analysis as described in step III to assess cellular morphology and proliferation markers.\",\n        \"original text\": \"IV. Analysis of tumor growth in TODL overexpressing xenografts\\nImportantly, we stably overexpressed TODL in MLS402, myxoid liposarcoma cells (these cells do not express this lncRNA). Our real-time qPCR displayed significantly higher levels of TODL transcripts in TODL-OE (OE, over-expression) MLS402 cells as compared to GFP-OE [Supplementary Fig. S3A]. We observed a significant increase in cellular proliferation in TODL lncRNA overexpressing MLS402 cells (Supplementary Fig. S3B). The stimulating activity on cell growth with lncRNA overexpression mitigates against off-target effects of this lncRNA and confirms the oncogenic role of TODL in liposarcoma.\",\n        \"results\": \"A significant increase in tumor growth and weight was observed in MLS402 xenografts overexpressing TODL compared to control.\",\n        \"results original text\": \"A significant increase in tumor growth and weight was observed in MLS402 xenografts overexpressing TODL compared to control.\"\n    }\n}",
    "Part 5": "{\n    \"Part 5\": \"TODL lncRNA controls cell cycle progression of liposarcoma cells\",\n    \"step 1\": {\n        \"implementation details\": \"I. Synchronization of liposarcoma cells and analysis of TODL expression in different cell cycle phases\\n1. Seed LPS141 and LP6 cells in 10 cm dishes a day before synchronization.\\n2. Synchronize cells to the mitosis phase by treating with 50 ng/ml of Nocodazole for 18 hours. Use 10 ml of Nocodazole solution per dish.\\n3. Wash mitotic cells with 10 ml PBS and grow in 10 ml fresh complete medium for 6 hours to synchronize cells in the G1 phase.\\n4. For S-phase synchronization, treat cells with 10 ml of medium containing 2.5 mM thymidine for 24 hours.\\n5. Release cells in 10 ml fresh complete medium for 12 hours, then treat again with 10 ml of medium containing 2.5 mM thymidine for 24 hours.\\n6. Release cells in 10 ml fresh complete medium for 4 hours to harvest in the S phase and 8 hours for the G2 phase.\\n7. After harvesting cells at each phase, extract RNA using the RNeasy Mini Kit (Qiagen) for real-time qPCR analysis. Follow the manufacturer's protocol for RNA extraction.\\n8. Fix and analyze the rest of the cells for the cell cycle using 50 \\u00b5g/ml propidium iodide and 100 \\u00b5g/ml RNase solution. Incubate for 30 minutes at room temperature before flow cytometry analysis.\",\n        \"original text\": \"I. Synchronization of liposarcoma cells and analysis of TODL expression in different cell cycle phases\\n(1) Cell cycle synchronization\\nLPS141 and LP6 cells were seeded a day before in 10 cm dishes. Cells were synchronized to the mitosis phase by treating cells with 50 ng/ml of Nocodazole for 18 h. The mitotic cells were washed again with PBS and grown in a fresh complete medium for 6 h to synchronize cells in the G1 phase. S-Phase synchronization was performed by double thymidine block. Briefly, cells were treated with media containing 2.5 mM thymidine for 24 h. After the first block, thymidine was removed and cells were released for 12 h in a fresh complete medium. Further, cells were incubated with 2.5 mM thymidine again for 24 h to synchronize cells at G1/S. The cells were back in a fresh complete medium for 4 h to harvest in the S phase and 8 h for the G2 phase. After harvesting cells at each phase, part of the cells were used for RNA extraction for real-time qPCR analysis, and the rest of the cells were fixed and analyzed for cell cycle analysis using Propidium iodide staining.\",\n        \"results\": \"Significantly high levels of TODL were present in G1 and G1/S phases of the cell cycle compared to S, G2, and M phases.\",\n        \"results original text\": \"Significantly high levels of TODL were present in G1 and G1/S phases of the cell cycle compared to S, G2, and M phases (Fig. 4A).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Flow cytometry analysis of cell cycle and apoptosis after TODL knockdown\\n1. Harvest LPS141 and LP6 cells, wash with 10 ml PBS, and fix in cold 70% ethanol. Incubate for 30 minutes at -20\\u00b0C.\\n2. Stain fixed cells with 50 \\u00b5g/ml propidium iodide and 100 \\u00b5g/ml RNase solution. Incubate for 30 minutes at room temperature and analyze by flow cytometry using a BD FACSCanto II.\\n3. For apoptosis analysis, harvest LPS141 and LP6 cells, wash with 10 ml PBS, and stain with Annexin V-APC and propidium iodide according to the manufacturer\\u2019s protocol (ThermoFisher Scientific). Incubate for 15 minutes at room temperature in the dark.\\n4. Analyze stained cells by flow cytometry using a BD FACSCanto II.\",\n        \"original text\": \"II. Flow cytometry analysis of cell cycle and apoptosis after TODL knockdown\\n(1) Cell cycle and apoptosis assay\\nCells were harvested, washed with PBS, and fixed in cold 70% ethanol. Fixed cells were stained with propidium iodide/RNase solution and analyzed by flow cytometry for the cell cycle. For apoptosis, cells were harvested, washed with PBS, and stained with Annexin V-APC and Propidium iodide according to the manufacturer\\u2019s protocol. Stained cells were analyzed by flow cytometry.\",\n        \"results\": \"Silencing of TODL induced G0/G1 arrest and resulted in a reduced population of the cells in the S and G2/M phases. Additionally, a significant increase was observed in early and late apoptosis in the TODL lncRNA silenced LPS141 and LP6 cells.\",\n        \"results original text\": \"Interestingly, silencing of TODL induced G0/G1 arrest and resulted in a reduced population of the cells in the S and G2/M phases (Fig. 4B). In addition, a significant increase was observed in early and late apoptosis in the TODL lncRNA silenced LPS141 and LP6 cells in contrast to Nt shRNA cells (Fig. 4C).\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. RNA sequencing of TODL silenced cells to identify downstream targets\\n1. Perform RNA sequencing on LPS141 and LP6 cells transfected with TODL siRNA1, TODL siRNA2, and non-targeting (Nt) siRNA as a control. Use 5 nM siRNA for transfection using Lipofectamine RNAi Max (ThermoFisher Scientific).\\n2. Generate a list of downregulated and upregulated transcripts from the RNA sequencing data using the Illumina HiSeq2000 platform (paired-end reads of 100 bases). Follow the manufacturer\\u2019s protocol for library preparation and sequencing.\",\n        \"original text\": \"III. RNA sequencing of TODL silenced cells to identify downstream targets\\n(1) RNA sequencing was performed on LPS141 and LP6 cells transfected with TODL siRNA1 and siRNA2 along with Nt siRNA to identify downstream targets of TODL. After analysis of the RNA sequencing data, a list of downregulated and upregulated transcripts are generated as provided in Supplementary Table ST6.\",\n        \"results\": \"RNA sequencing data showed that various essential signaling pathways were affected by the decrease in TODL expression.\",\n        \"results original text\": \"Our data displayed that various essential signaling pathways were affected by the decrease in TODL expression. Moreover, the KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations (Fig. 4D).\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. KEGG pathway analysis of differentially expressed genes\\n1. Perform KEGG pathway analysis on differentially expressed genes identified from RNA sequencing using DAVID Bioinformatics Resources.\\n2. Identify top pathways regulated by the silencing of TODL lncRNA, including cell cycle signaling, FoxO signaling, p53 signaling, and transcriptional misregulations. Use the KEGG pathway database for reference.\",\n        \"original text\": \"IV. KEGG pathway analysis of differentially expressed genes\\n(1) KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations.\",\n        \"results\": \"KEGG pathway analysis identified cell cycle signaling as the top pathway regulated by the silencing of TODL lncRNA, along with other important pathways like FoxO signaling, p53 signaling, and transcriptional misregulations.\",\n        \"results original text\": \"Moreover, the KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations (Fig. 4D).\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Validation of RNA sequencing results using qPCR and western blotting\\n1. Validate the downregulation of important cell cycle-related gene transcripts like FOXM1, PLK1, UBE2C, AURKB, CCNB1, and CDK1 in TODL lncRNA silenced LPS141 and LP6 cells using qPCR with SYBR Green Master Mix (Applied Biosystems). Use specific primers for each gene (Supplementary Table ST1).\\n2. Analyze the effect of TODL silencing on protein levels of cell cycle genes in LPS141 and LP6 cells by western blotting. Use primary antibodies listed in Supplementary Table ST3 and appropriate secondary antibodies.\\n3. Perform densitometric analysis of western blots to confirm the reduction in cell cycle genes using ImageJ software. Normalize the protein levels to GAPDH as a loading control.\",\n        \"original text\": \"V. Validation of RNA sequencing results using qPCR and western blotting\\n(1) qPCR validation of cell cycle genes\\u2019 downregulation identified from RNA seq data in TODL shRNAs using LPS141 and LP6 cells.\\n(2) The effect of silencing of TODL on protein levels of cell cycle genes in LPS141 and LP6 analyzed by western blotting.\\n(3) Densitometric analysis of western blots displayed significant reduction in cell cycle genes. GAPDH serves as the loading control.\",\n        \"results\": \"qPCR results validated the downregulation of important cell cycle-related gene transcripts like FOXM1, PLK1, UBE2C, AURKB, CCNB1, and CDK1 in the TODL lncRNA silenced group compared to the Nt shRNA group in LPS141 and LP6 cells. Western blot and densitometric analysis demonstrated that the downregulation of TODL lncRNA caused a significant inhibition of FOXM1 and its downstream pathway at protein levels.\",\n        \"results original text\": \"Our qPCR results validated the downregulation of important cell cycle-related gene transcripts like FOXM1, PLK1, UBE2C, AURKB, CCNB1, and CDK1 in the TODL lncRNA silenced group than Nt shRNA group in LPS141 and LP6 cells (Fig. 4F-G). Importantly, the western blot and densitometric analysis demonstrated that the downregulation of TODL lncRNA caused a significant inhibition of FOXM1 (major transcription factor) and its downstream pathway at protein levels (Fig. 4H-J).\"\n    }\n}",
    "Part 6": "{\n    \"Part 6\": \"Inhibition of TODL induces morphological changes in dedifferentiated liposarcoma cells\",\n    \"step 1\": {\n        \"implementation details\": \"I. Observation of morphological changes in TODL silenced cells\\n1. Silencing of TODL: Use siRNA and shRNA to silence TODL expression in LPS141 and LP6 cells.\\n   - Transfection: Transfect cells with 5 nM each of TODL siRNA1, TODL siRNA2, and non-targeting (Nt) siRNA using 5 \\u00b5L of Lipofectamine RNAi Max (Thermo Fisher Scientific, catalog #13778075) in 500 \\u00b5L of Opti-MEM medium (Thermo Fisher Scientific, catalog #31985070).\\n   - Incubation: Incubate transfected cells for 48 hours at 37\\u00b0C in a humidified incubator with 5% CO2.\\n2. Cell Growth: Grow TODL silenced cells for 2 weeks in 10 mL RPMI media supplemented with 10% fetal bovine serum (FBS) in a humidified incubator at 37\\u00b0C with 5% CO2.\\n3. Microscopic Imaging: Capture bright-field microscopic images of cells to observe morphological changes.\\n   - Imaging: Use a bright-field microscope (e.g., Nikon Eclipse Ts2) at 40x magnification to capture images.\\n   - Refer to Figure 5A for representative images of morphological changes.\",\n        \"original text\": \"Morphological changes occurred when the expression of TODL lncRNA was silenced and cells were grown for 2 weeks. TODL silenced cells induced the establishment of islands of cells with epithelial-like morphology.\",\n        \"results\": \"Bright-field microscopic images showed that TODL silenced cells induced the establishment of islands of cells with epithelial-like morphology.\",\n        \"results original text\": \"Morphological changes occurred when the expression of TODL lncRNA was silenced and cells were grown for 2 weeks. TODL silenced cells induced the establishment of islands of cells with epithelial-like morphology along with the decreased mRNA expression levels of TWIST1 and ZEB1, the crucial transcription factors associated with epithelial to mesenchymal transition (Fig. 5A-B).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Analysis of EMT-associated transcription factors\\n1. RNA Extraction: Extract RNA from TODL silenced and control cells using the RNeasy kit (Qiagen, catalog #74104) followed by on-column DNaseI treatment (Qiagen, catalog #79254).\\n   - Use 1 \\u00b5g of total RNA for extraction in a final volume of 50 \\u00b5L.\\n2. Real-time qPCR: Measure the expression levels of EMT-associated transcription factors (TWIST1 and ZEB1) using real-time qPCR.\\n   - cDNA Synthesis: Prepare cDNA using the Transcriptor First Strand cDNA Synthesis Kit (Roche, catalog #04896866001).\\n   - qPCR: Perform qPCR using Kapa SYBR Fast qPCR Master Mix (KAPA Biosystems, catalog #KK4602) and specific primers for TWIST1 and ZEB1. Primer sequences: TWIST1 forward: 5'-GAGTCCGCAGTCTTACGAGG-3', reverse: 5'-GCTTGAGGGTCTGAATCTTGCT-3'; ZEB1 forward: 5'-GATGATGAATGCGAGTCAGATGC-3', reverse: 5'-ACAGCAGTGTCTTGTTGTTGTG-3'.\\n   - Controls: Include non-template control (NTC) and positive control samples for each target gene.\",\n        \"original text\": \"We could not observe any changes in E-cadherin levels since it is not expressed in liposarcoma cells. However, the expression of EMT-associated transcription factors like TWIST and ZEB1 were downregulated in TODL-silenced LPS141 and LP6 cells.\",\n        \"results\": \"Real-time qPCR analysis showed that the expression of EMT-associated transcription factors TWIST1 and ZEB1 were significantly downregulated in TODL-silenced LPS141 and LP6 cells.\",\n        \"results original text\": \"However, the expression of EMT-associated transcription factors like TWIST and ZEB1 were downregulated in TODL-silenced LPS141 and LP6 cells (Fig. 5B).\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Induction of adipogenesis in TODL silenced cells and oil-red staining\\n1. Adipogenic Differentiation Medium: Grow TODL silenced cells in the presence of Human Adipocyte Differentiation Medium (Sigma Aldrich, catalog #DIF001) for 3 weeks.\\n   - Medium Change: Replace the medium with fresh adipocyte differentiation medium every 3 days.\\n2. Oil-red Staining: After 3 weeks, wash cells with PBS, fix with 10% formalin (Sigma Aldrich, catalog #HT501128) for 1 hour, treat with isopropanol (Sigma Aldrich, catalog #I9516) for 5 minutes, and stain with oil-red stain (Sigma Aldrich, catalog #O0625) for 2 hours.\\n   - Fixation: Use 10% formalin for fixation.\\n   - Staining: Prepare oil-red stain by dissolving 0.5 g of oil-red O in 100 mL of isopropanol. Filter the solution through a 0.45 \\u00b5m filter before use.\\n3. Microscopic Imaging: Capture images of the stained cells to observe lipid-rich vacuoles.\\n   - Imaging: Use a bright-field microscope (e.g., Nikon Eclipse Ts2) at 20x magnification to capture images.\\n   - Refer to Figure 5C for representative images of adipogenesis.\\n4. Quantitative Analysis: Use image analysis software (e.g., ImageJ, NIH) to quantify the morphological changes and the number of lipid-rich vacuoles in TODL silenced cells compared to control cells.\\n   - Parameters: Measure cell area, perimeter, and number of lipid-rich vacuoles.\\n   - Analysis: Perform statistical analysis to compare the morphological changes between TODL silenced and control cells.\\n   - Steps: Import images into ImageJ, set scale, threshold images to highlight lipid-rich vacuoles, and use the 'Analyze Particles' function to quantify vacuoles.\",\n        \"original text\": \"TODL down-regulated cells were grown in the presence of an adipogenic differentiation medium for 21 days. A remarkably high level of lipid-rich vacuoles and increased oil red staining of fat molecules was observed in TODL knockdown compared to Nt shRNA LPS141 and LP6 cells, indicating differentiation of LPS cells to adipocytes.\",\n        \"results\": \"Oil-red staining showed a remarkably high level of lipid-rich vacuoles and increased oil-red staining of fat molecules in TODL knockdown compared to Nt shRNA LPS141 and LP6 cells, indicating differentiation of LPS cells to adipocytes.\",\n        \"results original text\": \"A remarkably high level of lipid-rich vacuoles and increased oil red staining of fat molecules was observed in TODL knockdown compared to Nt shRNA LPS141 and LP6 cells, indicating differentiation of LPS cells to adipocytes (Fig. 5C).\"\n    }\n}",
    "Part 7": "{\n    \"Part 7\": \"FOXM1 in liposarcoma contributes to the disease pathogenesis\",\n    \"step 1\": {\n        \"implementation details\": \"I. Analysis of FOXM1 expression in TCGA database\\n1. Download RNA-seq expression data from the TCGA database for dedifferentiated liposarcoma patients and normal fat samples.\\n2. Use bioinformatics tools such as DESeq2 (version 1.30.0) or edgeR (version 3.32.1) to analyze the expression levels of FOXM1 and its downstream target genes.\\n3. Compare the expression levels of FOXM1 and its targets between dedifferentiated liposarcoma samples and normal fat samples using statistical tests (e.g., t-test or ANOVA).\\n4. Visualize the data using appropriate plots (e.g., boxplots, heatmaps) generated with R (version 4.0.3) and ggplot2 (version 3.3.3).\",\n        \"original text\": \"FOXM1 expressed significantly high at both RNA and protein levels compared to normal controls in 32 human TCGA cancer types including sarcomas [35,36]. Analysis of alterations of FOXM1 and its downstream targets in dedifferentiated liposarcoma patients in the TCGA database showed that the majority of patient samples displayed overexpression of FOXM1 and its target genes that were downregulated upon silencing of the TODL in LPS141 and LP6 cells (Supplementary Fig. S6). Consistently, RNA expression of these FOXM1 downstream genes was upregulated in tumors compared to normal fat (Fig. 6A).\",\n        \"results\": \"FOXM1 and its downstream genes were significantly overexpressed in dedifferentiated liposarcoma samples compared to normal fat samples.\",\n        \"results original text\": \"Analysis of alterations of FOXM1 and its downstream targets in dedifferentiated liposarcoma patients in the TCGA database showed that the majority of patient samples displayed overexpression of FOXM1 and its target genes that were downregulated upon silencing of the TODL in LPS141 and LP6 cells (Supplementary Fig. S6). Consistently, RNA expression of these FOXM1 downstream genes was upregulated in tumors compared to normal fat (Fig. 6A).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Silencing of FOXM1 using shRNA in liposarcoma cells\\n1. Design and purchase shRNAs targeting FOXM1 (shRNA2 and shRNA3) and non-targeting shRNA (Nt shRNA) as control. The sequences of the shRNAs are as follows:\\n   - FOXM1 shRNA2: 5'-GCTCTGTGACTTCAAGGAA-3'\\n   - FOXM1 shRNA3: 5'-GCAATGACGAGTGGATTTA-3'\\n   - Nt shRNA: 5'-GCTCTAGACTCGAGGATCT-3'\\n2. Transfect LPS141 and LP6 cells with 5 nM FOXM1 shRNAs and Nt shRNA using 5 \\u00b5L Lipofectamine RNAi Max per well in a 6-well plate. Incubate for 48 hours.\\n3. Harvest the cells and prepare protein lysates using Mammalian-Protein Extraction Reagent (Thermo Scientific, catalog number 78501).\\n4. Perform western blotting to measure FOXM1 protein levels. Use anti-FOXM1 antibodies (Abcam, catalog number ab207298) and Tubulin (Sigma-Aldrich, catalog number T5168) as the loading control.\",\n        \"original text\": \"For further in vitro validation of FOXM1 in liposarcoma, FOXM1 was silenced using shRNA and achieved about 84\\u201395% reduction in protein levels using two different shRNAs (sh2 and sh3) compared to Nt shRNA in LPS141 and LP6 cells (Fig. 6B).\",\n        \"results\": \"Silencing of FOXM1 using shRNA2 and shRNA3 resulted in an 84-95% reduction in FOXM1 protein levels in LPS141 and LP6 cells.\",\n        \"results original text\": \"For further in vitro validation of FOXM1 in liposarcoma, FOXM1 was silenced using shRNA and achieved about 84\\u201395% reduction in protein levels using two different shRNAs (sh2 and sh3) compared to Nt shRNA in LPS141 and LP6 cells (Fig. 6B).\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Measurement of cell viability after FOXM1 knockdown\\n1. Seed LPS141 and LP6 cells transfected with FOXM1 shRNAs and Nt shRNA in 96-well plates at a density of 3000 to 4000 cells per well.\\n2. Incubate the cells for 3\\u20135 days.\\n3. Add 10 \\u00b5L of 5 mg/mL MTT substrate to each well and incubate for 4 hours.\\n4. Add 100 \\u00b5L of MTT STOP solution (10% SDS in 0.01 M HCl) to stop the reaction and measure absorbance at 570 nm using a Tecan Infinite M200 microplate reader.\\n5. Normalize the absorbance values to the control wells to determine relative cell viability.\",\n        \"original text\": \"The silencing of the FOXM1 significantly reduced cellular growth in both LPS141 and LP6 cells confirming the oncogenic role of FOXM1 in dedifferentiated liposarcoma cells (Fig. 6C).\",\n        \"results\": \"Silencing of FOXM1 significantly reduced cell viability in both LPS141 and LP6 cells.\",\n        \"results original text\": \"The silencing of the FOXM1 significantly reduced cellular growth in both LPS141 and LP6 cells confirming the oncogenic role of FOXM1 in dedifferentiated liposarcoma cells (Fig. 6C).\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Functional assays to assess the role of FOXM1 in cell proliferation and apoptosis\\n1. Perform flow cytometry to analyze the cell cycle distribution in LPS141 and LP6 cells transfected with FOXM1 shRNAs and Nt shRNA.\\n2. Harvest the cells, wash with PBS, and fix in cold 70% ethanol.\\n3. Stain the cells with 50 \\u00b5g/mL propidium iodide and 100 \\u00b5g/mL RNase solution, and incubate for 30 minutes at room temperature. Analyze the cell cycle phases (G0/G1, S, and G2/M phases) by flow cytometry using a BD FACSCanto II (BD Biosciences, catalog number 338960). Set the voltage for FSC at 300, SSC at 400, and FL2 (PI) at 450. Use appropriate gating strategy to distinguish between cell cycle phases.\\n4. Assess apoptosis by staining the cells with Annexin V-APC (BD Biosciences, catalog number 550474) and 50 \\u00b5g/mL propidium iodide, followed by flow cytometry analysis to measure early and late apoptotic cell populations. Use appropriate controls to set the gating for Annexin V positive and PI positive cells.\",\n        \"original text\": \"Interestingly, silencing of the TODL induced G0/G1 arrest and resulted in a reduced population of the cells in the S and G2/M phases (Fig. 4B). In addition, a significant increase was observed in early and late apoptosis in the TODL lncRNA silenced LPS141 and LP6 cells in contrast to Nt shRNA cells (Fig. 4C).\",\n        \"results\": \"Silencing of FOXM1 induced G0/G1 cell cycle arrest and increased early and late apoptosis in LPS141 and LP6 cells.\",\n        \"results original text\": \"Interestingly, silencing of the TODL induced G0/G1 arrest and resulted in a reduced population of the cells in the S and G2/M phases (Fig. 4B). In addition, a significant increase was observed in early and late apoptosis in the TODL lncRNA silenced LPS141 and LP6 cells in contrast to Nt shRNA cells (Fig. 4C).\"\n    }\n}",
    "Part 8": "{\n    \"Part 8\": \"TODL regulates oncogenic transcription factor FOXM1 in dedifferentiated liposarcoma\",\n    \"step 1\": {\n        \"implementation details\": \"I. RNA pull-down assay to identify TODL interacting proteins\\n1. Synthesis of TODL RNA probe:\\n   (1) PCR amplification of TODL transcript containing T7 RNA Polymerase promoter.\\n       - Use primers specific for TODL with T7 promoter sequence.\\n       - PCR conditions: initial denaturation at 95\\u00b0C for 3 min, 35 cycles of 95\\u00b0C for 30 sec, 55\\u00b0C for 30 sec, 72\\u00b0C for 45 sec, and final extension at 72\\u00b0C for 5 min.\\n   (2) Synthesis of TODL RNA using HiScribe T7 in vitro transcription kit.\\n       - Incubate at 37\\u00b0C for 2 hours.\\n   (3) Purification of synthesized RNA using a standard RNA purification kit.\\n       - Use 100 \\u00b5l of elution buffer.\\n   (4) Labeling with biotin using RNA 3' end biotinylation kit.\\n       - Incubate at 37\\u00b0C for 1 hour using 5 \\u00b5l of biotin reagent per 100 \\u00b5l of RNA.\\n2. Preparation of cell lysates:\\n   (1) Sonication of 10 million cells in 0.5 ml lysis buffer (50 mM Tris-HCl pH 7, 10 mM EDTA, 1% SDS, protease inhibitor, SUPERase In RNase Inhibitor).\\n       - Sonicate for 10 cycles of 30 sec ON/30 sec OFF at 4\\u00b0C.\\n3. RNA pull-down assay:\\n   (1) Incubation of biotinylated TODL RNA probe with sonicated chromatin at 37\\u00b0C for 16 hours in hybridization buffer (750 mM NaCl, 50 mM Tris-HCl pH 7, 1 mM EDTA, 1% SDS, 15% Formamide, protease inhibitor, SUPERase In RNase Inhibitor).\\n       - Use 100 pmol of biotinylated TODL RNA probe in 500 \\u00b5l of hybridization buffer.\\n   (2) Retrieval of RNA-protein complexes using Streptavidin magnetic C1 beads.\\n       - Incubate at room temperature for 30 min with gentle rotation.\\n   (3) Washing of beads with wash buffer (2X SSC and 0.5% SDS) and elution of RNA-protein complexes in SDS Lamelli buffer.\\n       - Perform 5 washes, each with 1 ml of wash buffer for 5 min at room temperature.\",\n        \"original text\": \"I. RNA pull-down assay to identify TODL interacting proteins\\nRNA pull-down protocol used here is adapted and modified ChIRP protocol [34]. TODL transcript of 308 nucleotides was PCR amplified containing T7 RNA Polymerase promoter in the correct orientation. The HiScribe T7 in vitro transcription kit (New England Biolabs) was used for the synthesis of large amounts of TODL RNA molecules using the template as a purified PCR product. Synthesized RNA was purified and used for labeling biotin at the 3\\u2032 terminal end using an RNA 3\\u2032 end biotinylation kit (Thermo Scientific Pierce) according to instructions. Cell lysates were prepared by sonicating 10 million cells in 0.5 ml of lysis buffer (50 mM Tris-HCl pH 7, 10 mM EDTA, 1% SDS, protease inhibitor, SUPERase In RNase Inhibitor). In vitro synthesized biotinylated TODL RNA probe (100pmol) was incubated with sonicated chromatin at 370 C for 16 h to bind RNA-protein complexes in hybridization buffer (750 mM NaCl, 50 mM Tris.HCl pH 7, 1 mM EDTA, 1% SDS, 15% Formamide, protease inhibitor, SUPERase In RNase Inhibitor). After hybridization, RNA-protein complexes were retrieved by Streptavidin magnetic C1 beads, followed by stringent washing with wash buffer (2X SSC and 0.5% SDS). Proteins associated with RNA were eluted in SDS Lamelli buffer and separated on SDS-PAGE for immunoblotting.\",\n        \"results\": \"Functional interaction of TODL with FOXM1 protein was confirmed by western blotting demonstrating clear binding of TODL B+ with FOXM1 protein compared to all other controls. TODL B+ binding was also probed with another cell cycle protein AURKB, which showed no bands indicating the specific binding of TODL with FOXM1.\",\n        \"results original text\": \"Functional interaction of TODL with FOXM1 protein was confirmed by western blotting demonstrating clear binding of TODL B+ with FOXM1 protein compared to all other controls (Fig. 6F). TODL B+ binding was also probed with another cell cycle protein AURKB, which showed no bands indicating the specific binding of TODL with FOXM1.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Validation of TODL-FOXM1 interaction using western blotting\\n1. Western blotting of RNA pull-down samples:\\n   (1) Separation of eluted RNA-protein complexes on SDS-PAGE.\\n       - Use 10% SDS-PAGE gel and run at 120V for 1.5 hours.\\n   (2) Transfer of proteins to a PVDF membrane.\\n       - Transfer at 100V for 1 hour.\\n   (3) Blocking the membrane with 5% non-fat dry milk in TBST for 1 hour at room temperature.\\n   (4) Probing with primary antibodies specific to FOXM1 (1:1000 dilution) and AURKB (1:1000 dilution) overnight at 4\\u00b0C.\\n   (5) Washing the membrane with TBST (3 times, 10 min each, using 15 ml of TBST per wash).\\n   (6) Incubation with HRP-conjugated secondary antibodies (1:5000 dilution) for 1 hour at room temperature.\\n   (7) Visualization using enhanced chemiluminescence (ECL) reagent.\\n       - Use 1 ml of ECL reagent and expose the membrane for 1-5 minutes.\",\n        \"original text\": \"II. Validation of TODL-FOXM1 interaction using western blotting\\nFunctional interaction of TODL with FOXM1 protein was confirmed by western blotting demonstrating clear binding of TODL B+ with FOXM1 protein compared to all other controls (Fig. 6F). TODL B+ binding was also probed with another cell cycle protein AURKB, which showed no bands indicating the specific binding of TODL with FOXM1.\",\n        \"results\": \"Western blotting demonstrated clear binding of TODL B+ with FOXM1 protein compared to all other controls. TODL B+ binding was also probed with another cell cycle protein AURKB, which showed no bands indicating the specific binding of TODL with FOXM1.\",\n        \"results original text\": \"Functional interaction of TODL with FOXM1 protein was confirmed by western blotting demonstrating clear binding of TODL B+ with FOXM1 protein compared to all other controls (Fig. 6F). TODL B+ binding was also probed with another cell cycle protein AURKB, which showed no bands indicating the specific binding of TODL with FOXM1.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Analysis of FOXM1 protein stability in TODL overexpressing cells treated with cycloheximide\\n1. Overexpression of TODL in MLS402 cells:\\n   (1) Create stable overexpression of TODL in MLS402 cells using a pLKO.1-puro-CMV-TurboGFP vector.\\n       - Transfect MLS402 cells with the vector using Lipofectamine 2000.\\n       - Select transduced cells with puromycin (2 \\u00b5g/ml) for 7 days.\\n2. Treatment with cycloheximide:\\n   (1) Treat TODL overexpressing and control cells with cycloheximide (100 \\u00b5g/ml).\\n   (2) Collect cell lysates at 0, 2, 4, 6, and 8 hours after cycloheximide treatment.\\n3. Western blot analysis:\\n   (1) Analyze FOXM1 protein levels in cell lysates by western blotting as described in Step II.\\n   (2) Compare FOXM1 protein stability between TODL overexpressing and control cells.\",\n        \"original text\": \"III. Analysis of FOXM1 protein stability in TODL overexpressing cells treated with cycloheximide\\nTODL-OE cells were treated with a protein synthesis inhibitor, cycloheximide, and levels of FOXM1 protein were evaluated through western blotting. Results showed cycloheximide decreased FOXM1 protein expression in control cells. Importantly, TODL overexpression cells were able to rescue the protein degradation and enhanced FOXM1 protein stability (Fig. 6G).\",\n        \"results\": \"Results showed cycloheximide decreased FOXM1 protein expression in control cells. Importantly, TODL overexpression cells were able to rescue the protein degradation and enhanced FOXM1 protein stability.\",\n        \"results original text\": \"Results showed cycloheximide decreased FOXM1 protein expression in control cells. Importantly, TODL overexpression cells were able to rescue the protein degradation and enhanced FOXM1 protein stability (Fig. 6G).\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Analysis of downstream effects of TODL-FOXM1 interaction on cell cycle and proliferation\\n1. Silencing of TODL in LPS141 and LP6 cells:\\n   (1) Transfect LPS141 and LP6 cells with TODL siRNA1 and siRNA2 (5 nM each) using Lipofectamine RNAi Max.\\n       - Incubate for 48 hours before further analysis.\\n2. RNA sequencing and pathway analysis:\\n   (1) Perform RNA sequencing of TODL silenced and control cells.\\n       - Use TruSeq Library Prep kit (Illumina) and sequence on Illumina HiSeq2000 platform.\\n       - Use 1 \\u00b5g of total RNA for library preparation.\\n       - Sequence to a depth of 30 million paired-end reads per sample.\\n   (2) Identify differentially expressed genes using standard bioinformatics tools (e.g., DESeq2).\\n       - Use a false discovery rate (FDR) threshold of 0.05 for significance.\\n   (3) Perform pathway analysis using KEGG and PID databases to identify affected pathways.\\n3. Validation of cell cycle-related genes:\\n   (1) Perform real-time qPCR to validate the expression of cell cycle-related genes (e.g., FOXM1, PLK1, UBE2C, AURKB, CCNB1, CDK1) in TODL silenced cells.\\n       - Use Kapa SYBR fast qPCR Master Mix and specific primers.\\n       - Use GAPDH as a housekeeping gene for normalization.\\n   (2) Analyze protein levels of cell cycle-related genes by western blotting as described in Step II.\",\n        \"original text\": \"IV. Analysis of downstream effects of TODL-FOXM1 interaction on cell cycle and proliferation\\nRNA sequencing was performed on LPS141 and LP6 cells transfected with TODL siRNA1 and siRNA2 along with Nt siRNA to identify downstream targets of TODL. After analysis of the RNA sequencing data, a list of downregulated and upregulated transcripts are generated as provided in Supplementary Table ST6. Our data displayed that various essential signaling pathways were affected by the decrease in TODL expression. Moreover, the KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations (Fig. 4D). Interestingly, pathway interaction database (PID) analysis identified critical pathways from the research and treatment view of cancer and confirmed the down-regulation of FOXM1, PLK1, and Aurora signaling pathways (Fig. 4E). Our qPCR results validated the downregulation of important cell cycle-related gene transcripts like FOXM1, PLK1, UBE2C, AURKB, CCNB1, and CDK1 in the TODL lncRNA silenced group than Nt shRNA group in LPS141 and LP6 cells (Fig. 4F-G). Importantly, the western blot and densitometric analysis demonstrated that the downregulation of TODL lncRNA caused a significant inhibition of FOXM1 (major transcription factor) and its downstream pathway at protein levels (Fig. 4H-J).\",\n        \"results\": \"RNA sequencing data showed that silencing of TODL resulted in downregulation of various essential signaling pathways including cell cycle signaling, FoxO signaling, p53 signaling, and transcriptional misregulations. Pathway interaction database (PID) analysis confirmed the down-regulation of FOXM1, PLK1, and Aurora signaling pathways. Real-time qPCR and western blot analysis validated the downregulation of important cell cycle-related gene transcripts (FOXM1, PLK1, UBE2C, AURKB, CCNB1, CDK1) and proteins in TODL silenced LPS141 and LP6 cells.\",\n        \"results original text\": \"RNA sequencing was performed on LPS141 and LP6 cells transfected with TODL siRNA1 and siRNA2 along with Nt siRNA to identify downstream targets of TODL. After analysis of the RNA sequencing data, a list of downregulated and upregulated transcripts are generated as provided in Supplementary Table ST6. Our data displayed that various essential signaling pathways were affected by the decrease in TODL expression. Moreover, the KEGG pathway analysis indicated, that cell cycle signalings are the top pathway regulated by the silencing of TODL lncRNA as well as other important pathways such as FoxO signaling, p53 signaling, and transcriptional misregulations (Fig. 4D). Interestingly, pathway interaction database (PID) analysis identified critical pathways from the research and treatment view of cancer and confirmed the down-regulation of FOXM1, PLK1, and Aurora signaling pathways (Fig. 4E). Our qPCR results validated the downregulation of important cell cycle-related gene transcripts like FOXM1, PLK1, UBE2C, AURKB, CCNB1, and CDK1 in the TODL lncRNA silenced group than Nt shRNA group in LPS141 and LP6 cells (Fig. 4F-G). Importantly, the western blot and densitometric analysis demonstrated that the downregulation of TODL lncRNA caused a significant inhibition of FOXM1 (major transcription factor) and its downstream pathway at protein levels (Fig. 4H-J).\"\n    }\n}"
}