{
    "download successfully": [
        {
            "title": "<ArticleTitle>Specific immune landscapes and immune checkpoint expressions in histotypes and molecular subtypes of sarcoma.</ArticleTitle>",
            "abstract": "Soft tissue sarcomas are a group of rare and aggressive connective tissue neoplasms for which curative therapeutic opportunities are limited in advanced phase. Clinical trials assessing immunotherapy in these tumors have so far reported limited efficacy. The objective of this study is to provide a description of the immunologic landscape of sarcomas to guide the next clinical trials of immunotherapy in these diseases. The gene expression profile of 93 immune checkpoint (ICP) and membrane markers (MM) of immune cells was analyzed in a series of 253 soft tissue sarcoma (synovial sarcoma, myxoid liposarcoma, sarcoma with complex genomic and GIST) using Agilent Whole Human Genome Microarrays. The unsupervised hierarchical clustering of gene expression level was found able to properly group patients according to the histological subgroup of sarcoma, indicating that each sarcoma subgroup is associated with a specific immune signature defined by its gene expression pattern. Using the prognostic impact of CIBERSORT signature on metastatic-free survival in each subgroup, specific target could be proposed for each of the four groups: Treg through ICOS and GITR in GIST, M0 macrophages in all four sarcoma subtypes, OX40 in SS, CD40 in GIST and SS. The immune landscape of sarcoma was found to be as heterogeneous as the histotypes and molecular subtypes, but strongly correlated to the histotype. Histotype adapted immunotherapeutic approaches in each sarcoma subtypes must be considered in view of these results, consistently with the already reported specific response of histotypes of ICPs.",
            "doi": "10.1080/2162402X.2020.1792036",
            "pmid": "32923153",
            "pmcid": "7458655",
            "score": 4,
            "llm_response_check4related": "The title and abstract of the paper titled \"Specific immune landscapes and immune checkpoint expressions in histotypes and molecular subtypes of sarcoma\" are highly relevant to the research objective of classifying the immune microenvironment and identifying key genes in liposarcoma based on transcriptomics. The study focuses on the immunologic landscape of soft tissue sarcomas, which includes liposarcoma, and provides insights into gene expression profiles related to immune checkpoints and markers in various sarcoma subtypes.\n\nThe research conditions align well with this paper, as it discusses the heterogeneity of immune signatures based on histological subtypes, which is essential for understanding the immune microenvironment in liposarcoma specifically. Furthermore, the paper's findings could guide future therapeutic approaches, including immunotherapy, which could be applicable to the available sarcoma cell lines and frozen samples.\n\nOverall, the paper provides substantial information that could contribute significantly to the research objective, making it highly relevant and useful.\n\nBased on this evaluation, I would rate the helpfulness of the paper as follows: [4]",
            "path": "D:\\2024-医学助手-Demo\\react_nextjs\\project5\\BioResearcher\\backend\\app\\data\\62367\\papers/7458655.pdf"
        },
        {
            "title": "<ArticleTitle>Comprehensive Analysis of a Six-Gene Signature Predicting Survival and Immune Infiltration of Liposarcoma Patients and Deciphering Its Therapeutic Significance.</ArticleTitle>",
            "abstract": "As a common soft tissue sarcoma, liposarcoma (LPS) is a heterogeneous malignant tumor derived from adipose tissue. Due to the high risk of metastasis and recurrence, the prognosis of LPS remains unfavorable. To improve clinical treatment, a robust risk prediction model is essential to evaluate the prognosis of LPS patients.",
            "doi": "10.3390/ijms25147792",
            "pmid": "39063036",
            "pmcid": "11277418",
            "score": 4,
            "llm_response_check4related": "The title and abstract of the paper indicate a focus on liposarcoma, specifically addressing a six-gene signature related to survival and immune infiltration. This aligns well with the research objective of classifying the immune microenvironment and identifying key genes in liposarcoma based on transcriptomics. \n\nThe mention of a \"six-gene signature\" suggests that the paper may provide insights into key genes that could be relevant for the study, potentially enhancing the understanding of the immune landscape in liposarcoma. Additionally, the emphasis on prognosis and risk prediction could contribute to the broader goal of improving clinical treatment strategies for liposarcoma patients.\n\nHowever, the abstract does not provide detailed information on the methodology or results, which limits the extent to which it can be deemed directly useful for the experimental design or data analysis aspects of the research. \n\nOverall, the relevance to the research objective is substantial, and while it may not cover all necessary components, it does offer valuable insights into gene identification and immune microenvironment classification.\n\nConsidering these points, I would rate the helpfulness of this paper as follows:\n\n[4]",
            "path": "D:\\2024-医学助手-Demo\\react_nextjs\\project5\\BioResearcher\\backend\\app\\data\\62367\\papers/11277418.pdf"
        },
        {
            "title": "<ArticleTitle>Deciphering the correlation between metabolic activity through 18F-FDG-PET/CT and immune landscape in soft-tissue sarcomas: an insight from the NEOSARCOMICS study.</ArticleTitle>",
            "abstract": "Metabolic elevation in soft-tissue sarcomas (STS), as documented with 18F-Fluorodeoxyglucose positron emission tomography (18F-FDG-PET/CT) has been linked with cell proliferation, higher grade, and lower survivals. However, the recent diagnostic innovations (CINSARC gene-expression signature and tertiary lymphoid structure [TLS]) and therapeutic innovations (immune checkpoint inhibitors [ICIs]) for STS patients underscore the need to re-assess the role of 18F-FDG-PET/CT. Thus, in this correspondence, our objective was to investigate the correlations between STS metabolism as assessed by nuclear imaging, and the immune landscape as estimated by transcriptomics analysis, immunohistochemistry panels, and TLS assessment. Based on a prospective cohort of 85 adult patients with high-grade STS recruited in the NEOSARCOMICS trial (NCT02789384), we identified 3 metabolic groups according to 18F-FDG-PET/CT metrics (metabolic-low [60%], -intermediate [15.3%] and high [24.7%]). We found that T-cells CD8 pathway was significantly enriched in metabolic-high STS. Conversely, several pathways involved in antitumor immune response, cell differentiation and cell cycle, were downregulated in extreme metabolic-low STS. Next, multiplex immunofluorescence showed that densities of CD8+, CD14+, CD45+, CD68+, and c-MAF cells were significantly higher in the metabolic-high group compared to the metabolic-low group. Lastly, no association was found between metabolic group and TLS status. Overall, these results suggest that (i) rapidly proliferating and metabolically active STS can instigate a more robust immune response, thereby attracting immune cells such as T cells and macrophages, and (ii) metabolic activity and TLS could independently influence immune responses.",
            "doi": "10.1186/s40364-023-00552-y",
            "pmid": "38185642",
            "pmcid": "10773028",
            "score": 4,
            "llm_response_check4related": "The paper titled \"Deciphering the correlation between metabolic activity through 18F-FDG-PET/CT and immune landscape in soft-tissue sarcomas: an insight from the NEOSARCOMICS study\" appears to have relevance to the research objective of classifying the immune microenvironment and identifying key genes in liposarcoma based on transcriptomics. \n\nThe abstract discusses the correlation between metabolic activity in soft-tissue sarcomas (STS) and the immune landscape as assessed through transcriptomics, which aligns well with the research objective of analyzing the immune microenvironment. It highlights the use of transcriptomics and immunohistochemistry, which are relevant techniques for the proposed study. The identification of distinct metabolic groups and their association with immune cell densities provides insights that could be beneficial for understanding the immune microenvironment in liposarcoma.\n\nHowever, while the paper provides valuable information regarding metabolic activity and immune response in STS, it does not specifically focus on liposarcoma, nor does it directly address the identification of key genes in that context. Thus, while the insights from this study can be informative, they may require further interpretation and adaptation to be fully applicable to the specific aims of the proposed research.\n\nConsidering the overall relevance and potential contributions of the paper, I would rate its helpfulness as follows:\n\n[4]",
            "path": "D:\\2024-医学助手-Demo\\react_nextjs\\project5\\BioResearcher\\backend\\app\\data\\62367\\papers/10773028.pdf"
        }
    ],
    "download failed": [
        {
            "title": "<article-title>CFLAR: A novel diagnostic and prognostic biomarker in soft tissue sarcoma, which positively modulates the immune response in the tumor microenvironment</article-title>",
            "abstract": "<p>Anoikis is highly associated with tumor cell apoptosis and tumor prognosis; however, the specific role of anoikis-related genes (ARGs) in soft tissue sarcoma (STS) remains to be fully elucidated. The present study aimed to use a variety of bioinformatics methods to determine differentially expressed anoikis-related genes in STS and healthy tissues. Subsequently, three machine learning algorithms, Least Absolute Shrinkage and Selection Operator, Support Vector Machine and Random Forest, were used to screen genes with the highest importance score. The results of the bioinformatics analyses demonstrated that CASP8 and FADD-like apoptosis regulator (CFLAR) exhibited the highest importance score. Subsequently, the diagnostic and prognostic value of CFLAR in STS development was determined using multiple public and in-house cohorts. The results of the present study demonstrated that CFLAR may be considered a diagnostic and prognostic marker of STS, which acts as an independent prognostic factor of STS development. The present study also aimed to explore the potential role of CFLAR in the STS tumor microenvironment, and the results demonstrated that CFLAR significantly enhanced the immune response of STS, and exerted a positive effect on the infiltration of CD8<sup>+</sup> T cells and M1 macrophages in the STS immune microenvironment. Notably, the aforementioned results were verified using multiplex immunofluorescence analysis. Collectively, the results of the present study demonstrated that CFLAR may act as a novel diagnostic and prognostic marker for STS, and may positively regulate the immune response of STS. Thus, the present study provided a novel theoretical basis for the use of CFLAR in STS diagnosis, in predicting clinical outcomes and in tailoring individualized treatment options.</p>",
            "doi": null,
            "pmid": null,
            "pmcid": null,
            "score": 4,
            "llm_response_check4related": "The paper titled \"CFLAR: A novel diagnostic and prognostic biomarker in soft tissue sarcoma, which positively modulates the immune response in the tumor microenvironment\" is quite relevant to the research objective of classifying the immune microenvironment and identifying key genes in liposarcoma based on transcriptomics.\n\nThe abstract indicates that the study focuses on the role of anoikis-related genes in soft tissue sarcoma (STS), which includes liposarcoma, and highlights CFLAR as an important gene with diagnostic and prognostic significance. Moreover, it explores the immune response in the STS tumor microenvironment, specifically noting its impact on immune cell infiltration, including CD8+ T cells and M1 macrophages.\n\nGiven the available resources and data sources for this research, including RNA sequencing data and the focus on the immune microenvironment, this paper provides valuable insights into the role of CFLAR in the context of soft tissue sarcoma. The findings may directly contribute to the understanding of immune modulation in liposarcoma and aid in identifying potential key genes.\n\nOverall, the paper aligns well with the research conditions and requirements outlined in the objective, providing substantial information that could significantly advance the research initiative.\n\nTherefore, I would rate this paper as:\n\n[4]"
        },
        {
            "title": "<article-title>Targeted transcriptomic analysis of well-differentiated and dedifferentiated liposarcoma reveals multiple dysregulated pathways including glucose metabolism, TGF-β, and HIF-1 signaling</article-title>",
            "abstract": "<p>Liposarcoma is the most prevalent sarcoma in adults representing 20% of all sarcomas with well-differentiated/dedifferentiated among the most common subtypes represented. Despite multimodality treatment approaches, there has not been any appreciable change in survival benefit in the past 10 years. The future of targeted therapy for WD/DDLPS is promising with the intention to spare multi-visceral removal due to radical surgical resection. Therefore, there is a need to expand upon the molecular landscape of WDLPS and DDLPS which can help identify potential therapeutic targets for the treatment of this disease. Targeted transcriptome analysis using the NanoString tumor signaling 360 panel revealed a dysregulation in glucose metabolism and HIF1 signaling pathways in both WDLPS and DDLPS when compared to normal fat controls. WDLPS, however, demonstrated upregulation of <italic>HIF-1A</italic> and <italic>TGF-β</italic> when compared to DDLPS by targeted transcriptome analysis and orthogonal validation by RT-qPCR suggesting activation of EMT pathway in WDLPS when compared to DDLPS. Our findings implicate a putative role for dysregulation in glucose metabolism, TGF-β and HIF1 signaling in the pathogenesis of both WD/DDLPS suggesting a possible proinflammatory tumor environment within WDLPS and subsequent activation of the TGF-β signaling pathway.</p>",
            "doi": "10.3389/fonc.2024.1456071",
            "pmid": null,
            "pmcid": null,
            "score": 5,
            "llm_response_check4related": "The title and abstract of the paper are indeed highly relevant to the stated research objective of classifying the immune microenvironment and identifying key genes in liposarcoma based on transcriptomics. The study focuses on well-differentiated and dedifferentiated liposarcoma (WDLPS and DDLPS), which are common subtypes of this cancer. It provides insights into dysregulated pathways that could be critical for understanding the immune microenvironment, including glucose metabolism, TGF-β, and HIF-1 signaling.\n\nGiven that the resources available for the research include frozen samples and RNA sequencing data, the targeted transcriptomic analysis mentioned in the paper could be directly applicable. The results indicating dysregulation and potential therapeutic targets align well with the objective of identifying key genes in liposarcoma.\n\nThe study appears to offer substantial insights that could significantly contribute to the research objective, making it not only relevant but also potentially critical in advancing the understanding of liposarcoma's molecular landscape. \n\nTherefore, I would rate the helpfulness of this paper as:\n\n[5]"
        },
        {
            "title": "<ArticleTitle>Cellular origin and clonal evolution of human dedifferentiated liposarcoma.</ArticleTitle>",
            "abstract": "Dedifferentiated liposarcoma (DDLPS) is the most frequent high-grade soft tissue sarcoma subtype. It is characterized by a component of undifferentiated tumor cells coexisting with a component of well-differentiated adipocytic tumor cells. Both dedifferentiated (DD) and well-differentiated (WD) components exhibit MDM2 amplification, however their cellular origin remains elusive. Using single-cell RNA sequencing, DNA sequencing, in situ multiplex immunofluorescence and functional assays in paired WD and DD components from primary DDLPS tumors, we characterize the cellular heterogeneity of DDLPS tumor and micro-environment. We identify a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue. We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution. Last, we show that DD tumor cells keep important biological properties of ASC including pluripotency and that their adipogenic properties are inhibited by a TGF-β-high immunosuppressive tumor micro-environment.",
            "doi": "10.1038/s41467-024-52067-1",
            "pmid": "39266532",
            "pmcid": null,
            "score": 4,
            "llm_response_check4related": "The title and abstract of the paper titled \"Cellular origin and clonal evolution of human dedifferentiated liposarcoma\" are quite relevant to the stated research objective of classifying the immune microenvironment and identifying key genes in liposarcoma based on transcriptomics. The use of single-cell RNA sequencing and the characterization of tumor heterogeneity directly aligns with the available RNA sequencing data from 80 cases and single-cell sequencing data from 10 cases.\n\nThe paper discusses the cellular origin and clonal evolution of dedifferentiated liposarcoma, which is pertinent to understanding the immune microenvironment in liposarcoma. Additionally, the mention of the immunosuppressive tumor microenvironment and its impact on adipogenic properties could provide insights into the immune interactions within liposarcoma, potentially highlighting key genes of interest.\n\nIn summary, the paper provides substantial information and insights into the biology of dedifferentiated liposarcoma, which can significantly contribute to the research objective. Therefore, I would rate the helpfulness of this paper as follows:\n\n[4]"
        },
        {
            "title": "<article-title>Integration of ubiquitination-related genes in predictive signatures for prognosis and immunotherapy response in sarcoma</article-title>",
            "abstract": "<p>Ubiquitination is one of the most prevalent and complex post-translational modifications of proteins in eukaryotes, playing a critical role in regulating various physiological and pathological processes. Targeting ubiquitination pathways, either through inhibition or activation, holds promise as a novel therapeutic approach for cancer treatment. However, the expression patterns, prognostic significance, and underlying mechanisms of ubiquitination-related genes (URGs) in sarcoma (SARC) remain unclear.</p> <p>We analyzed URG expression patterns and prognostic implications in TCGA-SARC using public databases, identifying DEGs related to ubiquitination among SARC molecular subtypes. Functional enrichment analysis elucidated their biological significance. Prognostic signatures were developed using LASSO-Cox regression, and a predictive nomogram was constructed. External validation was performed using GEO datasets and clinical tissue samples. The association between URG risk scores and various clinical parameters, immune response, drug sensitivity, and RNA modification regulators was investigated. Integration of data from multiple sources and RT-qPCR confirmed upregulated expression of prognostic URGs in SARC. Single-cell RNA sequencing data analyzed URG distribution across immune cell types. Prediction analysis identified potential target genes of microRNAs and long non-coding RNAs.</p> <p>We identified five valuable genes (CALR, CASP3, BCL10, PSMD7, PSMD10) and constructed a prognostic model, simultaneously identifying two URG-related subtypes in SARC. The UEGs between subtypes in SARC are mainly enriched in pathways such as Cell cycle, focal adhesion, and ECM-receptor interaction. Analysis of URG risk scores reveals that patients with a low-risk score have better prognoses compared to those with high-risk scores. There is a significant correlation between DRG riskscore and clinical features, immune therapy response, drug sensitivity, and genes related to pan-RNA epigenetic modifications. High-risk SARC patients were identified as potential beneficiaries of immune checkpoint inhibitor therapy. We established regulatory axes in SARC, including CALR/hsa-miR-29c-3p/LINC00943, CASP3/hsa-miR-143-3p/LINC00944, and MIR503HG. RT-qPCR data further confirmed the upregulation of prognostic URGs in SARC. Finally, we validated the prognostic model’s excellent predictive performance in predicting outcomes for SARC patients.</p> <p>We discovered a significant correlation between aberrant expression of URGs and prognosis in SARC patients, identifying a prognostic model related to ubiquitination. This model provides a basis for individualized treatment and immunotherapy decisions for SARC patients.</p>",
            "doi": "10.3389/fonc.2024.1446522",
            "pmid": null,
            "pmcid": null,
            "score": 4,
            "llm_response_check4related": "The title and abstract of the paper titled \"Integration of ubiquitination-related genes in predictive signatures for prognosis and immunotherapy response in sarcoma\" present several relevant aspects that align well with the stated research objective of classifying the immune microenvironment and identifying key genes in liposarcoma based on transcriptomics.\n\n1. **Relevance to Research Objective**: The paper focuses on ubiquitination-related genes in sarcoma, which is pertinent given that liposarcoma is a type of sarcoma. The identification of genes related to immune response and prognostic models indicates potential applicability to understanding the immune microenvironment in liposarcoma.\n\n2. **Use of Transcriptomics**: The study employs RNA sequencing data and discusses differential expression of genes, which aligns with the research conditions that involve RNA sequencing data from liposarcoma cases.\n\n3. **Analysis of the Immune Microenvironment**: The abstract mentions the use of single-cell RNA sequencing to analyze gene distribution across immune cell types, which directly supports the exploration of the immune microenvironment as stated in the research objective.\n\n4. **Identification of Key Genes**: The identification of specific genes (CALR, CASP3, BCL10, PSMD7, PSMD10) and the development of a prognostic model indicate that the paper contributes valuable insights into key genes that could be relevant for further investigation in liposarcoma.\n\n5. **Potential for Therapeutic Insights**: The discussion of immune therapy response and drug sensitivity suggests that the findings could be beneficial for developing therapeutic strategies, which is a crucial aspect of the overall research objective.\n\nGiven these points, the paper provides a substantial amount of useful information and insights that could significantly contribute to the research objective of classifying the immune microenvironment and identifying key genes in liposarcoma.\n\nTherefore, I would rate the helpfulness of this paper as a 4 - Very Helpful.\n\n[4]"
        }
    ]
}