{
    "Part 1": "{\n    \"Part 1\": \"Transcriptomics analysis using RNA-sequencing to identify cancer-type-associated heterogeneities in metabolic pathways\",\n    \"step 1\": {\n        \"implementation details\": \"I. Data Collection from Cancer Cell Line Encyclopedia (CCLE):\\n1. Collect RNA-sequencing data from the CCLE database (23Q2 release).\\n2. Ensure the dataset includes 1,341 cell lines representing 41 major cancer types.\\n3. Collect additional data from The Cancer Genome Atlas (TCGA), TARGET, and Treehouse databases if needed.\\n4. Provide accession numbers or links to the datasets: CCLE (https://depmap.org/portal/), TCGA (https://www.cancer.gov/about-nci/organization/ccg/research/structural-genomics/tcga), TARGET (https://ocg.cancer.gov/programs/target), Treehouse (https://treehousegenomics.ucsc.edu/).\",\n        \"original text\": \"To systematically evaluate metabolic similarities and differences across cell lines representing diverse cancer types, we used RNA-sequencing data from the Cancer Cell Line Encyclopedia (CCLE).23 By including all cancer types of which five CCLE cell lines or more were available, we analyzed 1,341 cell lines spanning 41 major cancer types.\",\n        \"results\": \"The analysis included 1,341 CCLE cell lines, representing 41 cancer types. The number of cell lines for each cancer type is shown in Figure 1A.\",\n        \"results original text\": \"(A) In total 1,341 CCLE cell lines, representing 41 cancer types, were included in the analysis. The number of cell lines for each cancer type is shown.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Preprocessing and Normalization of RNA-sequencing Data:\\nA. Quality control checks:\\n   1. Perform quality control checks on the raw RNA-sequencing data to ensure data integrity using tools like FastQC (https://www.bioinformatics.babraham.ac.uk/projects/fastqc/).\\nB. Removal of low-quality reads:\\n   1. Remove low-quality reads and sequences with low expression levels using tools like Trimmomatic (http://www.usadellab.org/cms/?page=trimmomatic).\\nC. Normalization techniques:\\n   1. Normalize expression levels to Transcripts Per Million (TPM) using RSEM (https://github.com/deweylab/RSEM).\\n   2. Use log2 transformation (log2(TPM+1)) and z-score normalization for further analysis.\",\n        \"original text\": \"Log2-transformed gene expression data (i.e., log2(TPM+1)) was z-scored for all unique KEGG metabolic genes (1,620 genes in 85 metabolic pathways29) across all cell lines.\",\n        \"results\": \"The log2-transformed and z-scored expression data for 1,620 metabolic genes were used for further analysis.\",\n        \"results original text\": \"Log2-transformed gene expression data (i.e., log2(TPM+1)) was z-scored for all unique KEGG metabolic genes (1,620 genes in 85 metabolic pathways29) across all cell lines.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Identification of Metabolic Genes and Pathways from KEGG Database:\\n1. Identify 1,620 genes representing 85 different metabolic pathways from the Kyoto Encyclopedia of Genes and Genomes (KEGG) database.\\n2. Download and map these genes to the RNA-sequencing data for further analysis.\\n3. Access the KEGG database at https://www.genome.jp/kegg/.\",\n        \"original text\": \"We used uniform manifold approximation and projection (UMAP) clustering to visualize the degree to which the expression of 1,620 genes representing 85 different metabolic pathways (obtained from the Kyoto Encyclopedia of Genes and Genomes [KEGG] database24,25) varied with cancer type.\",\n        \"results\": \"The expression levels of 1,620 metabolic genes were used for UMAP clustering to visualize metabolic similarities and differences across cell lines.\",\n        \"results original text\": \"UMAP visualization of cell lines based on the expression levels of 1,620 metabolic genes. Cell lines are colored based on their cancer type (as shown in A).\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Uniform Manifold Approximation and Projection (UMAP) Clustering:\\n1. Perform UMAP clustering on the z-scored data using the following parameters:\\n   a. nearest neighbor (n_neighbors) = 50\\n   b. minimum distance (min_dist) = 0.5\\n   c. distance metric (metric) = Pearson.\\n2. Visualize the clustering results to identify clusters of cell lines that correlate with cancer types based on their metabolic gene expression.\\n3. Use software version UMAP 0.2.10.0 for clustering.\\n4. Example code for UMAP clustering in R:\\n   R\\n   library(umap)\\n   umap_result <- umap(z_scored_data, n_neighbors = 50, min_dist = 0.5, metric = 'pearson')\\n   plot(umap_result)\\n   \",\n        \"original text\": \"UMAP visualization of cell lines based on the expression levels of 1,620 metabolic genes. Cell lines are colored based on their cancer type (as shown in A).\",\n        \"results\": \"UMAP clustering revealed clusters of cell lines that correlated with cancer types based on their metabolic gene expression. Examples of cancers that clustered most distinguishably by UMAP included acute myeloid leukemia, B and T lymphoblastic leukemia/lymphoma, diffuse glioma, Ewing sarcoma, Hodgkin and non-Hodgkin lymphomas, neuroblastoma, melanomas, liposarcoma, rhabdoid cancer, and myeloproliferative neoplasms.\",\n        \"results original text\": \"(B) UMAP visualization of cell lines based on the expression levels of 1,620 metabolic genes. Cell lines are colored based on their cancer type (as shown in A).\\n(C) Examples of metabolic similarities across tumor lineages, including neuroblastoma vs. small cell lung cancer (top left) and cutaneous vs. ocular melanoma (top right) or heterogeneities within non-small cell lung cancer and ovarian epithelial tumor cell lines (bottom) are shown. Individual cell lines from indicated cancer types are highlighted on UMAP plots.\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Celligner Analysis to Integrate and Align Metabolic Gene Expression Data:\\n1. Use Celligner (https://figshare.com/articles/dataset/Celligner_data/11965269) to integrate and align RNA-sequencing data from CCLE cell lines and patient-derived tumors included in The Cancer Genome Atlas, TARGET, and Treehouse databases.\\n2. Perform UMAP clustering on Celligner-aligned metabolic gene-expression profiles to identify clusters based on cancer types.\\n3. Ensure that the Celligner analysis uses the latest version available.\\n4. Example code for Celligner analysis in R:\\n   R\\n   source('https://github.com/broadinstitute/Celligner_ms')\\n   celligner_data <- readRDS('path/to/Celligner_data.rds')\\n   celligner_result <- celligner(celligner_data)\\n   plot(celligner_result)\\n   \",\n        \"original text\": \"To test whether differences in metabolic gene expression across cell lines of diverse cancer types matched their tumor type of origin, we used Celligner,26 an unsupervised method to integrate and align RNA-sequencing data from CCLE cell lines and patient-derived tumors included in The Cancer Genome Atlas, TARGET, and Treehouse databases.27,28 The Celligner-aligned metabolic gene-expression profiles largely clustered together by cancer type in the UMAP projection.\",\n        \"results\": \"The Celligner-aligned metabolic gene-expression profiles largely clustered together by cancer type in the UMAP projection. On average, ~66% of cell lines from each cancer type matched their tumor type of origin. The alignment based on metabolic gene expression was reasonably high (>50%) for 14 out of 20 tested cancer types and particularly high (>90%) for leukemias, osteosarcoma, and Ewing sarcoma.\",\n        \"results original text\": \"(D) UMAP visualization of Celligner-aligned cell lines and patient tumors based on the expression levels of 1,604 metabolic genes. Cell lines and tumors are colored based on their cancer type.\\n(E) Percentage of cell lines of each cancer type that are grouped with their corresponding tumor type of origin using Celligner-aligned metabolic gene expression.\"\n    },\n    \"step 6\": {\n        \"implementation details\": \"VI. Calculation of Pathway Activity Scores across Different Cancer Types:\\nA. Calculation of mean expression levels:\\n   1. Calculate the mean expression level (Ei,j) for each of the 1,620 metabolic genes across cell lines within each cancer type.\\n   R\\n   Ei_j <- apply(z_scored_data, 2, mean)\\n   \\nB. Calculation of relative gene expression levels:\\n   1. Calculate the relative gene expression level (ri,j) as the ratio of Ei,j to its average over all cancer types.\\n   R\\n   ri_j <- Ei_j / mean(Ei_j)\\n   \\nC. Calculation of pathway activity scores:\\n   1. Calculate the pathway activity score (pt,j) for each metabolic pathway and cancer type as the weighted average of ri,j over all genes included in the pathway.\\n   R\\n   pt_j <- sapply(pathways, function(pathway) sum(ri_j[pathway]) / length(pathway))\\n   \\n2. Use a three-step procedure adapted from Xiao et al. to perform these calculations.\",\n        \"original text\": \"To systematically evaluate metabolic similarities and differences across cell lines representing diverse cancer types, we used RNA-sequencing data from the Cancer Cell Line Encyclopedia (CCLE).23 By including all cancer types of which five CCLE cell lines or more were available, we analyzed 1,341 cell lines spanning 41 major cancer types.\",\n        \"results\": \"Hierarchical clustering of relative activity scores for 73 significantly variable metabolic pathways across 41 cancer types revealed cancer-type-associated variations in the activity of pathways. Among the 85 KEGG metabolic pathways, 73 exhibited significantly increased or decreased activity in at least one cancer type.\",\n        \"results original text\": \"(A) Hierarchical clustering of relative activity scores for 73 significantly variable metabolic pathways across 41 cancer types. A metabolic pathway activity score of <1 for a cancer type represents reduced pathway activity in that cancer type in comparison with the average pathway activity across all cancer types; scores >1 represent increased activity; and a score of 1 represents activity levels equivalent to the average over all cancer types. Pairs of pathway/cancer type with significant pathway activity (p \\u2264 0.05) are highlighted with an asterisk.\"\n    },\n    \"step 7\": {\n        \"implementation details\": \"VII. Principal Component Analysis (PCA) on Pathway Activity Scores:\\n1. Perform PCA on pathway activity scores across 41 cancer types using the prcomp function in R.\\n   R\\n   pca_result <- prcomp(pathway_activity_scores, scale. = TRUE)\\n   summary(pca_result)\\n   \\n2. Compute the absolute sum of PCA loadings for each pathway over the first eight PCs to quantify the relative impact of each pathway on data variance.\\n   R\\n   pca_loadings <- abs(pca_result$rotation[, 1:8])\\n   pathway_variability <- rowSums(pca_loadings)\\n   \",\n        \"original text\": \"To identify those metabolic pathways that contribute most profoundly to cancer-type-associated variabilities, we performed principal component analysis (PCA) on pathway activity scores across 41 cancer types. The first eight principal components (PCs) captured >80% of the overall variance in data.\",\n        \"results\": \"Ranking of metabolic pathways based on the extent to which their heterogeneity is associated with cancer type revealed that pathways involved in lipid, amino acid, and vitamin metabolism, such as linoleic acid, phenylalanine and histidine metabolism, steroid hormone, glycosphingolipid biosynthesis, and ascorbate and aldarate metabolism, were among the top variable pathways. On the other hand, pathways with the least amount of overall variability across different cancer types were energy-producing and carbohydrate metabolism pathways, such as oxidative phosphorylation (Oxphos), tricarboxylic acid (TCA) cycle, pentose phosphate pathway, and N-glycan biosynthesis.\",\n        \"results original text\": \"(B) Ranking of metabolic pathways based on the extent to which their heterogeneity is associated with cancer type, evaluated by computing the absolute sum of principal component analysis (PCA) loadings for each pathway over the first eight PCs capturing >80% of overall variance in data. The top five and bottom five variable pathways are shown.\"\n    },\n    \"step 8\": {\n        \"implementation details\": \"VIII. Metabolomics Data Analysis and Visualization:\\n1. Analyze metabolomics data on 136 metabolites profiled for 875 CCLE cell lines representing 34 cancer types.\\n2. Perform UMAP clustering on the z-scored metabolite abundance data to identify clusters based on cancer types using the umap package in R.\\n   R\\n   library(umap)\\n   umap_result_metabolomics <- umap(z_scored_metabolite_data, n_neighbors = 20, min_dist = 0.3, metric = 'pearson')\\n   plot(umap_result_metabolomics)\\n   \\n3. Conduct enrichment analysis via MetaboAnalyst (https://www.metaboanalyst.ca/) to correlate metabolomics-based variable pathways with gene-expression-based variable pathways.\\n4. Use the latest version of MetaboAnalyst for enrichment analysis.\",\n        \"original text\": \"Next, we sought to perform a systematic statistical analysis to quantify these relationships at the level of individual metabolic pathways. To this end, we computed a score representing the activity of each of the 85 metabolic pathways for each cancer type relative to all cancer types using a three-step procedure adapted from Xiao et al.29 (see STAR Methods).\",\n        \"results\": \"UMAP analysis of metabolomics data revealed a clear separation between hematopoietic and solid-tissue cancers, an observation that agreed with metabolic gene-expression analysis. Focusing on the top 50% variable metabolites across cell lines of distinct cancer types, enrichment analysis via MetaboAnalyst showed a significant correlation between metabolomics-based variable pathways and gene-expression-based variable pathways (Pearson\\u2019s r = 0.4, p = 0.027).\",\n        \"results original text\": \"(D) UMAP analysis of data on 136 metabolites profiled for 875 CCLE cell lines11 (representing 34 cancer types) revealed a clear separation between hematopoietic and solid-tissue cancers (Figure S2E), an observation that agreed with metabolic gene-expression analysis. Using metabolite abundance alone, however, UMAP clustering did not reveal subtle cancer lineage-specific differences that were captured by the expression of 1,620 metabolic genes (Figure 1B). Nevertheless, focusing on the top 50% variable metabolites across cell lines of distinct cancer types (Figure S2F), followed by enrichment analysis via MetaboAnalyst,30 we observed a significant correlation between metabolomics-based variable pathways and gene-expression-based variable pathways (Pearson\\u2019s r = 0.4, p = 0.027) (Figure S2G).\"\n    }\n}",
    "Part 2": "{\n    \"Part 2\": \"Assessment of Oxphos state heterogeneity using single-cell and bulk RNA-sequencing methods\",\n    \"introduction\": \"This protocol outlines the steps for assessing Oxphos state heterogeneity using single-cell and bulk RNA-sequencing methods. The objectives are to determine the extent of cell line-to-cell line heterogeneity in metabolic pathways, calculate metabolic gene variability scores, identify variable metabolic pathways using GSEA, and analyze Oxphos state using single-cell RNA-sequencing data. Additionally, the impact of growth media and culture conditions on metabolic pathways will be evaluated, and cell-to-cell heterogeneity in Oxphos state will be analyzed.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Analysis of Cell Line-to-Cell Line Heterogeneity in Metabolic Pathways\\n\\n**Objective:** To determine the extent of cell line-to-cell line heterogeneity in each cancer type.\\n\\nA. Perform PCA on z-scored metabolic gene expression data within each cancer type using the prcomp function in R.\\n  1. Use RNA-sequencing data from the Cancer Cell Line Encyclopedia (23Q2 release).\\n  2. Use the following parameters: center = TRUE, scale. = TRUE, to ensure data normalization.\\n  3. Justification: Centering and scaling the data ensures that each gene contributes equally to the analysis, which is crucial for identifying true variability.\\n\\nB. Compute metabolic gene variability scores as the absolute sum of the PCA loading values across the top PCs accounting for at least 80% of the variance in data.\\n\\nC. Apply pre-ranked gene set enrichment analysis (GSEA) to the ranked lists of metabolic gene variability scores using the fgseaSimple function in the fgsea package in R.\\n  1. Use the following parameters: nperm = 1000.\\n  2. Justification: Using 1000 permutations provides a balance between computational efficiency and statistical robustness.\\n\\nD. Rank scores in descending order and run pre-rank GSEA using the fgseaSimple function in the fgsea package in R.\\n\\nE. Perform GSEA against the 85 KEGG metabolic pathways.\\n\\nF. Determine significant heterogeneity for a metabolic pathway if the GSEA generated FDR \\u2264 0.05.\\n\\n**Transitional Statement:** The next step involves calculating metabolic gene variability scores to quantify the extent of variability within each cancer type.\",\n        \"original text\": \"To determine the extent of cell line-to-cell line heterogeneity in each cancer type, we used a three-step procedure adapted from Xiao et al.29 Frist, we performed PCA on z-scored metabolic gene expression data within each cancer type. We computed metabolic gene variability scores as the absolute sum of the PCA loading values across the top PCs accounting for at least 80% of the variance in data. To identify which metabolic pathways were most variable across cell lines within each cancer type, we applied pre-ranked gene set enrichment analysis (GSEA) to the ranked lists of metabolic gene variability scores. Scores were ranked in descending order and ran in pre-rank GSEA using the fgseaSimple function in the fgsea package in R (1.20.0). GSEA was performed against the same 85 KEGG metabolic pathways. A cancer type was determined to be significantly heterogeneous for a metabolic pathway if the GSEA generated FDR \\u2264 0.05.\",\n        \"results\": \"Metabolic pathways enriched in genes with highest contribution (determined by PCA) to the metabolic heterogeneities among individual cell lines from different cancer types. Data are clustered based on \\u2212log10(FDR) values derived from GSEA. Pairs of pathway/cancer type with significant cell-line-to-cell-line heterogeneity (FDR \\u2264 0.05) are highlighted with an asterisk.\",\n        \"results original text\": \"(A) Metabolic pathways enriched in genes with highest contribution (determined by PCA) to the metabolic heterogeneities among individual cell lines from different cancer types. Data are clustered based on \\u2212log10(FDR) values derived from GSEA. Pairs of pathway/cancer type with significant cell-line-to-cell-line heterogeneity (FDR \\u2264 0.05) are highlighted with an asterisk.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Calculation of Metabolic Gene Variability Scores\\n\\n**Objective:** To compute metabolic gene variability scores for each cancer type.\\n\\nA. Compute metabolic gene variability scores as the absolute sum of the PCA loading values across the top PCs accounting for at least 80% of the variance in data using the prcomp function in R.\\n  1. Use the following parameters: center = TRUE, scale. = TRUE, to ensure data normalization.\\n  2. Justification: Centering and scaling the data ensures that each gene contributes equally to the analysis, which is crucial for identifying true variability.\\n\\n**Transitional Statement:** After calculating the variability scores, the next step is to identify which metabolic pathways are most variable across cell lines within each cancer type.\",\n        \"original text\": \"We computed metabolic gene variability scores as the absolute sum of the PCA loading values across the top PCs accounting for at least 80% of the variance in data.\",\n        \"results\": \"Metabolic pathways ranked according to the percentage of cancer types showing significant cell-line-to-cell-line heterogeneity.\",\n        \"results original text\": \"(B) Metabolic pathways ranked according to the percentage of cancer types showing significant cell-line-to-cell-line heterogeneity.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Gene Set Enrichment Analysis (GSEA) for Pathway Variability\\n\\n**Objective:** To identify which metabolic pathways are most variable across cell lines within each cancer type.\\n\\nA. Apply pre-ranked gene set enrichment analysis (GSEA) to the ranked lists of metabolic gene variability scores using the fgseaSimple function in the fgsea package in R.\\n  1. Use the following parameters: nperm = 1000.\\n  2. Justification: Using 1000 permutations provides a balance between computational efficiency and statistical robustness.\\n\\nB. Rank scores in descending order and run pre-rank GSEA using the fgseaSimple function in the fgsea package in R.\\n\\nC. Perform GSEA against the 85 KEGG metabolic pathways.\\n\\nD. Determine significant heterogeneity for a metabolic pathway if the GSEA generated FDR \\u2264 0.05.\\n\\n**Transitional Statement:** With the identification of variable metabolic pathways, we can now proceed to analyze Oxphos state using single-cell RNA-sequencing data.\",\n        \"original text\": \"To identify which metabolic pathways were most variable across cell lines within each cancer type, we applied pre-ranked gene set enrichment analysis (GSEA) to the ranked lists of metabolic gene variability scores. Scores were ranked in descending order and ran in pre-rank GSEA using the fgseaSimple function in the fgsea package in R (1.20.0). GSEA was performed against the same 85 KEGG metabolic pathways. A cancer type was determined to be significantly heterogeneous for a metabolic pathway if the GSEA generated FDR \\u2264 0.05.\",\n        \"results\": \"Distinct patterns of cell-line-to-cell-line variability in two representative metabolic pathways, ascorbate and aldarate metabolism (left) and oxidative phosphorylation (right), across indicated cancer types. Mean pathway transcript per million (TPM) levels and their median and interquartile ranges (IQR) across cell lines are highlighted.\",\n        \"results original text\": \"(C) Distinct patterns of cell-line-to-cell-line variability in two representative metabolic pathways, ascorbate and aldarate metabolism (left) and oxidative phosphorylation (right), across indicated cancer types. Mean pathway transcript per million (TPM) levels and their median and interquartile ranges (IQR) across cell lines are highlighted.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Single-Cell RNA-sequencing Data Analysis for Oxphos State\\n\\n**Objective:** To analyze Oxphos state using single-cell RNA-sequencing data.\\n\\nA. Data Preprocessing and Normalization:\\n1. Use CellRanger (v6.0.0, 10x Genomics) for sample multiplexing, read alignment, and feature-barcode matrix generation.\\n2. Exclude cells with mitochondrial gene expression exceeding 15% or an abnormal number of expressed genes (\\u2264200 or \\u22659,000).\\n  3. Justification: Excluding cells with high mitochondrial gene expression and abnormal gene counts ensures data quality by removing potentially stressed or dying cells.\\n\\nB. Clustering and Cell Type Identification:\\n1. Perform clustering and cell type identification using Seurat.\\n  a. Use the following parameters for clustering: resolution = 0.8.\\n  2. Justification: A resolution of 0.8 is chosen to balance between over-clustering and under-clustering, providing clear identification of cell types.\\n\\nC. Calculation of Oxphos State Scores:\\n1. Compute Oxphos state scores as the average of counts per million (CPM) values for the expression of Oxphos genes.\\n  2. Use single-cell RNA-sequencing data from Kinker et al.\\n\\n**Transitional Statement:** After analyzing the Oxphos state using single-cell RNA-sequencing data, we will evaluate the impact of growth media and culture conditions on metabolic pathways.\",\n        \"original text\": \"For the scRNA-seq samples new to this work, sample demultiplexing, read alignment to the GRCh38 human reference genome and generation of feature-barcode matrices were performed using CellRanger v.6.0.0 (10x Genomics). Cells with \\u226515% of reads mapped to mitochondrial genes and \\u2264200 or \\u22659,000 expressed genes were excluded from the analysis. Perform clustering and cell type identification using Seurat. Compute Oxphos state scores as the average of counts per million (CPM) values for the expression of Oxphos genes.\",\n        \"results\": \"Single-cell analysis of Oxphos state based on single-cell RNA-sequencing data from representative pancreatic adenocarcinoma (left) and colorectal adenocarcinoma (right) cell lines. Mean counts per million (CPM) scores for Oxphos genes were calculated for each single cell. The arbitrary threshold of 200 CPM (red dotted line) was used to determine the percentage of OxphosHigh and OxphosLow single cells for each cell line.\",\n        \"results original text\": \"(D) Single-cell analysis of Oxphos state based on single-cell RNA-sequencing data from representative pancreatic adenocarcinoma (left) and colorectal adenocarcinoma (right) cell lines. Mean counts per million (CPM) scores for Oxphos genes were calculated for each single cell. The arbitrary threshold of 200 CPM (red dotted line) was used to determine the percentage of OxphosHigh and OxphosLow single cells for each cell line.\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Evaluation of Growth Media and Culture Conditions on Metabolic Pathways\\n\\n**Objective:** To assess the impact of growth media and culture conditions on metabolic pathway activity.\\n\\nA. Analysis of Different Growth Media Compositions:\\n1. Compute relative metabolic pathway activity scores across groups of cell lines.\\n  a. Use RNA-sequencing data from the Cancer Cell Line Encyclopedia (23Q2 release).\\n2. Determine the strength of metabolic pathway associations with each of the 21 chemically distinct media compositions.\\n  3. Justification: Evaluating the impact of different growth media helps to understand how external factors influence metabolic pathway activity.\\n\\nB. Analysis of Different Culture Conditions:\\n1. Compute relative metabolic pathway activity scores across groups of cell lines.\\n  a. Use RNA-sequencing data from the Cancer Cell Line Encyclopedia (23Q2 release).\\n2. Determine the strength of metabolic pathway associations with each of the 4 different cell-culture conditions.\\n  3. Justification: Evaluating the impact of different culture conditions helps to understand how external factors influence metabolic pathway activity.\\n\\n**Transitional Statement:** With the evaluation of growth media and culture conditions, we can now analyze cell-to-cell heterogeneity in Oxphos state across cell lines.\",\n        \"original text\": \"To quantify the statistical contribution of growth conditions toward the observed cell-line-to-cell-line heterogeneity in metabolic pathways, we used the same approach as described above to compute relative metabolic pathway activity scores across groups of cell lines and determined the strength of metabolic pathway associations with each of the 21 chemically distinct media compositions or four different cell-culture conditions.\",\n        \"results\": \"Hierarchical clustering of relative activity scores for 73 significantly variable metabolic pathways across 21 chemically distinct growth media. A metabolic pathway activity score of <1 for a growth medium represents reduced pathway activity in that growth medium in comparison with the average pathway activity across all growth media; scores >1 represent increased activity; and a score of 1 represents activity levels equivalent to the average over all growth media. The percentage of cell lines grown in each of the 21 distinct growth media are shown in the barplot at the bottom.\",\n        \"results original text\": \"(A) Hierarchical clustering of relative activity scores for 73 significantly variable metabolic pathways across 21 chemically distinct growth media. A metabolic pathway activity score of <1 for a growth medium represents reduced pathway activity in that growth medium in comparison with the average pathway activity across all growth media; scores >1 represent increased activity; and a score of 1 represents activity levels equivalent to the average over all growth media. The percentage of cell lines grown in each of the 21 distinct growth media are shown in the barplot at the bottom.\"\n    },\n    \"step 6\": {\n        \"implementation details\": \"VI. Analysis of Cell-to-Cell Heterogeneity in Oxphos State\\n\\n**Objective:** To analyze cell-to-cell heterogeneity in Oxphos state across cell lines.\\n\\nA. Calculation of Single-Cell Oxphos State Scores:\\n1. Use single-cell RNA-sequencing data to calculate Oxphos state scores as the average of counts per million (CPM) values for the expression of Oxphos genes.\\n  a. Use single-cell RNA-sequencing data from Kinker et al.\\n  2. Justification: Using single-cell RNA-sequencing data allows for the assessment of heterogeneity at the single-cell level, providing a more detailed understanding of Oxphos state variability.\\n\\nB. Comparison of OxphosHigh and OxphosLow Cell Populations:\\n1. Define an arbitrary CPM threshold to separate OxphosHigh and OxphosLow cells.\\n2. Compare the frequency of OxphosHigh and OxphosLow cells in different cell lines.\\n  3. Justification: Defining a CPM threshold helps to categorize cells based on their Oxphos state, facilitating comparative analysis.\\n\",\n        \"original text\": \"To analyze cell-to-cell heterogeneity in Oxphos state across cell lines, single-cell RNA-sequencing data from Kinker et al.31 was used. Single-cell Oxphos state scores were computed as the average of counts per million (CPM) values for the expression of 101 Oxphos genes and reported for representative OxphosHigh and OxphosLow colorectal adenocarcinoma and pancreatic adenocarcinoma cell lines. An arbitrary CPM threshold of 200 was used to determine the percentage of OxphosHigh and OxphosLow single cells for each cell line.\",\n        \"results\": \"Single-cell analysis of Oxphos state based on single-cell RNA-sequencing data from representative pancreatic adenocarcinoma (left) and colorectal adenocarcinoma (right) cell lines. Mean counts per million (CPM) scores for Oxphos genes were calculated for each single cell. The arbitrary threshold of 200 CPM (red dotted line) was used to determine the percentage of OxphosHigh and OxphosLow single cells for each cell line.\",\n        \"results original text\": \"(D) Single-cell analysis of Oxphos state based on single-cell RNA-sequencing data from representative pancreatic adenocarcinoma (left) and colorectal adenocarcinoma (right) cell lines. Mean counts per million (CPM) scores for Oxphos genes were calculated for each single cell. The arbitrary threshold of 200 CPM (red dotted line) was used to determine the percentage of OxphosHigh and OxphosLow single cells for each cell line.\"\n    }\n}",
    "Part 3": "{\n    \"Part 3\": \"Multivariate modeling techniques to identify gene vulnerabilities associated with Oxphos state\",\n    \"step 1\": {\n        \"implementation details\": \"I. Introduction\\n(1) The objective of this protocol is to identify gene vulnerabilities associated with Oxphos state in cancer cell lines using multivariate modeling techniques. This involves calculating Oxphos state scores, performing feature selection using elastic net regularization, building a partial least-squares regression (PLSR) model, and conducting enrichment analysis.\\n(2) This protocol aims to reveal synthetically lethal associations that could guide the development of more precise and context-specific, metabolism-targeted cancer therapies.\",\n        \"original text\": \"N/A\",\n        \"results\": \"The study aims to systematically identify gene vulnerabilities associated with Oxphos state in cancer cell lines, revealing synthetically lethal associations that could guide more precise cancer therapeutic opportunities.\",\n        \"results original text\": \"In this paper, we used a combination of unsupervised and supervised multivariate analysis approaches to integrate transcriptomics data from hundreds of cancer cell lines with their gene-dependency scores and mutation profiles and thereby predict metabolic state-specific vulnerabilities across various tumor lineages and common oncogenic contexts.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Calculation of Oxphos State Scores across Cell Lines\\n(1) Download transcriptomics data from the Cancer Cell Line Encyclopedia (CCLE) (23Q2 release) available at https://depmap.org/portal/\\n(2) Calculate Oxphos state scores across cell lines by averaging the z-scores for the expression levels of 113 Oxphos genes.\\n(3) Order cell lines based on their Oxphos state scores and include only the top and bottom 33 percentiles for further analysis, resulting in 328 cell lines.\",\n        \"original text\": \"(1) We first calculated Oxphos-state scores across the cell lines, defined as the average of Z scores for the expression levels of 113 Oxphos genes. To amplify the impact of OxphosHigh and OxphosLow groups of cell lines in feature selection, we ordered cell lines based on their Oxphos-state scores and included only the top and bottom 33 percentiles, resulting in 328 cell lines.\",\n        \"results\": \"Oxphos state scores were successfully calculated for 328 cell lines, with the top and bottom 33 percentiles identified for further analysis.\",\n        \"results original text\": \"To amplify the impact of OxphosHigh and OxphosLow groups of cell lines in feature selection, we ordered cell lines based on their Oxphos-state scores and included only the top and bottom 33 percentiles, resulting in 328 cell lines.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Feature Selection using Elastic Net Regularization\\nA. Removal of minimally varying gene dependency scores\\n(1) Download DepMap gene dependency scores from https://depmap.org/portal/\\n(2) Calculate the interquartile range (IQR) for each gene dependency score across cell lines.\\n(3) Remove genes with dependency scores that vary minimally across OxphosHigh and OxphosLow cell lines, narrowing down the list of genes to those with IQR \\u2265 0.09.\\nB. Optimization of elastic net parameters\\n(1) Optimize the alpha (\\u03b1) parameter to control the weight of L1 and L2 penalties using 10-fold cross-validation. Test \\u03b1 values ranging from 0.1 to 0.9.\\n(2) Run 150 iterations of elastic net regularization with optimized parameters to identify significant genes. Use the glmnet package (version 4.1-7) in R for this process.\\nC. Selection of significant genes\\n(1) Select genes that appear in at least 50% of the 150 optimized elastic net iterations.\",\n        \"original text\": \"A. (1) As the first step of feature selection, we removed genes with dependency scores that varied minimally across OxphosHigh and OxphosLow cell lines, narrowing down the list of genes to 3,624.\\nB. (1) We then used elastic net regularization to select a subset of the remaining genes based on their association with the Oxphos-state score. We optimized the parameters of elastic net model and trained it over 150 iterations (using 10-fold cross-validation) using a randomly selected group of 296 cell lines out of 328 cell lines, leaving the other 32 cell lines to be used as a test set for independent validation.\\nC. (1) Two hundred genes appeared in at least 50% of all elastic net iterations.\",\n        \"results\": \"Elastic net regularization identified 200 significant genes that appeared in at least 50% of the 150 iterations, with optimized alpha parameters.\",\n        \"results original text\": \"Two hundred genes appeared in at least 50% of all elastic net iterations.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Partial Least-Squares Regression (PLSR) Modeling\\nA. Building the PLSR model\\n(1) Build a PLSR model using the identified gene dependency scores as input variables and Oxphos state scores as output variables. Use the plsregress function in MATLAB (version 2022b or 2023a).\\nB. Evaluation of model performance using cross-validation\\n(1) Evaluate the overall performance of the PLSR model based on the percentage of variance in Oxphos-state scores explained (R2) or predicted (Q2) by the variance in gene-dependency scores.\\n(2) Use leave-one-out cross-validation to assess the prediction accuracy of the model.\\n(3) Correlate the true Oxphos-state scores and the state scores predicted by the PLSR model using Pearson\\u2019s correlation analysis.\",\n        \"original text\": \"A. (1) To quantify the relative importance of 200 gene dependencies in predicting the Oxphos state of each cell line, we built a partial least-squares regression (PLSR) model.\\nB. (1) The overall performance of the PLSR model was evaluated based on the percentage of variance in Oxphos-state scores explained (R2) or predicted (Q2) by the variance in gene-dependency scores.\\n(2) To further evaluate the model performance, we correlated the true Oxphos-state scores and the state scores predicted (based on leave-one-out) by the PLSR model.\",\n        \"results\": \"The PLSR model explained 81.9% of the variance in Oxphos-state scores (R2) and predicted 63.3% of the variance (Q2) using leave-one-out cross-validation. The model showed a Pearson's correlation coefficient of 0.9 (p = 4.8 \\u00d7 10\\u2212111) between true and predicted Oxphos-state scores.\",\n        \"results original text\": \"The overall performance of the PLSR model was evaluated based on the percentage of variance in Oxphos-state scores explained (R2) or predicted (Q2) by the variance in gene-dependency scores. The model revealed high performance with R2 of 81.9% and Q2 of 63.3% (using leave-one-out cross-validation) for the first four partial-least-square (PLS) components. To further evaluate the model performance, we correlated the true Oxphos-state scores and the state scores predicted (based on leave-one-out) by the PLSR model, which led to a Pearson\\u2019s correlation coefficient of 0.9 (p = 4.8 \\u00d7 10\\u2212111) across 296 cell lines.\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Identification of Pan-Cancer Gene Vulnerabilities\\n(1) Identify the most significant predictors of OxphosHigh and OxphosLow states by calculating the variable importance in projection (VIP) scores along the first four PLS components.\\n(2) Use permutation testing and Pearson\\u2019s correlation analysis to identify significant gene vulnerabilities. Perform the permutation test by randomly shuffling the Oxphos-state labels (High and Low) across cell lines 8,000 times.\\n(3) Calculate the median differences between dependency scores for OxphosHigh and OxphosLow subgroups of cell lines.\",\n        \"original text\": \"(1) To identify those gene vulnerabilities that most significantly predicted the Oxphos state, we calculated the variable importance in projection (VIP) scores along the first four PLS components.\\n(2) We then used a combination of permutation testing and Pearson\\u2019s correlation analysis to identify 53 out of 64 genes, which not only showed significant differences in their dependencies between subgroups of OxphosHigh and OxphosLow cell lines (p \\u2264 0.05), but also retained their correlations with Oxphos-state score when evaluated across the complete list of 495 cell lines (false discovery rate [FDR] \\u2264 0.05).\",\n        \"results\": \"The analysis identified 12 gene vulnerabilities strongly associated with the OxphosHigh state and 15 gene vulnerabilities strongly associated with the OxphosLow state, with significant differences in dependencies between subgroups.\",\n        \"results original text\": \"Among these genes, we focused on those whose median dependencies between subgroups of OxphosHigh and OxphosLow cell lines were larger than 0.15. This led to a final list of 12 gene vulnerabilities strongly associated with the OxphosHigh state and 15 gene vulnerabilities strongly associated with the OxphosLow state.\"\n    },\n    \"step 6\": {\n        \"implementation details\": \"VI. Enrichment Analysis of Cellular Components and Pathways\\n(1) Import the list of selected genes into Enrichr to search for potential enrichment of cellular components, biological processes, and pathways associated with the selected gene vulnerabilities. Use the Enrichr web-based tool (https://maayanlab.cloud/Enrichr/).\\n(2) Select the relevant databases for enrichment analysis, such as Gene Ontology (GO) Biological Processes, KEGG Pathways, and Reactome Pathways.\\n(3) Analyze the results and identify the most significantly enriched terms (FDR \\u2264 0.05).\",\n        \"original text\": \"(1) We imported these genes into Enrichr to search for potential enrichment of cellular components, biological processes, and pathways associated with the selected gene vulnerabilities.\",\n        \"results\": \"Enrichment analysis revealed that OxphosHigh cell lines were vulnerable to gene knockouts associated with mitochondrial membrane, respiratory electron transport chain, and histone acetyltransferase complexes. OxphosLow cell lines were vulnerable to knockouts associated with Rho GTPase signaling, focal adhesion, cell-matrix junctions, lysosomes, and the trans-Golgi network.\",\n        \"results original text\": \"We found that OxphosHigh cell lines were vulnerable to gene knockouts associated with mitochondrial membrane, respiratory electron transport chain (ETC), and histone acetyltransferase complexes. OxphosLow cell lines, on the other hand, were vulnerable to knockouts associated with Rho guanosine triphosphatase (GTPase) signaling, focal adhesion, cell-matrix junctions, lysosomes, and the trans-Golgi network.\"\n    },\n    \"step 7\": {\n        \"implementation details\": \"VII. Conclusion\\n(1) Summarize the key steps and expected outcomes of the protocol. Highlight the importance of identifying gene vulnerabilities associated with Oxphos state in cancer cell lines and the potential implications for targeted cancer therapies.\",\n        \"original text\": \"N/A\",\n        \"results\": \"The protocol successfully identified gene vulnerabilities associated with Oxphos state in cancer cell lines, revealing synthetically lethal interactions that could guide the development of more precise and context-specific, metabolism-targeted cancer therapies.\",\n        \"results original text\": \"Investigating the mechanisms underlying these relationships can inform the development of more precise and context-specific, metabolism-targeted cancer therapies.\"\n    }\n}",
    "Part 4": "{\n    \"Part 4\": \"Statistical analyses to reveal synthetically lethal associations between Oxphos state, driver mutations, and tissue context\",\n    \"introduction\": \"This section outlines the steps to analyze gene dependencies associated with Oxphos state in cancer cell lines. The protocol includes the analysis of gene dependencies in specific tissue types and driver mutations, permutation testing for statistical significance, identification of enhanced gene dependencies, and comparison of gene dependencies across cancer types and mutations.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Analysis of Gene Dependencies in Specific Tissue Types and Driver Mutations:\\n1. Use DepMap (CCLE) data, including transcriptomics, CRISPR knockout screen, mutation profiles, metabolomics data, and associated metadata for cancer cell lines (23Q2 release). Source: https://depmap.org/portal/\\n2. Comparison of median gene dependency between OxphosHigh and OxphosLow subgroups among cell lines grouped based on cancer type or occurrence of the top 25 commonly mutated driver genes.\\n3. Focus on the top eleven driver genes which carried mutations in at least 15 tested cell lines, including TP53, KRAS, PIK3CA, BRAF, APC, ARID1A, PTEN, NF1, FAT1, KMT2D, and CREBBP.\\n4. Specify the criteria used to select the top eleven driver genes, such as their frequency of occurrence in the dataset and relevance to the study.\",\n        \"original text\": \"To determine whether any of the Oxphos-state-associated gene vulnerabilities were enriched more significantly in cell lines originating from specific tissue types or those carrying specific driver mutations, we compared median gene dependency between OxphosHigh and OxphosLow subgroups among cell lines grouped based on cancer type or occurrence of the top 25 commonly mutated driver genes. Among these genes, we focused on the top eleven, which carried mutations in at least 15 tested cell lines, including TP53, KRAS, PIK3CA, BRAF, APC, ARID1A, PTEN, NF1, FAT1, KMT2D, CREBBP.\",\n        \"results\": \"Focusing on OxphosHigh-state-specific dependencies, we found that mutations in the tumor suppressor PTEN were consistently associated with significant increases in dependency on genes involved in the mitochondrial membrane respiratory chain, including COQ4, NDUFB8, NDUFS1, and NDUFC2. KRAS and APC mutations were associated with enhanced dependency on DNM1L, and the effect of EP300 gene knockout in OxphosHigh cell lines was significantly greater in the presence of mutations in chromatin regulators KMT2D or ARID1A. We also identified cases where an OxphosHigh-state-specific gene dependency was enriched in cell lines from a specific cancer type, such as EP300 dependency in melanoma and OET cell lines and MRPL58 dependency in IBC and HNSCC cell lines. Focusing on OxphosLow-state-specific dependencies, we found that multiple gene dependencies associated with cytoskeleton regulation and vesicle trafficking (such as ARHGEF7, RAB6A, and NCKAP1) were significantly enriched in pancreatic adenocarcinoma cell lines. The most frequent oncogenic events correlating with OxphosLow-state-specific gene dependencies were FAT1 mutations that were associated with enhanced dependency on ARHGEF7, ENO1, and ZFP36L1, and ARID1A mutations that were associated with increased dependency on RAB6A, RRAGC, TIPARP, and ZFP36L1.\",\n        \"results original text\": \"Focusing on OxphosHigh-state-specific dependencies, we found that mutations in the tumor suppressor PTEN were consistently associated with significant increases in dependency on genes involved in the mitochondrial membrane respiratory chain, including COQ4, NDUFB8, NDUFS1, and NDUFC2. KRAS and APC mutations were associated with enhanced dependency on DNM1L, and the effect of EP300 gene knockout in OxphosHigh cell lines was significantly greater in the presence of mutations in chromatin regulators KMT2D or ARID1A. We also identified cases where an OxphosHigh-state-specific gene dependency was enriched in cell lines from a specific cancer type, such as EP300 dependency in melanoma and OET cell lines and MRPL58 dependency in IBC and HNSCC cell lines. Focusing on OxphosLow-state-specific dependencies, we found that multiple gene dependencies associated with cytoskeleton regulation and vesicle trafficking (such as ARHGEF7, RAB6A, and NCKAP1) were significantly enriched in pancreatic adenocarcinoma cell lines. The most frequent oncogenic events correlating with OxphosLow-state-specific gene dependencies were FAT1 mutations that were associated with enhanced dependency on ARHGEF7, ENO1, and ZFP36L1, and ARID1A mutations that were associated with increased dependency on RAB6A, RRAGC, TIPARP, and ZFP36L1.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Permutation Testing for Statistical Significance:\\nA. Random shuffling of Oxphos state labels:\\n1. Randomly shuffle the Oxphos state labels (High and Low) across cell lines participating in each comparison.\\n2. Perform 8,000 permutations for each cancer type and 4,000 permutations for each mutation.\\n3. Use R version 4.1.1 and the permutationTest MATLAB function (https://github.com/lrkrol/permutationTest) for the analysis.\\nB. Calculation of permutation p values:\\n1. Compute permutation p values to assess the statistical significance of the observed differences in gene dependency.\\n2. Set a significance cutoff of p \\u2264 0.01 to identify significant associations.\\n3. Specify the random seed used for reproducibility.\",\n        \"original text\": \"To assess the statistical significance of the observed differences in gene dependency, we performed permutation testing by randomly shuffling the Oxphos-state labels (High and Low) across cell lines participating in each comparison and computing permutation p values. We then used p \\u2264 0.01 as the significance cutoff to identify mutations and tissue types associated with enhanced Oxphos-state-specific gene dependencies relative to pan-cancer analysis.\",\n        \"results\": \"Statistical enrichment of OxphosHigh-associated mitochondrial gene vulnerabilities in cell lines associated with specific tissue types or driver mutations. Enrichment is considered significant if the median gene-dependency difference (\\u0394 gene dependency) between OxphosHigh and OxphosLow subgroups of cell lines associated with a cancer type or driver mutation is significantly larger than the median gene-dependency difference between OxphosHigh and OxphosLow groups regardless of cancer type and mutation (i.e., pan-cancer median difference level highlighted by the black circle and dotted line). Statistical significance of median differences was determined by empirical p values computed by permutation testing (p \\u2264 0.01; red dotted line).\",\n        \"results original text\": \"Statistical enrichment of OxphosHigh-associated mitochondrial gene vulnerabilities in cell lines associated with specific tissue types or driver mutations. Enrichment is considered significant if the median gene-dependency difference (\\u0394 gene dependency) between OxphosHigh and OxphosLow subgroups of cell lines associated with a cancer type or driver mutation is significantly larger than the median gene-dependency difference between OxphosHigh and OxphosLow groups regardless of cancer type and mutation (i.e., pan-cancer median difference level highlighted by the black circle and dotted line). Statistical significance of median differences was determined by empirical p values computed by permutation testing (p \\u2264 0.01; red dotted line).\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Identification of Enhanced Gene Dependencies in Specific Contexts:\\n1. Identify mutations and tissue types associated with enhanced Oxphos-state-specific gene dependencies relative to pan-cancer analysis.\\n2. Use a significance cutoff of p \\u2264 0.01 to determine the enhanced dependencies.\\n3. Highlight specific mutations and tissue types that show significant enrichment in gene dependencies.\\n4. Provide any potential troubleshooting tips or common issues that might arise during the experiment, along with suggested solutions. Example: If the permutation test results are not reproducible, ensure that the random seed is set for reproducibility.\",\n        \"original text\": \"We then used p \\u2264 0.01 as the significance cutoff to identify mutations and tissue types associated with enhanced Oxphos-state-specific gene dependencies relative to pan-cancer analysis.\",\n        \"results\": \"The impact of PTEN mutation on mitochondrial gene dependencies in OxphosHigh and OxphosLow cell lines. Statistical significance of median differences was determined by empirical p values computed by permutation testing.\",\n        \"results original text\": \"The impact of PTEN mutation on mitochondrial gene dependencies in OxphosHigh and OxphosLow cell lines. Statistical significance of median differences was determined by empirical p values computed by permutation testing.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Comparison of Gene Dependencies across Cancer Types and Mutations:\\nA. Focus on Specific Driver Mutations:\\n1. Focus on the impact of specific driver mutations (e.g., PTEN) on gene dependencies in OxphosHigh and OxphosLow cell lines.\\n2. Compare the median gene dependencies across different cancer types and mutations to identify significant associations.\\nB. Comparison Across Cancer Types:\\n1. Reference specific figures or tables in the paper that illustrate these comparisons to provide visual context. For example, reference Figure 6A for the statistical enrichment of OxphosHigh-associated mitochondrial gene vulnerabilities.\\n2. Ensure that the terminology used is consistent with the paper. Use the term 'Oxphos state' consistently throughout the protocol.\\n3. Verify that the links and accession numbers provided are correct and accessible.\",\n        \"original text\": \"Focusing on OxphosHigh-state-specific dependencies, we found that mutations in the tumor suppressor PTEN were consistently associated with significant increases in dependency on genes involved in the mitochondrial membrane respiratory chain, including COQ4, NDUFB8, NDUFS1, and NDUFC2. KRAS and APC mutations were associated with enhanced dependency on DNM1L, and the effect of EP300 gene knockout in OxphosHigh cell lines was significantly greater in the presence of mutations in chromatin regulators KMT2D or ARID1A. We also identified cases where an OxphosHigh-state-specific gene dependency was enriched in cell lines from a specific cancer type, such as EP300 dependency in melanoma and OET cell lines and MRPL58 dependency in IBC and HNSCC cell lines. Focusing on OxphosLow-state-specific dependencies, we found that multiple gene dependencies associated with cytoskeleton regulation and vesicle trafficking (such as ARHGEF7, RAB6A, and NCKAP1) were significantly enriched in pancreatic adenocarcinoma cell lines. The most frequent oncogenic events correlating with OxphosLow-state-specific gene dependencies were FAT1 mutations that were associated with enhanced dependency on ARHGEF7, ENO1, and ZFP36L1, and ARID1A mutations that were associated with increased dependency on RAB6A, RRAGC, TIPARP, and ZFP36L1.\",\n        \"results\": \"Statistical enrichment of OxphosHigh-associated EP300 dependency in cell lines associated with specific tissue types or driver mutations. Statistical significance of median differences was determined by empirical p values computed by permutation testing.\",\n        \"results original text\": \"Statistical enrichment of OxphosHigh-associated EP300 dependency in cell lines associated with specific tissue types or driver mutations. Statistical significance of median differences was determined by empirical p values computed by permutation testing.\"\n    },\n    \"summary\": \"In this section, we analyzed gene dependencies associated with Oxphos state in cancer cell lines, focusing on specific tissue types and driver mutations. We performed permutation testing to assess statistical significance, identified enhanced gene dependencies, and compared gene dependencies across cancer types and mutations. Our findings revealed significant associations between Oxphos state, driver mutations, and specific gene vulnerabilities, providing insights into potential therapeutic targets.\"\n}",
    "Part 5": "{\n    \"Part 5\": \"Experimental validation of PTEN loss predicting increased dependency on mitochondrial respiratory chain in OxphosHigh tumor cells\",\n    \"step 1\": {\n        \"implementation details\": \"I. Analysis of Cancer Therapeutics Response Portal (CTRP) Data\\n   A. Sensitivity measurements based on area under the dose-response curve (AUC):\\n      1. Use CTRP data from the Cancer Therapeutics Response Portal (https://depmap.org/portal/) to analyze sensitivity of 799 genetically characterized cancer cell lines to 545 small-molecule probes and drugs.\\n      2. Download the dataset and preprocess the data using appropriate software (e.g., R or Python).\\n      3. Ensure data normalization and quality control steps are performed, such as checking for missing values and outliers.\\n   B. Comparison of median sensitivity between OxphosLow and OxphosHigh cell lines:\\n      1. Define groups of OxphosLow and OxphosHigh cell lines based on whether their Oxphos-state scores were ranked within the top or bottom 33 percentiles.\\n      2. Compare the median sensitivity of OxphosLow and OxphosHigh cell lines to each tested small molecule based on AUC measurements.\\n      3. Within the OxphosHigh group, compare the median sensitivity of PTEN wild-type (PTENWT) and PTEN-mutated (PTENMut) subgroups.\\n   C. Statistical significance of differences in median sensitivity:\\n      1. Determine statistical significance using a one-sided Wilcoxon rank-sum test.\\n      2. Use appropriate software (e.g., R or Python) to perform the statistical analysis and ensure proper documentation of the code and parameters used.\\n   D. Refer to Figure 7A for the results of the CTRP data analysis.\",\n        \"original text\": \"A) Analysis of the Cancer Therapeutics Response Portal (CTRP) data, including sensitivity measurements (evaluated based on area under the dose-response curve [AUC]) for 545 small-molecule probes and drugs in 799 cell lines. For each compound, the difference in median sensitivity (\\u0394 drug AUC) between OxphosLow and OxphosHigh subgroups of cell lines is shown against the difference in median sensitivity between OxphosHigh/PTENWT and OxphosHigh/PTENMut subgroups. Statistical significance was determined using a one-sided Wilcoxon rank-sum test.\",\n        \"results\": \"Among all small molecules tested, oligomycin A, an inhibitor of mitochondrial ATP synthase (complex V), exhibited the strongest differential effect on OxphosHigh cell lines relative to OxphosLow cell lines (median difference = 0.9; p = 0.04) while being more effective in the PTENMut subgroup than in PTENWT cells (median difference = 1.7; p = 0.07). Neopeltolide, a natural product recently discovered as an inhibitor of mitochondrial ATP synthesis, was also among the top four compounds with increased median efficacy in OxphosHigh cell lines compared with OxphosLow cell lines (median difference = 0.9) while also being more effective in the PTENMut subgroup than in PTENWT cells (median difference = 0.9).\",\n        \"results original text\": \"Among all small molecules tested, we found oligomycin A, an inhibitor of mitochondrial ATP synthase (complex V),42 to exhibit the strongest differential effect on OxphosHigh cell lines relative to OxphosLow cell lines (median difference = 0.9; p = 0.04) while being more effective in the PTENMut subgroup than in PTENWT cells (median difference = 1.7; p = 0.07). Although not statistically significant, neopeltolide, a natural product which was recently discovered as an inhibitor of mitochondrial ATP synthesis,43 was also among the top four compounds with increased median efficacy in OxphosHigh cell lines compared with OxphosLow cell lines (median difference = 0.9) while also being more effective in the PTENMut subgroup than in PTENWT cells (median difference = 0.9).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Overall Survival Analysis of Glioma Patients with PTEN Mutations\\n   A. Use clinical history, mutation profiles, and gene expression data from the GLASS Consortium (https://www.cbioportal.org/study/summary?id=difg_glass_2019).\\n      1. Download and preprocess the dataset using appropriate software (e.g., R or Python).\\n      2. Perform quality control measures to ensure data accuracy, such as verifying mutation status and checking for data consistency.\\n   B. Classify diffuse glioma patients based on their PTEN mutation status, resulting in PTENMut and PTENWT groups.\\n   C. Compare overall survival of PTENMut versus PTENWT patients using log-rank (Mantel-Cox) test.\\n      1. Use software such as R or Python to perform the statistical analysis.\\n      2. Document the code and parameters used for reproducibility.\\n   D. The results of the overall survival analysis are discussed in the Results section under 'Overall Survival Analysis of Glioma Patients with PTEN Mutations.'\",\n        \"original text\": \"B) Overall survival analysis of glioma patients with PTEN-mutated (PTENMut) or PTEN wild-type (PTENWT) tumors. Statistical significance was determined by two-sided log-rank (Mantel-Cox) test.\",\n        \"results\": \"Overall survival analysis revealed that tumors from 64 out of 222 patients (i.e., ~29% of patients) carried PTEN mutations, including truncating, missense, in-frame, and splice-site mutations. The presence of such mutations in tumors was associated with significantly shorter overall survival in glioma patients.\",\n        \"results original text\": \"Tumors from 64 out of 222 patients (i.e., ~29% of patients) carried PTEN mutations, including truncating, missense, in-frame, and splice-site mutations. The presence of such mutations in tumors was associated with significantly shorter overall survival in glioma patients.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Transcriptome-Wide Co-Expression Analysis in Glioma Tumors\\n   A. Perform transcriptome-wide co-expression analysis across 79 glioma tumor samples with RNA-sequencing data.\\n      1. Download the dataset from the GLASS Consortium (https://www.cbioportal.org/study/summary?id=difg_glass_2019) and preprocess using appropriate software (e.g., R or Python).\\n      2. Perform quality control measures, such as filtering out low-quality samples and normalizing gene expression data.\\n   B. Use Spearman\\u2019s correlation analysis to rank transcripts based on the association of their abundance with PTEN expression using software such as R or Python.\\n      1. Ensure that correlation coefficients and p-values are calculated accurately.\\n   C. Import the list of significantly correlated transcripts into Enrichr (https://maayanlab.cloud/Enrichr/) to identify cellular components and biological processes associated with loss of PTEN.\\n      1. Document the code and parameters used for the analysis.\\n   D. The results of the transcriptome-wide co-expression analysis are discussed in the Results section under 'Transcriptome-Wide Co-Expression Analysis in Glioma Tumors.'\",\n        \"original text\": \"C) The top gene ontology (GO) biological processes (FDR \\u2264 0.05) associated with genes whose expression negatively correlated with PTEN mRNA levels across 79 glioma tumors.\",\n        \"results\": \"The most significantly enriched components and biological processes associated with loss of PTEN were mitochondrial membrane, mitochondrial respiratory chain complex, proton-transporting ATP synthase complex, and cellular respiration. These results suggest that glioma tumors with loss of PTEN expression exhibit a higher expression of components of the mitochondrial ETC and ATP synthase complex.\",\n        \"results original text\": \"The most significantly enriched components and biological processes were mitochondrial membrane, mitochondrial respiratory chain complex, proton-transporting ATP synthase complex, and cellular respiration. These results suggest that glioma tumors with loss of PTEN expression exhibit a higher expression of components of the mitochondrial ETC and ATP synthase complex.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Single-Cell RNA-sequencing Analysis of Glioma Tumors\\n   A. Data preprocessing and normalization:\\n      1. Use single-cell RNA-sequencing dataset of genetically profiled patient-derived glioblastoma tumors (https://cellxgene.cziscience.com/collections/999f2a15-3d7e-440b-96ae-2c806799c08c).\\n      2. Classify malignant cells based on PTEN mutation status, resulting in PTENMut and PTENWT groups.\\n      3. Perform quality control measures to exclude low-quality cells, such as excluding cells with mitochondrial gene expression exceeding 15% or an abnormal number of expressed genes (\\u2264200 or \\u22659,000).\\n      4. Normalize the data using appropriate methods (e.g., log-normalization).\\n   B. Calculation of mean expression scores for ETC components:\\n      1. Calculate mean log-normalized levels of transcripts representing individual components of the ETC, including complex I\\u2013IV and ATP synthase.\\n      2. Compare the abundance of transcripts between PTENMut and PTENWT cells using permutation tests.\\n      3. Document the code and parameters used for the analysis.\\n   C. The results of the single-cell RNA-sequencing analysis are discussed in the Results section under 'Single-Cell RNA-sequencing Analysis of Glioma Tumors.'\",\n        \"original text\": \"D) Single-cell analysis of PTENMut vs. PTENWT glioma tumors. Mean log-normalized levels of transcripts representing individual components of the electron transport chain (ETC), including complex I\\u2013IV and ATP synthase, between PTENMut (n = 10,268) and PTENWT (n = 23,229) malignant cells. Statistical significance was determined by one-sided permutation test.\",\n        \"results\": \"Significantly higher expression levels for complexes I, III, IV, and ATP synthase genes were observed among PTENMut cells and a lower level of cell-to-cell variability in their expression (as evaluated by IQR) in comparison with PTENWT cells. These results reveal a notable upward shift in the expression of mitochondrial respiratory chain complex genes among PTENMut glioma cells that is consistent with their enhanced dependency on ETC in comparison with PTENWT tumor cells.\",\n        \"results original text\": \"We observed significantly higher expression levels for complexes I, III, IV, and ATP synthase genes among PTENMut cells and a lower level of cell-to-cell variability in their expression (as evaluated by IQR) in comparison with PTENWT cells. These results reveal a notable upward shift in the expression of mitochondrial respiratory chain complex genes among PTENMut glioma cells that is consistent with their enhanced dependency on ETC in comparison with PTENWT tumor cells.\"\n    },\n    \"step 5\": {\n        \"implementation details\": \"V. Experimental Validation using Primary Mouse Glioma Cell Lines\\n   A. Establishment and maintenance of primary mouse glioma cell lines:\\n      1. Derive primary mouse PTENWT and PTENNull glioma cells from previously established glioma mouse models with inactivating mutations in Trp53 and Nf1, and additional PTENflox/PTENflox alleles for PTENNull cells.\\n      2. Dissociate tumor tissue with Papain solution (20 units/mL) and maintain primary glioma cells on Poly-D-lysine-treated flasks in Neurobasal media supplemented with 2% B27, 10 ng/mL PDGF-AA, and 1 ng/mL NT-3.\\n      3. Perform regular media changes and monitor cell growth.\\n   B. Western blotting for PTEN protein levels:\\n      1. Lyse cells in RIPA buffer and measure protein concentrations using BCA assay.\\n      2. Perform western blotting using PTEN and \\u03b2-tubulin antibodies to confirm PTEN status.\\n      3. Document the conditions used for western blotting, such as antibody concentrations and incubation times.\\n   C. The results of the western blotting are discussed in the Results section under 'Experimental Validation using Primary Mouse Glioma Cell Lines.'\",\n        \"original text\": \"E) PTEN protein levels assessed by western blotting in two PTENNull (14014 and 13532) and two PTENWT (13591 and 12204) primary mouse glioma cell lines.\",\n        \"results\": \"PTEN protein levels were confirmed by western blotting in two PTENNull (14014 and 13532) and two PTENWT (13591 and 12204) primary mouse glioma cell lines.\",\n        \"results original text\": \"PTEN protein levels assessed by western blotting in two PTENNull (14014 and 13532) and two PTENWT (13591 and 12204) primary mouse glioma cell lines.\"\n    },\n    \"step 6\": {\n        \"implementation details\": \"VI. Drug Sensitivity Analysis via Dose-Response Measurements\\n   A. Experimental setup for drug sensitivity analysis:\\n      1. Seed primary mouse glioma cells in 96-well plates at a density of 10,000 cells per well and treat with various concentrations of ETC inhibitors (Gboxin, metformin, IACS-010759, oligomycin A, antimycin A).\\n      2. Include vehicle control wells for comparison.\\n      3. Prepare drug solutions at appropriate concentrations and ensure proper storage.\\n   B. Measurement of cell viability and calculation of normalized growth rates:\\n      1. Measure live cell count at three time points (0, 96, and 168 h) using Hoechst 33342 staining and Operetta CLS High-Content Imaging System.\\n      2. Calculate net growth rates and normalize to vehicle control to determine drug sensitivity.\\n      3. Compare normalized growth rates between PTENNull and PTENWT cell lines using two-way ANOVA.\\n      4. Document the code and parameters used for the analysis.\\n   C. The results of the drug sensitivity analysis are discussed in the Results section under 'Drug Sensitivity Analysis via Dose-Response Measurements.'\",\n        \"original text\": \"F) Dose-dependent changes in normalized growth rates of PTENNull and PTENWT primary mouse glioma cell lines following treatment with Gboxin and metformin. The average net growth rates were calculated from measurements of live cell count at three time points (0, 96, and 168 h). Statistical significance of the effect of each drug on PTENNull vs. PTENWT cell lines was determined by two-way ANOVA, conducted specifically on the second-lowest dose of each drug (i.e., 0.64 \\u03bcM for Gboxin and 1 mM for metformin).\",\n        \"results\": \"Both metformin and Gboxin were able to reduce cellular growth and induce tumor cell killing in a dose-dependent manner in all four cell lines tested. However, PTENNull cells (14014 and 13532) were significantly more sensitive than PTENWT cells (13591 and 12204) to both compounds at their lowest concentrations tested, i.e., 0.64 \\u03bcM Gboxin and 1 mM metformin. At higher concentrations, however, the difference in drug sensitivity narrowed, and at the highest concentration (i.e., 6.4 \\u03bcM Gboxin and 10 mM metformin) it disappeared.\",\n        \"results original text\": \"Both metformin and Gboxin were able to reduce cellular growth and induce tumor cell killing in a dose-dependent manner in all four cell lines tested (Figure S7E). However, PTENNull cells (14014 and 13532) were significantly more sensitive than PTENWT cells (13591 and 12204) to both compounds at their lowest concentrations tested, i.e., 0.64 \\u03bcM Gboxin and 1 mM metformin (Figure 7F). At higher concentrations, however, the difference in drug sensitivity narrowed, and at the highest concentration (i.e., 6.4 \\u03bcM Gboxin and 10 mM metformin) it disappeared.\"\n    },\n    \"step 7\": {\n        \"implementation details\": \"VII. Overexpression of PTEN in Human Glioblastoma Cells\\n   A. Generation of stable PTEN-overexpressing cell lines:\\n      1. Infect U251MG human glioblastoma cells with Precision LentiORF PTEN or RFP control viral particles at a multiplicity of infection (MOI) of 0.3 in antibiotic and serum-free growth media.\\n      2. Add 10 \\u03bcg/mL polybrene and centrifuge the plate at 2,500 rpm for 30 min at 37\\u00b0C.\\n      3. Add 3 mL of antibiotic-free growth media 5 hours post-transduction.\\n      4. Replace media with growth media supplemented with 5 \\u03bcg/mL Blasticidin S Hydrochloride at 48 hours post-transduction to select positive clones.\\n      5. Perform regular media changes and monitor cell growth.\\n   B. Comparison of drug sensitivity in PTEN-overexpressing and control cells:\\n      1. Seed PTEN-overexpressing (PTENOE) and control (Control) U251MG cells in 96-well plates at a density of 3,000 and 1,500 cells per well, respectively.\\n      2. Treat cells with various concentrations of ETC inhibitors (IACS-010759, oligomycin A, antimycin A, Gboxin, metformin).\\n      3. Measure live cell count at three time points (0, 96, and 144 h) using Hoechst 33342 staining and Operetta CLS High-Content Imaging System.\\n      4. Calculate normalized growth rates to determine drug sensitivity.\\n      5. Compare normalized growth rates between PTENOE and control cells using two-way ANOVA.\\n      6. Document the code and parameters used for the analysis.\\n   C. The results of the drug sensitivity analysis are discussed in the Results section under 'Overexpression of PTEN in Human Glioblastoma Cells.'\",\n        \"original text\": \"G) PTEN protein levels assessed by western blotting in stable U251MG human glioma cells overexpressing PTEN (PTENOE) or vector control (Control). H) Normalized growth rates measured in U251MG cells overexpressing PTEN (PTENOE) or vector control (Control) following treatment with indicated concentrations of IACS-010759, oligomycin A, antimycin A, Gboxin, and metformin. The average net growth rates were calculated from measurements of live cell count at three time points (0, 96, and 144 h). Statistical significance of the effect of each drug on PTENOE vs. control cells was determined by two-way ANOVA.\"\n    }\n}"
}