{
    "Part 1": "{\n    \"Part 1\": \"Cellular Composition of Dedifferentiated Liposarcomas\",\n    \"step 1\": {\n        \"implementation details\": \"I. Patient Sample Collection and Processing:\\n\\u2460 Sample Collection:\\n(1) Fresh surgical specimens were collected from 11 primary untreated DDLPS patients undergoing surgery at Institut Curie, with 3 males and 8 females, aged 42\\u201372.\\n\\u2461 Histological Analysis:\\n(1) Histological distinction of paired well-differentiated (WD) and dedifferentiated (DD) components was performed by pathologists during the macroscopic examination of the fresh surgical specimen.\\n\\u2462 Sample Preservation:\\n(1) Suspected WD and DD components were placed in RPMI medium and sent for RNA sequencing analyses.\\n\\u2463 Single-Cell Preparation:\\n(1) Paired WD and DD components were immediately processed for single-cell suspension preparation within 1 hour after tumor resection. This includes cutting the tissue into small pieces and dissociating it in a CO2-independent medium with Liberase TL and DNase to ensure optimal cell viability.\\n\\n*Note: It is crucial to monitor the time from resection to processing to maintain cell viability. Common pitfalls in this step include inadequate dissociation leading to poor cell yield or viability.\",\n        \"original text\": \"Anonymized tumoral and non-tumoral samples were collected from patients undergoing surgery at Institut Curie (Paris, France). All patients provided written informed consent. The diagnosis of DDLPS had been established in all cases on pre-operative biopsies and later confirmed on the surgical specimen. Fresh surgical specimens were analyzed by a pathologist after surgery in the Institut Curie Pathology Department. Suspected WD and DD components were placed in RPMI and sent for RNAseq analyses.\",\n        \"results\": \"scRNA-seq analysis resulted in the characterization of a total of 102,753 single cells, with 36,326 cells from DDLPS-WD components and 31,017 cells from DDLPS-DD components. This dataset allowed for the identification of 42 main clusters representing various cell types, including tumor and non-tumor populations.\",\n        \"results original text\": \"After quality control and doublets removal, the transcriptomes of 102,753 single cells (SC) were obtained, including 36,326 SC from 10 DDLPS-WD components and 31,017 SC from 9 DDLPS-DD components.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Single-Cell RNA Sequencing Analysis:\\n\\u2460 scRNA-seq Procedure:\\n(1) scRNA-seq was performed using the 10X Genomics platform, targeting 3000 recovered cells per sample.\\n\\u2461 Sample Processing:\\n(1) Single-cell suspensions were created from freshly collected tumor samples, ensuring cell viability by processing them within 1 hour after resection.\\n\\u2462 Library Preparation:\\n(1) Sequencing libraries were constructed using Single Cell 3' Reagent Kit (NextGem kit, 10X Genomics) according to the manufacturer's protocol, and libraries were sequenced on an Illumina NovaSeq 6000, with 100 bp paired-end reads. Quality control measures should be implemented to assess the integrity and concentration of RNA prior to library preparation.\\n\\n*Note: Ensure to follow the manufacturer's guidelines for library preparation closely to avoid common errors such as incomplete reactions or contamination.\",\n        \"original text\": \"Single-cell suspensions were established from freshly collected PDX tumors and cultured in \\u03b1MEM medium... Libraries were sequenced on an Illumina NovaSeq 6000 sequencing platform.\",\n        \"results\": \"The single-cell RNA sequencing successfully identified distinct cellular populations and provided transcriptomic profiles necessary for the characterization of the tumor microenvironment and cellular heterogeneity within DDLPS.\",\n        \"results original text\": \"This study provides insights into DDLPS cellular composition and genomic evolution and illuminates opportunities for drug development.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Identification of Tumor and Non-Tumor Cell Populations:\\n\\u2460 Clustering and Analysis:\\n(1) Unbiased clustering of the single-cell data was performed using the Seurat package, identifying 42 main clusters, which were categorized into 10 main cellular subfamilies including tumor cells, lymphoid cells, myeloid cells, etc.\\n\\u2461 Differential Gene Expression:\\n(1) Differential gene expression analysis was performed with Seurat's FindAllMarkers function using a Wilcoxon rank sum test with Bonferroni correction to identify marker genes for each cluster and their functional characteristics. Ensure that significant markers are relevant to the objectives of understanding cellular heterogeneity in DDLPS.\\n\\n*Note: Review the clustering parameters and consider adjusting resolution settings to optimize the identification of rare cell populations.\",\n        \"original text\": \"Unbiased clustering on principal component analysis (PCA)-reduced data using Seurat identified 42 main clusters. Gene expression profiles and expression of canonical markers enabled grouping these clusters into 10 main cellular subfamilies... Differential gene expression analysis was performed with Seurat's FindAllMarkers function.\",\n        \"results\": \"Analysis revealed 10 main cellular subfamilies, including distinct populations of tumor cells, myeloid cells, lymphoid cells, and others, highlighting the complexity and heterogeneity of the DDLPS microenvironment.\",\n        \"results original text\": \"We identify a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue.\"\n    },\n    \"step 4\": {\n        \"implementation details\": \"IV. Integration with Additional Adipocytic Tumors and Normal Tissues:\\n\\u2460 Sample Integration:\\n(1) The dataset was integrated with additional adipocytic tumors (WDLPS, lipoma) and normal adipose tissues for comparative analysis.\\n\\u2461 Batch Effect Correction:\\n(1) Harmony was used to correct for batch effects and preserve the biological signal during integration, ensuring accurate representation of the integrated dataset. This integration is crucial for contextualizing findings from DDLPS with other adipocytic tumor types.\\n\\n*Note: Regularly check for and address batch effects during integration to maintain data integrity and reliability.\",\n        \"original text\": \"Fresh samples were collected from patients undergoing surgery at Institut Curie (Paris, France). All patients provided written informed consent... After quality control and doublets removal, the transcriptomes of 102,753 single cells (SC) were obtained.\",\n        \"results\": \"The integration of DDLPS data with other adipocytic tumors revealed significant differences in immune infiltration and cellular composition, emphasizing the unique characteristics of DDLPS compared to other adipocytic malignancies.\",\n        \"results original text\": \"The extent of the dedifferentiated component is variable. Most frequently, it is composed of intermediate- to high-grade, non-lipogenic undifferentiated and spindle cells.\"\n    }\n}",
    "Part 2": "{\n    \"Part 2\": \"Diversity of Myeloid and Lymphoid Cells in Adipocytic Tumors\",\n    \"step 1\": {\n        \"implementation details\": \"I. Characterization of Myeloid Cell Populations\\n\\u2460 Using Single-Cell RNA Sequencing:\\n(1) Myeloid cells were identified based on expression of canonical markers, including CD163 (1:100 dilution, Novocastra) for M2-like macrophages and CD14 (1:200 dilution, Dako) for classical monocytes, in samples obtained from 11 DDLPS patients undergoing surgery. The samples were collected immediately after surgical resection and processed within one hour to ensure viability.\\n(2) Ten clusters of distinct myeloid and related cell subtypes were identified using Seurat, including three clusters of dendritic cells (cDC1, cDC2, pDC), three clusters of monocytes (classical, intermediate, non-classical), one cluster of myeloid-derived suppressor cells (MDSC), one cluster of tumor-associated neutrophils (TAN), and two clusters of tumor-associated macrophages (TAM). Each cluster's gene expression profiles were analyzed to determine their relative proportions in the tumor microenvironment. The sequencing was performed on a 10X Genomics platform, yielding transcriptomes from a total of 102,753 single cells.\\n\",\n        \"original text\": \"Myeloid cells, including CD163+ M2-like macrophages, have previously been shown to be the most prevalent immune cell populations in soft tissue sarcomas and are thought to be major contributors to the immunosuppressive TME in these tumors. Ten clusters of distinct myeloid and related cell subtypes were identified based on gene expression profiles and expression of canonical markers. They included: 1. Three clusters of dendritic cells (DC), 2. three clusters of monocytes, 3. one cluster of myeloid-derived suppressor cells (MDSC), 4. one cluster of tumor-associated neutrophils (TAN), and 5. two clusters of tumor-associated macrophages (TAM). The relative proportions of different myeloid cell populations among all myeloid cells according to histological subtypes were analyzed.\",\n        \"results\": \"The analysis revealed that myeloid cells constituted the most abundant immune cell populations in DDLPS tumors, with CD163+ M2-like macrophages and myeloid-derived suppressor cells being significantly enriched in the DD component compared to the WD component. This finding supports the hypothesis that the DD component has a more immunosuppressive environment.\",\n        \"results original text\": \"Moreover, within DDLPS, the immunosuppressive cell populations of M2-like TAM, MDSC, and TAN seemed enriched in the DD component compared to the WD component of the same tumors.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Characterization of Lymphoid Cell Populations\\n\\u2460 Using Single-Cell RNA Sequencing:\\n(1) Eight distinct clusters of lymphoid cells were identified based on expression of canonical markers such as CD3 (1:100 dilution, Dako) for T cells and MS4A1 (1:200 dilution, Abcam) for B cells. The lymphoid populations included plasma cells, B lymphocytes, CD4+ T cells, CD8+ T cells, and natural killer (NK) cells. The analysis included samples processed from both WD and DD components to allow for a comparative assessment.\\n(2) The proportions of lymphoid populations were analyzed across the DDLPS samples, specifically comparing the WD and DD components using statistical software (e.g., R) to assess significance and to determine the role of immune cell infiltration in tumor progression.\\n\",\n        \"original text\": \"Lymphoid cells, including T and B lymphocytes, have previously been shown to play a major role in soft tissue sarcoma TME and in the response to immune checkpoint inhibitors. Eight distinct clusters of lymphoid cells were identified based on gene expression profiles and expression of canonical markers. They included: 1. one cluster of plasma cells, 2. one cluster of B lymphocytes, 3. three clusters of T lymphocytes, including CD4+ T cells, 4. one cluster of innate-like, FCGR3A+ CD8+ cells (NKT cells), and 5. two clusters of NK cells.\",\n        \"results\": \"The analysis demonstrated that CD4+ Treg and exhausted CD8+ T cells were significantly more abundant in the DD component compared to the WD component, indicating a shift towards a more immunosuppressive microenvironment. This finding suggests that the immune landscape may influence tumor behavior and patient outcomes.\",\n        \"results original text\": \"Moreover, CD8+ T cells in the DD component expressed higher levels of exhaustion markers, including PDCD1, TIGIT, LAG3, and CD27, as well as higher levels of apoptosis markers, including CASP4 and FASLG, reflecting their impaired cytotoxic activity.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Comparison of Immune Cell Infiltrates in DDLPS Components\\n\\u2460 Quantitative Analysis:\\n(1) The proportions of various immune cell populations in both WD and DD components were quantified using statistical analysis, specifically employing Chi-squared tests to assess the significance of observed differences in immune cell infiltrates between paired WD and DD samples. The analysis included immune cell markers for T cells (CD3), regulatory T cells (FOXP3), and other myeloid and lymphoid markers obtained from the scRNA-seq data. Statistical software (e.g., R or GraphPad) was utilized for the analysis to ensure robust statistical validation.\\n\\n\\u2461 Spatial Analysis:\\n(1) In situ multiplex immunofluorescence was performed to visualize the spatial distribution of immune cells in WD and DD components, allowing for assessment of their proximity to tumor cells using antibodies against markers like CD3, FOXP3, and others. The multiplexing approach facilitates the analysis of multiple markers simultaneously, providing a comprehensive view of the immune microenvironment.\\n(2) The spatial arrangement was analyzed using imaging software (e.g., Vectra or Halo) to quantify the presence of immune cells relative to tumor cells and to identify clustering patterns, which may provide insights into the functional state of the immune cells in relation to the tumor microenvironment.\\n\",\n        \"original text\": \"To address whether the differences in the TME composition of DDLPS-WD and DD components were associated to coexistence of transcriptomically-distinct tumor cell populations, we next focused on tumor cells from DDLPS samples. The comparison of immune cell infiltrates across tumor components was supported by quantitative analyses and spatial analysis using multiplex immunofluorescence.\",\n        \"results\": \"Quantitative analyses revealed significant differences in the immune cell infiltrates between the WD and DD components, with a higher proportion of immunosuppressive myeloid cells and regulatory T cells in the DD component. These findings highlight the potential role of the immune landscape in tumor progression and treatment response.\",\n        \"results original text\": \"In situ multiplex immunofluorescence reinforced these findings, with significantly higher proportions of CD4+ FOXP3+ Treg cells among all CD4+ T cells and of CD8+ PD1+ exhausted T cells among all CD8+ T cells in the DD part compared to the WD part.\"\n    }\n}",
    "Part 3": "{\n    \"Part 3\": \"Tumor Cell Heterogeneity in DDLPS\",\n    \"introduction\": \"In this section, we aim to characterize the tumor cell heterogeneity in dedifferentiated liposarcoma (DDLPS) by identifying distinct tumor cell populations through single-cell RNA sequencing (scRNA-seq) and analyzing their functional pathways. This analysis will enhance our understanding of the cellular composition and the tumor microenvironment (TME), which is critical for developing targeted therapeutic strategies.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Identification of Tumor Cell Clusters (MDM2 and CDK4 Expression):\\n\\u2460 Single-cell RNA sequencing (scRNA-seq) data from 24,000 DDLPS tumor cells was processed using Seurat (version X.X.X) to identify distinct tumor cell populations based on expression profiles of MDM2 and CDK4.\\n\\u2461 The tumor cells were characterized by high expression of MDM2 and CDK4, and clustered into 6 main populations based on their gene expression signatures and identified chromosomal amplification of chromosome 12q using InferCNV.\\n\\u2462 UMAP visualization was performed to display the clustering of tumor cells, utilizing the first 50 principal components calculated from 3000 variable genes, with a resolution setting of 0.5 for the Louvain clustering algorithm. Quality control measures included filtering out cells with fewer than 200 genes detected and removing doublets using DoubletFinder.\",\n        \"original text\": \"To address whether the differences in the TME composition of DDLPS-WD and DD components were associated to coexistence of transcriptomically-distinct tumor cell populations, we next focused on tumor cells from DDLPS samples. 24,000 cells distributed into 6 main clusters were confidently labeled as DDLPS tumor cells based on overexpression of MDM2 and CDK4 and identification of chromosome 12q amplification using InferCNV (Fig. 3A and Supplementary Figs. 10, 11).\",\n        \"results\": \"The analysis revealed that the most abundant cluster in DDLPS-WD components was the adipocytic differentiation cluster, which gathered 38% of all tumor cells from WD components, whereas cells from DDLPS-DD components were mostly found in the invasion and angiogenesis clusters, which gathered 45% and 15% of all cells from the DD components, respectively (Fig. 3C).\",\n        \"results original text\": \"The most abundant cluster in DDLPS-WD components was the adipocytic differentiation cluster, which gathered 38% of all tumor cells from WD components, whereas cells from DDLPS-DD components were mostly found in the invasion and angiogenesis clusters, which gathered 45% and 15% of all cells from the DD components, respectively (Fig. 3C).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Pathway Analysis of Tumor Cell Populations:\\n\\u2460 Differential gene expression analysis was performed on the identified tumor cell populations to classify them into specific pathways including adipocytic differentiation, stemness, extracellular matrix remodeling, hypoxia, angiogenesis, and invasion.\\n\\u2461 Pathway enrichment was assessed using the Toppfun tool, focusing on genes significantly over-expressed in different clusters, with a significance threshold set at a false discovery rate (FDR) of less than 0.05. This analysis was performed using the 800 most variable genes identified across the entire dataset, highlighting the biological roles of the identified pathways in the context of DDLPS.\",\n        \"original text\": \"Gene expression signatures and pathway analysis enabled us to gather these clusters into 6 main pathways: 1. adipocytic differentiation; 2. stemness; 3. extracellular matrix remodeling; 4. hypoxia; 5. angiogenesis, and 6. invasion (Fig. 3B and Supplementary Data 9).\",\n        \"results\": \"Pathway analysis confirmed the presence of distinct tumor cell populations characterized by different biological functions, with pathways highlighting the significant roles of adipocytic differentiation and stemness being especially prominent in WD components.\",\n        \"results original text\": \"Gene expression signatures and pathway analysis enabled us to gather these clusters into 6 main pathways: 1. adipocytic differentiation; 2. stemness; 3. extracellular matrix remodeling; 4. hypoxia; 5. angiogenesis, and 6. invasion (Fig. 3B and Supplementary Data 9).\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Comparison of Tumor Cell Composition between WD and DD Components:\\n\\u2460 The proportions of different tumor cell populations identified in the WD and DD components were compared using Chi-square tests to determine significant differences in their composition. The analysis included assessing the frequency of each tumor cell type across the paired WD and DD samples.\\n\\u2461 UMAP visualizations were utilized to illustrate the distribution of tumor cells across WD and DD components, highlighting differences in cellular composition and their associated pathways, with statistical significance set at p < 0.05. This analysis was conducted using the integrated scRNA-seq dataset, ensuring robust statistical evaluation of the findings.\",\n        \"original text\": \"The most abundant cluster in DDLPS-WD components was the adipocytic differentiation cluster, which gathered 38% of all tumor cells from WD components, whereas cells from DDLPS-DD components were mostly found in the invasion and angiogenesis clusters, which gathered 45% and 15% of all cells from the DD components, respectively (Fig. 3C).\",\n        \"results\": \"Statistical analysis revealed significant differences in the composition of tumor cell populations between the WD and DD components, further confirming the distinct biological characteristics associated with each component.\",\n        \"results original text\": \"The most abundant cluster in DDLPS-WD components was the adipocytic differentiation cluster, which gathered 38% of all tumor cells from WD components, whereas cells from DDLPS-DD components were mostly found in the invasion and angiogenesis clusters, which gathered 45% and 15% of all cells from the DD components, respectively (Fig. 3C).\"\n    }\n}",
    "Part 4": "{\n    \"Part 4\": \"DDLPS Origin from Adipocyte Progenitors\",\n    \"step 1\": {\n        \"implementation details\": \"I. Identification of Tumor Adipocyte Stem Cells (ASCs)\\n\\u2460 Single-Cell RNA Sequencing: Paired samples of well-differentiated (WD) and dedifferentiated (DD) components from primary DDLPS tumors were analyzed using single-cell RNA sequencing (scRNA-seq) according to 10X Genomics protocols, targeting a goal of recovering approximately 3000 cells per sample.\\n\\u2461 Quality Control: Post-sequencing quality control was performed by filtering out low-quality cells (minimum of 200 genes per cell, minimum of 3 cells expressing each gene, and maximum 20% mitochondrial gene expression).\\n\\u2462 Marker Analysis: Tumor cells from DDLPS-WD were selected and analyzed for the expression of canonical adipocyte stem cell markers, including CD55, CD34, and CD44. Specific antibodies (e.g., anti-CD55 from Cell Signaling, ref 31759, dilution 1:600) were utilized, and assays should include appropriate controls and validation steps. Troubleshooting tips include checking for antibody specificity and ensuring optimal cell viability during processing.\",\n        \"original text\": \"We identify a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue.\",\n        \"results\": \"We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution.\",\n        \"results original text\": \"We identify a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Genomic Profiling of Tumor Cells\\n\\u2460 Whole Genome Sequencing: The DNA from paired WD and DD components of DDLPS tumors was extracted using a phenol/chloroform method and subjected to shallow whole genome sequencing (shWGS) for analysis of Copy Number Variations (CNVs) and Single Nucleotide Variations (SNVs).\\n\\u2461 Library Preparation: Libraries were prepared using the Agilent SureSelect CD Curie CGP panel, targeting 571 genes, and sequenced on an Illumina NovaSeq 6000 instrument to achieve an average depth of 1500X. Ensure to include specific parameters used during library preparation and sequencing runs, such as the number of cycles and the quality control metrics for the libraries.\\n\\u2462 Bioinformatics Analysis: Genomic profiles were analyzed using bioinformatics tools such as Facets for CNV analysis. Focus on the presence of recurrent alterations, specifically the 12q amplification containing MDM2 and CDK4, and include variant calling parameters such as a minimum mapping quality of 0 and base quality of 15. Troubleshooting might involve checking for adequate coverage and ensuring proper alignment of sequencing reads.\",\n        \"original text\": \"To confirm the scRNAseq findings at the genomic level, tumor DNA from 10 paired WD and DD DDLPS samples were extracted and submitted to shallow Whole Genome Sequencing for analysis of CNVs and to targeted Next Generation Sequencing using the SureSelect CD Curie CGP panel (Agilent).\",\n        \"results\": \"The median number of CNVs detected across 296 segmented chromosomal regions was 14 in DDLPS-WD samples, and 26 in DDLPS-DD samples. The only recurrent shared alteration in all pairs was the 12q amplification containing MDM2 and CDK4.\",\n        \"results original text\": \"The median number of CNVs detected across 296 segmented chromosomal regions was 14 (range 7\\u201373) in DDLPS-WD samples, and 26 (range 7\\u201376) in DDLPS-DD samples.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Comparison of Genomic Alterations in WD and DD Components\\n\\u2460 CNV and SNV Analysis: The genomic alterations identified in the WD and DD components were analyzed for shared and private alterations using bioinformatics software like Facets. Assess the median and range of alterations per component, focusing on statistical significance for observed differences. Ensure to document the criteria used to define shared versus private alterations clearly.\\n\\u2461 Clonal Evolution Assessment: The presence of private and shared alterations was evaluated to understand the clonal evolution of the tumor components. Statistical methods, including Chi-squared tests, should be employed to assess the significance of the findings and to relate these alterations back to the evolutionary history of DDLPS. Include details about the sample size and any specific thresholds used for statistical significance.\",\n        \"original text\": \"Analysis of CNVs in each paired WD and DD DDLPS components showed that the median number of shared CNVs between pairs was 11; the only recurrent shared alteration in all pairs was the 12q amplification containing MDM2 and CDK4.\",\n        \"results\": \"Analysis showed that paired WD and DD components harbor private CNVs and SNVs, indicating early genomic divergence and independent clonal evolution.\",\n        \"results original text\": \"Analysis of CNVs in each paired WD and DD DDLPS components showed that the median number of shared CNVs between pairs was 11, and the only recurrent shared alteration in all pairs was the 12q amplification containing MDM2 and CDK4.\"\n    }\n}",
    "Part 6": "{\n    \"Part 6\": \"DD Tumor Cells Retain Biological Properties of Progenitors\",\n    \"step 1\": {\n        \"implementation details\": \"I. Characterization of Tumor Cell Differentiation Properties (Adipogenic and Osteogenic Assays):\\n\\u2460 Single-cell suspensions were established from freshly collected patient-derived xenograft (PDX) tumors of dedifferentiated liposarcoma (DDLPS) and cultured in \\u03b1MEM medium supplemented with 10% FBS and 1% Penicillin/streptomycin.\\n\\u2461 For adipogenic differentiation, cells were treated with a complete adipogenic cocktail (ADC) consisting of 66 nM insulin, 3 \\u00b5M rosiglitazone, 0.1 \\u00b5g/ml transferrin, 1 nM T3, 100 nM hydrocortisone, and 1% Penicillin/streptomycin for 14 days, with media changed every 3 days. For osteogenic differentiation, cells were treated with StemMACS OsteoDiff medium for 21 days, with media changed every 3 days.\\n\\u2462 The differentiation was assessed using RT-qPCR for adipogenic marker FABP4 and osteogenic markers, as well as staining with Bodipy for lipid accumulation (indicating adipogenic differentiation) and Alizarin red for calcium deposits (indicating osteogenic differentiation), ensuring to include appropriate controls for each assay. **Each assay will be performed in triplicate to ensure statistical validity, and results will be compared to appropriate controls.**\",\n        \"original text\": \"To address whether these tumor ASPC found in the WD component of DDLPS could be the progenitors of DDLPS, we compared the Copy Number Variations (CNVs) of tumor ASPC to the ones of other tumor cells in matched WD and DD components from 4 DDLPS patients...\",\n        \"results\": \"In all four PDX models, tumor cells showed striking pluripotent properties and were able to differentiate into both lineages as shown by the induction of expression of genes indicative of differentiation, and positive staining with Bodipy or Alizarin red dyes, indicative of adipocytic and osteogenic differentiation, respectively.\",\n        \"results original text\": \"Next Generation Sequencing of PDX tumor DNA con\\ufb01rmed genomic pro\\ufb01les in accordance with DDLPS, with 12q ampli\\ufb01cation containing MDM2 and CDK4 in all models. Single-cell suspensions of the PDX were obtained, and cells were subsequently cultivated ex vivo in the presence of adipocytic differentiation cocktail (ADC) or osteogenic differentiation cocktail (ODC) for 14 or 21 days, respectively, before RT-qPCR analysis and speci\\ufb01c staining.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Evaluation of TGF-\\u03b2 Pathway Effects on Tumor Cells (including statistical methods):\\n\\u2460 PDX tumor cells were cultured in the presence of TGF-\\u03b2 (10 ng/ml) and TGF-\\u03b2 receptor inhibitors SB431542 (10 \\u00b5M) or galunisertib (10 \\u00b5M).\\n\\u2461 The effects of TGF-\\u03b2 on adipogenic differentiation were assessed by comparing lipid accumulation (using Bodipy staining) in treated and untreated cells, ensuring to carry out the experiment in triplicate for statistical validity.\\n\\u2462 RT-qPCR was conducted to measure the expression of FABP4 and other relevant markers in the presence of TGF-\\u03b2 and its inhibitors, with statistical analyses including paired t-tests to compare the proportions of differentiated cells across conditions, ensuring a significance level of p < 0.05. **The rationale for using these statistical methods is based on the need to determine significant differences in differentiation outcomes between treated and untreated groups.**\",\n        \"original text\": \"To investigate whether these tumor ASPC found in the WD component of DDLPS could be the progenitors of DDLPS, we compared the Copy Number Variations (CNVs) of tumor ASPC to the ones of other tumor cells in matched WD and DD components from 4 DDLPS patients...\",\n        \"results\": \"TGF-\\u03b2 treatment significantly inhibited the adipocytic differentiation properties of tumor cells, whereas TGF-\\u03b2 receptor inhibitors SB431542 and galunisertib restored adipocytic differentiation in all four PDX models.\",\n        \"results original text\": \"Moreover, TGF-\\u03b2 increased the proliferative properties of SIL10AS tumor cells whereas SB431542 and galunisertib decreased cell proliferation.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. In Vivo Assessment of Tumor Progenitor Properties (PDX Models):\\n\\u2460 Patient-derived xenografts (PDXs) were established from DDLPS tumors and characterized histologically for consistency with human disease, documenting tumor characteristics during transplantation to ensure accurate representation.\\n\\u2461 Tumor cells were isolated from the PDXs and subjected to differentiation assays as described in step I, including adipogenic and osteogenic differentiation assays, with appropriate controls included for comparison.\\n\\u2462 The presence of tumor adipocyte stem cells was evaluated using immunohistochemical staining for MDM2, CD55, CD44, and ALDH1 in the PDX models, with quantification of the proportion of these cells using appropriate software for image analysis to ensure precise measurement. **The quantification process will include setting thresholds for positive staining based on controls to ensure accurate representation of stem cell populations.**\",\n        \"original text\": \"To investigate whether these tumor ASPC found in the WD component of DDLPS could be the progenitors of DDLPS, we compared the Copy Number Variations (CNVs) of tumor ASPC to the ones of other tumor cells in matched WD and DD components from 4 DDLPS patients...\",\n        \"results\": \"Immunohistochemical staining confirmed the presence of MDM2+CD55+ cells within the WD component of DDLPS tumors, demonstrating that these cells represent a small fraction of the tumor population.\",\n        \"results original text\": \"Quanti\\ufb01cation of the proportion of these cells detected by multiplex immuno\\ufb02uorescence revealed that they represented between 0.5% and 1.2% of all MDM2+ tumor cells and between 0.2% and 0.6% of the total cells found in tumor samples.\"\n    }\n}"
}