{
    "Part 1": "{\n    \"Part 1\": \"Human Specimens and Cell Lines\",\n    \"step 1\": {\n        \"implementation details\": \"I. Collection of tissue specimens and adjacent normal tissues:\\n\\u2460 Tissue specimens were obtained from the Tissue Bank of Fudan University Shanghai Cancer Center.\\n\\u2461 A total of 8 cases of dedifferentiated liposarcoma (DDL) for RNA sequencing analysis and 46 cancer specimens for immunohistochemical analysis were selected, along with 12 adjacent normal tissues (ANTs).\\n\\u2462 Specimens were chosen based on clinical diagnosis and confirmed by pathology.\\n\\u2463 After surgical excision, specimens were sliced into small pieces of approximately 0.5 cm and mixed with 1 ml of RNAlater\\u00ae to preserve RNA integrity.\\n\\u2464 The samples were stored at -80\\u00b0C for future use.\\n\\u2465 Informed signed consent was obtained from all patients, and the study was approved by the Institutional Review Board (IRB) of our cancer center (IRB number: 050432-4-1911D). These specimens will be used for RNA sequencing and immunohistochemical analysis to evaluate CCNDBP1 expression levels.\",\n        \"original text\": \"The tissue specimens, including 8 cases of cancer tissues for sequencing analysis, 46 cancer specimens for immunohistochemical analysis, and 12 adjacent normal tissues (ANTs), were obtained from the Tissue Bank of Fudan University Shanghai Cancer Center.\",\n        \"results\": \"The expression of CCNDBP1 in tissues of DDL was significantly lower than that in the ANT. The IHC images were analyzed based on the gray intensity, and the average optical density (AOD) value of each image was obtained. The expression levels of CCNDBP1 in the 12 cases of DDL and their corresponding ANT were analyzed according to the AOD value, with statistically significant differences (P = 0.0007).\",\n        \"results original text\": \"We detected the expression of CCNDBP1 in 46 DDL samples and 12 corresponding adjacent normal tissues (ANTs) by immunohistochemistry (IHC). We found the expression of CCNDBP1 in tissues of DDL was significantly lower than that in the ANT.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Cell lines used in the study:\\n\\u2460 LPS853 and LPS510 cell lines were utilized, both generously gifted from Professor Yuexiang Wang of Shanghai Institute of Nutrition and Health, Chinese Academy of Sciences, and Professor Jonathan A. Fletcher of the Department of Pathology, Brigham and Women's Hospital, Harvard Medical School.\\n\\u2461 LPS853 cells exhibited higher CCNDBP1 expression levels, while LPS510 cells had lower levels.\\n\\u2462 Both cell lines were cultured in DMEM culture medium (Gibco, USA) containing 10% fetal bovine serum at 37\\u00b0C in a humidified atmosphere with 5% CO2.\\n\\u2463 These cell lines were selected for their contrasting levels of CCNDBP1 expression, making them suitable models for studying the role of CCNDBP1 in dedifferentiated liposarcoma.\",\n        \"original text\": \"LPS853 and LPS510 cell lines were a generous gift from Professor Yuexiang Wang of Shanghai Institute of Nutrition and Health, Chinese Academy of Sciences (Shanghai Branch) and Professor Jonathan A. Fletcher of the Department of Pathology, Brigham and Women\\u2019s Hospital, Harvard Medical School.\",\n        \"results\": \"LPS853 cells had a higher CCNDBP1 protein and mRNA expression level compared to LPS510 cells. The significant difference in CCNDBP1 expression levels between these two cell lines supports the use of LPS853 and LPS510 as experimental models to study the role of CCNDBP1 in dedifferentiated liposarcoma.\",\n        \"results original text\": \"The CCNDBP1 protein and mRNA levels in LPS853 cells were higher than those in LPS510 cells.\"\n    }\n}",
    "Part 10": "{\n    \"Part 10\": \"Cell Apoptosis Assay\",\n    \"introduction\": {\n        \"implementation details\": \"This assay is designed to evaluate the apoptotic effects of CCNDBP1 on dedifferentiated liposarcoma (DDL) cells. The results will contribute to understanding the role of CCNDBP1 in regulating cell death pathways.\",\n        \"original text\": \"\"\n    },\n    \"step 1\": {\n        \"implementation details\": \"I. Sample Preparation:\\n\\u2460 Collect approximately 1-2 million cells from treated and control groups.\\n\\u2461 Centrifuge cells at 1,500 rpm for 5 minutes.\\n\\u2462 Resuspend cells in 1 mL of phosphate-buffered saline (PBS).\",\n        \"original text\": \"The cells were trypsinized and suspended, followed by centrifugation at 1,500 rpm for 5 min.\",\n        \"results\": \"The total apoptosis rate declined in comparison to that in the untransfected LPS853 cells (P = 0.0046), from 4.37 \\u00b1 0.17% to 3.30 \\u00b1 0.29%; the decrease was mainly seen in late apoptosis cells (P = 0.0012), from 2.73 \\u00b1 0.32% to 1.47 \\u00b1 0.40%.\",\n        \"results original text\": \"We found that at 48 h after siRNA transfection, the total apoptosis rate declined in comparison to that in the untransfected LPS853 cells (P = 0.0046), from 4.37 \\u00b1 0.17% to 3.30 \\u00b1 0.29%; the decrease was mainly seen in late apoptosis cells (P = 0.0012), from 2.73 \\u00b1 0.32% to 1.47 \\u00b1 0.40%.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Staining Procedure:\\n\\u2460 Mix collected cells with 5 \\u00b5L of propidium iodide (PI) and 5 \\u00b5L of Annexin V Staining Kit (Sangon, China) according to the manufacturer's instructions.\\n\\u2461 Incubate the mixture at room temperature in the dark for 15 minutes. Ensure that the concentrations of PI and Annexin V are according to the manufacturer's recommendations.\",\n        \"original text\": \"Subsequently, the cells were collected, mixed with propidium Iodide (PI) and Annexin V Staining Kit (Sangon, China), incubated at room temperature in the dark for 15 min.\",\n        \"results\": \"The total apoptosis rate of LPS510 increased significantly after CCNDBP1 overexpression (P < 0.0001), from 6.84 \\u00b1 0.36% to 11.54 \\u00b1 0.48%.\",\n        \"results original text\": \"In addition, CCNDBP1 overexpression increases the total apoptosis rate of LPS510 (P < 0.0001, Figure 5D), from 6.84 \\u00b1 0.36% to 11.54 \\u00b1 0.48%.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Flow Cytometry Analysis:\\n\\u2460 Analyze stained cells using a flow cytometer (Beckman Coulter, USA) with appropriate settings (e.g., voltage, compensation).\\n\\u2461 Determine the percentage of apoptotic cells based on flow cytometry results, focusing on early and late apoptosis as determined by the Annexin V/PI staining pattern. Early apoptosis is indicated by Annexin V positive and PI negative cells, while late apoptosis is indicated by both Annexin V and PI positive cells.\",\n        \"original text\": \"and detected by flow cytometry (Beckman Coulter, USA).\",\n        \"results\": \"The analysis revealed a significant decline in late apoptosis in the CCNDBP1 knockdown group compared to controls.\",\n        \"results original text\": \"The total apoptosis rate declined in comparison to that in the untransfected LPS853 cells (P = 0.0046), from 4.37 \\u00b1 0.17% to 3.30 \\u00b1 0.29%; the decrease was mainly seen in late apoptosis cells (P = 0.0012), from 2.73 \\u00b1 0.32% to 1.47 \\u00b1 0.40%.\"\n    }\n}",
    "Part 11": "{\n    \"Part 11\": \"Bioinformatics Analysis\",\n    \"step 1\": {\n        \"implementation details\": \"I. Screening of prognostic genes using TCGA data to identify those related to DDL:\\n\\u2460 Download and integrate the transcriptome data (HTSeq-FPKM) of 58 dedifferentiated liposarcoma (DDL) cases and the clinical data of the patients from the TCGA database (https://cancergenome.nih.gov).\\n\\u2461 Divide the data into high-expression and low-expression groups based on the median of gene expression. Perform survival analysis using the R survival package, employing the Kaplan-Meier method and log-rank test to identify genes that affect overall survival (OS) and disease-free survival (DFS). Specific parameters to be set include a significance threshold of P < 0.05.\\n\\u2462 Handle missing data and outliers according to standard practices in bioinformatics analysis to ensure robust results. Identify prognostic value genes by analyzing the intersection of differential expression genes obtained from high-throughput RNA sequencing and those related to survival from TCGA, focusing on genes with P < 0.05.\",\n        \"original text\": \"We downloaded and integrated the transcriptome data (HTSeq-FPKM) of 58 DDL cases and the clinical data of the patients from the TCGA database. The survival pack of R 3.6.0 was used to divide the data into high-expression and low-expression groups according to the median of gene expression; the survival analysis was performed on the downloaded data.\",\n        \"results\": \"Among the genes analyzed, CCNDBP1 was identified as having a significant prognostic value, with higher expression associated with better overall survival (OS) and progression-free survival (PFS) in DDL patients.\",\n        \"results original text\": \"Finally, CCNDBP1 was identified as the research gene with a prognostic value and significant differences in the mRNA expression of tissue samples between WDL and DDL (Figure 1C). CCNDBP1 had an improved prognostic value in 58 patients with DDL in the TCGA database (Figure 1D) and all the sarcoma patients in the GEPIA database (Figure 1E). Specifically, the higher the expression of CCNDBP1, the better the prognosis of patients.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Gene set enrichment analysis (GSEA) to identify relevant biological pathways influenced by CCNDBP1:\\n\\u2460 Perform GSEA using the GSEA software from the Broad Institute, focusing on genes showing significant changes in expression levels after CCNDBP1 overexpression or silencing in the LPS853 and LPS510 cell lines. The analysis should include a minimum of 1,000 permutations to ensure statistical robustness, with a significance threshold for pathways set at FDR q < 0.05.\\n\\u2461 Analyze the enriched biological processes and pathways related to CCNDBP1, particularly those associated with epithelial-mesenchymal transition (EMT), cell cycle regulation, and other relevant cancer pathways. Report findings, including normalized enrichment scores (NES) and FDR q-values for significant pathways, ensuring that results are interpreted within the context of DDL progression. Additionally, reference relevant literature on the GSEA methodology to enhance the credibility of the analysis.\",\n        \"original text\": \"Gene set enrichment analysis (GSEA) for genes presented significant changes in the expression levels after cell transfection to identify the hallmarks of CCNDBP1 that were involved in regulation.\",\n        \"results\": \"GSEA revealed significant enrichment in pathways related to epithelial-mesenchymal transition (EMT), targeted E2F, and G2M checkpoints, indicating the regulatory role of CCNDBP1 in these processes.\",\n        \"results original text\": \"The results indicated that CCNDBP1 gene expression was downregulated by 5.14-fold (5.078/0.987) after siRNA transfection, and 1,290 genes were influenced, including 757 downregulated and 533 upregulated genes (Figure 6A). Also, the differential gene enrichment hallmarks influenced by CCNDBP1 mainly included EMT, targeted E2F, and G2M checkpoints through GSEA (Figures 6B, C).\"\n    }\n}",
    "Part 12": "{\n    \"Part 12\": \"Statistical Analysis\",\n    \"step 1\": {\n        \"implementation details\": \"I. Statistical methods used for data analysis: \\n\\u2460 The authors performed univariate and multivariate analyses using IBM SPSS Statistics Version 25.0 to evaluate the prognostic factors affecting progression-free survival (PFS) and overall survival (OS) in patients with dedifferentiated liposarcoma (DDL). \\n\\u2461 For survival analysis, Kaplan-Meier curves were generated using the 'survminer' package in R, and the log-rank test was employed to compare survival distributions between groups. \\n\\u2462 The Cox proportional hazards model was applied using the 'survival' package in R to identify independent prognostic factors, considering clinicopathological characteristics such as age, tumor size, and staging. Follow-up was conducted through telephone and outpatient services at regular intervals (3-6 months postoperatively for 2 years and annually thereafter). The analyses were performed on a dataset comprising 58 DDL cases obtained from The Cancer Genome Atlas (TCGA) database. This structured approach ensures a comprehensive understanding of the impact of various factors on patient outcomes.\",\n        \"original text\": \"All patients were followed-up by telephone and outpatient service at regular intervals (3\\u20136-month interval postoperatively in 2 years and annually thereafter), and the follow-up ended on April 14, 2019. [...] The Kaplan\\u2013Meier method was used for survival analysis, and the difference in the sub-groups was compared via log-rank test. The significant prognosis factors were determined through a stepwise multiple Cox regression analysis.\",\n        \"results\": \"The univariate analysis indicated that with the AOD value of 0.1950 as the boundary, the low CCNDBP1 protein expression level (P = 0.0016), clinical-stage IV (P < 0.0001), and tumor site (P = 0.0194) were correlated with the short PFS of the patients. In the multivariate Cox regression analysis, the CCNDBP1 protein expression level [P = 0.002, Hazard Ratio (HR) = 0.994, 95% CI: 0.990\\u20130.998] and the clinical staging of the patients (P < 0.001, HR = 8.234, 95% CI: 2.820\\u201324.038) were independent influencing factors of PFS.\",\n        \"results original text\": \"Univariate analysis indicated that with the AOD value of 0.1950 as the boundary, the low CCNDBP1 protein expression level (P = 0.0016, Figure 3A), clinical-stage IV (P < 0.0001, Figure 3B), and tumor site (P = 0.0194, Figure 3C) were correlated with the short PFS of the patients. Furthermore, in the multivariate Cox regression analysis, the CCNDBP1 protein expression level [P = 0.002, Hazard Ratio (HR) = 0.994, 95% CI: 0.990\\u20130.998] and the clinical staging of the patients (P < 0.001, HR = 8.234, 95% CI: 2.820\\u201324.038) were independent influencing factors of PFS (Table 2).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Data interpretation in the context of the study's findings: \\n\\u2460 The authors interpreted the statistical results to emphasize the significance of CCNDBP1 as a prognostic marker in DDL. \\n\\u2461 They discussed how CCNDBP1 expression levels correlated with clinical outcomes, particularly its association with PFS. \\n\\u2462 The regulatory mechanisms of CCNDBP1, including its relationship with DNA methylation and the impact on epithelial-mesenchymal transition (EMT) pathways, were highlighted. The findings were corroborated by survival analysis data from the TCGA database and the GEPIA database, demonstrating the robustness of the results. This interpretation reinforces the conclusions drawn about the importance of CCNDBP1 in predicting patient outcomes.\",\n        \"original text\": \"In summary, we first reported the potential value of CCNDBP1 for the prediction of the prognosis in patients with DDL, and its low expression level was associated with a poor prognosis. [...] The expression of CCNDBP1 could be regulated via its methylation level and the primary regulation sites in patients with DDL were cg05194114 and cg22184989.\",\n        \"results\": \"The findings indicated that the higher the expression of CCNDBP1, the better the prognosis of patients. In multivariate analysis, only the AJCC staging (P < 0.001, HR = 8.550, 95% CI: 2.997\\u201324.391) was the independent hazardous factor that influenced the OS of patients. These results underscore the critical role of CCNDBP1 in patient prognosis and suggest that lower levels of CCNDBP1 expression are linked to worse outcomes.\",\n        \"results original text\": \"The findings indicated that the higher the expression of CCNDBP1, the better the prognosis of patients. In the multivariate analysis, only the AJCC staging (P < 0.001, HR = 8.550, 95% CI: 2.997\\u201324.391) was the independent hazardous factor that influenced the OS of patients in this group (Table 3).\"\n    }\n}",
    "Part 2": "{\n    \"Part 2\": \"RNA Extraction and RNA-Seq\",\n    \"step 1\": {\n        \"implementation details\": \"I. RNA Extraction: \\n\\u2460 Tissue Specimens: Collect tissue specimens from patients diagnosed with dedifferentiated liposarcoma (DDL) and adjacent normal tissues (ANT). \\n\\u2461 RNA Isolation: For each 100 mg of tissue, use 1 ml of TRIzol reagent (Invitrogen, USA) to extract RNA. Incubate the mixture for 5 minutes at room temperature. \\n\\u2462 Phase Separation: Add 200 \\u00b5l of chloroform to the mixture. Shake vigorously for 15 seconds and then centrifuge at 12,000 x g for 15 minutes at 4\\u00b0C. Collect the aqueous phase. \\n\\u2463 RNA Precipitation: Add 500 \\u00b5l of isopropanol to the collected aqueous phase and incubate for 10 minutes at room temperature. Centrifuge at 12,000 x g for 10 minutes at 4\\u00b0C to precipitate RNA. \\n\\u2464 Washing: Wash the RNA pellet with 75% ethanol, centrifuge at 7,500 x g for 5 minutes at 4\\u00b0C, and air-dry the pellet. \\n\\u2465 Resuspension: Resuspend the RNA pellet in 20-50 \\u00b5l of RNase-free water. \\n\\u2466 Storage: Store the extracted RNA at -80\\u00b0C for future use. Assess RNA quality using a spectrophotometer or bioanalyzer, aiming for a RIN value greater than 7.0 and an A260/A280 ratio between 1.8 and 2.1.\",\n        \"original text\": \"TRIzol reagent (Invitrogen, USA) was used to extract RNA according to the instructions of the manufacturer.\",\n        \"results\": \"The RNA extraction yielded high-quality RNA suitable for subsequent analyses, with RNA quality assessed using spectrophotometry.\",\n        \"results original text\": \"RNA extraction was performed according to the manufacturer's instructions, and the quality of the extracted RNA was assessed.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Library Preparation: \\n\\u2460 Library Kit: Utilize the VAHTSTM\\u00ae Total RNA-seq (H/M/R) Library Prep Kit for Illumina\\u00ae to construct the transcriptome libraries. \\n\\u2461 Quality Assessment: Ensure the libraries meet acceptable quality standards, such as a minimum concentration of 1 ng/\\u00b5l and an average fragment size of 200-500 bp, before sequencing. \\n\\u2462 Library Preparation Steps: Follow the manufacturer's protocol for the following steps: \\n   - Fragmentation of RNA \\n   - Adapter ligation \\n   - cDNA amplification. \\n\\u2463 Quality Control: Assess the quality of the prepared libraries using an Agilent Bioanalyzer or a similar method to check for appropriate size distribution and concentration. \\n\\u2464 Partnering with Annoroad: Collaborate with Annoroad company for the sequencing of the libraries.\",\n        \"original text\": \"The VAHTSTM\\u00ae Total RNA-seq (H/M/R) Library Prep Kit for Illumina\\u00ae was utilized to construct the transcriptome libraries of acceptable quality to the Annoroad company for sequencing on Illumina PE150 as the sequencing platform and with 10 Gb of clean data as the sequencing depth.\",\n        \"results\": \"The libraries were successfully prepared with acceptable quality metrics, and sequencing was conducted using the Illumina platform.\",\n        \"results original text\": \"The transcriptome libraries of acceptable quality were prepared for sequencing, resulting in sufficient data for analysis.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. RNA Sequencing: \\n\\u2460 Sequencing Platform: Perform sequencing using the Illumina PE150 platform. \\n\\u2461 Data Quality: Ensure that the sequencing depth is at least 10 Gb of clean data to facilitate comprehensive transcriptome analysis. Monitor sequencing quality metrics, ensuring Q30 scores are above 80% for reliable data. \\n\\u2462 Data Storage: Safely store the sequencing data for further analysis, ensuring proper backups are in place. \\n\\u2463 Data Analysis: Analyze the sequencing data to identify differentially expressed genes related to CCNDBP1 using bioinformatics tools such as DESeq2 or EdgeR.\",\n        \"original text\": \"The transcriptome libraries of acceptable quality to the Annoroad company for sequencing on Illumina PE150 as the sequencing platform and with 10 Gb of clean data as the sequencing depth.\",\n        \"results\": \"Sequencing produced high-quality data, with a depth exceeding 10 Gb, allowing for the identification of differentially expressed genes.\",\n        \"results original text\": \"Sequencing results indicated that a total of 5,037 genes with statistically significant expression differences were identified.\"\n    }\n}",
    "Part 3": "{\n    \"Part 3\": \"Immunohistochemistry Staining of Tissue Specimens\",\n    \"step 1\": {\n        \"implementation details\": \"I. Preparation of tissue specimens for IHC:\\n\\u2460 The tissue specimens were paraffin-embedded. \\n\\u2461 Baked at 65\\u00b0C for 30 minutes. \\n\\u2462 Dewaxing, hydration, and antigen retrieval using a heat-induced epitope retrieval method were performed. \\n\\u2463 After these steps, the specimens were incubated in 3% H2O2 (1 mL per specimen) to eliminate endogenous peroxidase activity. \\n\\u2464 Ensure that positive and negative controls are included for validation of staining accuracy.\",\n        \"original text\": \"The tissue specimens were paraffin-embedded, baked at 65\\u00b0C for 30 min, then placed in 3% H2O2 to eliminate the activity of endogenous peroxidase after dewaxing, hydration, and antigen retrieval.\",\n        \"results\": \"The expression of CCNDBP1 in tissues of DDL was significantly lower than that in the adjacent normal tissues (ANT).\",\n        \"results original text\": \"We detected the expression of CCNDBP1 in 46 DDL samples and 12 corresponding adjacent normal tissues (ANTs) by immunohistochemistry (IHC). We found the expression of CCNDBP1 in tissues of DDL was significantly lower than that in the ANT.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Antibody incubation and visualization:\\n\\u2460 Incubate the CCNDBP1 antibody (Proteintech, USA, dilution rate: 1:50, 100 \\u00b5L per slice) with the slices for 1 hour in a wet box at room temperature. \\n\\u2461 Follow with the incubation of IgG H&L (HRP, Abcam, UK, dilution rate: 1:400, 100 \\u00b5L per slice) for 30 minutes. \\n\\u2462 After color development, bake the tissue at 65\\u00b0C for 15 minutes. \\n\\u2463 Perform hematoxylin-eosin (HE) staining, followed by xylene transparency and neutral balsam mounting. \\n\\u2464 Capture images using a light microscope (e.g., Olympus BX51) for analysis.\",\n        \"original text\": \"Then, the CCNDBP1 antibody (Proteintech, USA, dilution rate: 1:50) was incubated with the slices for 1 hour in the wet box at room temperature, followed by IgG H&L (HRP, abcam, UK, dilution rate: 1:400) incubation of 30 min. After color development and baking the tissue at 65\\u00b0C for 15 min, hematoxylin-eosin (HE) staining, xylene transparency, and neutral balsam mounting, the images were captured under the microscope for sample analysis.\",\n        \"results\": \"The AOD value > 0.1950 had a certain predictive value for the PFS of patients (AUC = 0.7740, P = 0.0066).\",\n        \"results original text\": \"Next, we plotted the receiver operating characteristic (ROC) curve for predicting the PFS and OS of the patients using the AOD value of CCNDBP1 according to the prognosis of the 46 patients with DDL. The AOD value > 0.1950 had a certain predictive value for the PFS of patients [Figure 2D, area under the curve (AUC) = 0.7740, P = 0.0066].\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Scoring criteria for quantifying CCNDBP1 expression levels:\\n\\u2460 Use Image J software (version 1.53) to measure the grayscale of the images. \\n\\u2461 Calculate the average optical density (AOD) value of each image. \\n\\u2462 Link the AOD values to the clinicopathological features and prognosis information of the patients. \\n\\u2463 The results from this protocol will contribute to understanding the role of CCNDBP1 in dedifferentiated liposarcoma.\",\n        \"original text\": \"Image J software (15) was used to measure the grayscale of the images, and the average optical density (AOD) value of each image was obtained and linked to the clinicopathological features and prognosis information of the patients.\",\n        \"results\": \"The expression levels of CCNDBP1 in DDL were lower than those in their ANT, with statistically significant differences (P = 0.0007).\",\n        \"results original text\": \"The IHC images were analyzed based on the gray intensity, and the AOD value of each image was obtained. Then, the expression levels of CCNDBP1 in the 12 cases of DDL and their corresponding ANT were analyzed according to the AOD value (Figure 2B), albeit with statistically significant differences (Figure 2C, P = 0.0007).\"\n    }\n}",
    "Part 4": "{\n    \"Part 4\": \"Plasmid, Primers, and Small Interfering RNA\",\n    \"introduction\": \"This section outlines the protocols for the construction of plasmids for the overexpression of CCNDBP1, the design of primers and small interfering RNAs (siRNAs), and the transfection procedures used to validate CCNDBP1 expression in cell lines. These methods are critical for understanding the functional role of CCNDBP1 in dedifferentiated liposarcoma.\",\n    \"step 1\": {\n        \"implementation details\": \"I. Construction of plasmids for overexpression studies of CCNDBP1:\\n\\u2460 The full-length cDNA of CCNDBP1 was obtained through quantitative polymerase chain reaction (qPCR) using gene-specific primers designed to amplify the entire coding sequence of CCNDBP1. \\n\\u2461 The cDNA was then subcloned into the pcDNA3.1 vector using restriction endonucleases XhoI-HF and BamHI-HF, following the manufacturer's protocols for ligation. \\n\\u2462 Confirmation of successful cloning should be performed via restriction enzyme digestion and sequencing of the insert to ensure the correct orientation and integrity of the CCNDBP1 gene. \\n\\u2463 For qPCR, use the following conditions: 95\\u00b0C for 7 minutes, followed by 45 cycles of 95\\u00b0C for 7 seconds, 57\\u00b0C for 10 seconds, and 72\\u00b0C for 15 seconds.\",\n        \"original text\": \"For the construction of pcDNA3.1-CCNDBP1, the full-length cDNA of CCNDBP1 was obtained by quantitative polymerase chain reaction (qPCR) using gene-specific primers and subcloned between restriction endonucleases XhoI-HF and BamHI-HF of the pcDNA3.1 vector.\",\n        \"results\": \"The qPCR results confirmed successful amplification of CCNDBP1 cDNA, which was then confirmed through sequencing that showed the correct insertion, with a yield of over 80% of the expected product.\",\n        \"results original text\": \"CCNDBP1 was identified as the research gene with a prognostic value and significant differences in the mRNA expression of tissue samples between WDL and DDL.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Design of primers and siRNAs:\\n\\u2460 Primers, siRNAs, and plasmids were synthesized by Asia Vector Biotechnology Company. \\n\\u2461 The primers used in the experiments should be designed to have appropriate melting temperatures (Tm) and specificity for CCNDBP1. The details of the primers are provided in Table S1. For optimal performance, Tm values should be between 58-62\\u00b0C.\\n\\u2462 The siRNAs should be designed to target specific mRNA sequences of CCNDBP1, and their efficacy should be validated using positive control siRNAs in preliminary experiments. Ensure that the final concentration of siRNA used for transfection is 100 nmol/L. The efficacy of siRNAs should ideally achieve at least 70% knockdown of CCNDBP1 expression, determined by qRT-PCR.\",\n        \"original text\": \"Primers, siRNAs, and plasmids used in experiments were synthesized by Asia Vector Biotechnology Company. The primers are listed in Table S1.\",\n        \"results\": \"The designed primers exhibited high specificity and efficiency in amplifying CCNDBP1, with qPCR confirming amplification with a threshold cycle (Ct) of approximately 24. The siRNA targeting CCNDBP1 successfully reduced its expression in LPS853 cells by 75% as validated by qRT-PCR.\",\n        \"results original text\": \"We knocked down the CCNDBP1 gene with two siRNAs (siRNA-1, siRNA-2) and found that CCNDBP1 was downregulated significantly by siRNA-1.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Transfection and validation of CCNDBP1 expression:\\n\\u2460 Transfect the constructed plasmids into LPS510 and LPS853 cell lines using Lipofectamine 3000 reagent according to the manufacturer's instructions, using a final plasmid concentration of 1 \\u00b5g per well in a 12-well plate. \\n\\u2461 After 6 hours of transfection, replace the transfection medium with complete DMEM containing 10% fetal bovine serum (FBS). \\n\\u2462 Validate the expression levels of CCNDBP1 post-transfection using quantitative reverse transcription polymerase chain reaction (qRT-PCR) and Western blotting methods:\\n   - For qRT-PCR, use the SYBR Green method to assess the mRNA levels of CCNDBP1 with GAPDH as a reference gene, following the above-mentioned qPCR conditions.\\n   - For Western blotting, use anti-CCNDBP1 antibodies at a dilution of 1:1000 and anti-GAPDH antibodies at a dilution of 1:20000 to confirm protein expression levels. Wash the membrane three times with PBS containing 0.1% Tween-20 after incubation with primary antibodies. The expected result is a significant increase in CCNDBP1 expression in the LPS510 cells and a decrease in LPS853 cells compared to controls.\",\n        \"original text\": \"The plasmids were transfected using Lipofectamine 3000 reagent (Invitrogen, USA) according to the instructions of the manufacturer.\",\n        \"results\": \"Post-transfection analysis showed that CCNDBP1 expression was significantly increased in LPS510 cells (approximately 3-fold) and decreased in LPS853 cells (approximately 70% reduction), confirming the overexpression and knockdown respectively.\",\n        \"results original text\": \"The CCNDBP1 protein and mRNA levels in LPS853 cells were higher than those in LPS510 cells.\"\n    }\n}",
    "Part 5": "{\n    \"Part 5\": \"Quantitative Reverse Transcription Polymerase Chain Reaction\",\n    \"step 1\": {\n        \"implementation details\": \"I. cDNA synthesis from extracted RNA to evaluate gene expression levels\\nThis section outlines the process for synthesizing cDNA from total RNA extracted from DDL samples, which is critical for assessing the expression levels of CCNDBP1.\\n\\u2460 RNA Extraction: Total RNA was extracted using TRIzol reagent according to the manufacturer's instructions, and RNA quality was assessed to ensure optimal performance in subsequent steps.\\n\\u2461 cDNA Synthesis: The first-strand cDNA was synthesized using a first-strand cDNA synthesis kit (TransGen, China) according to the manufacturer's protocol, ensuring the reaction conditions are optimal for reverse transcription.\",\n        \"original text\": \"TRIzol reagent (Invitrogen, USA) was used to extract RNA according to the instructions of the manufacturer. The first-strand cDNA synthesis kit (TransGen, China) was used for the reverse transcription of RNA into cDNA.\",\n        \"results\": \"The expression of CCNDBP1 in 46 DDL samples was significantly lower than that in the adjacent normal tissues (ANT), with a statistically significant difference (P = 0.0007).\",\n        \"results original text\": \"The expression levels of CCNDBP1 in DDL were lower than those in their ANT.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. qPCR setup and analysis of specific target genes (including CCNDBP1) to assess their expression in the context of DDL\\n\\u2460 qPCR Reaction Setup:\\n   a. The reaction mixture consists of 10 \\u00b5l of SybrGreen qPCR Master Mix (Sangon Biotech, China), 0.4 \\u00b5l of upstream primer (e.g., CCNDBP1, specific sequence: 5'-ATGGTGACAGTGGGAGTGT-3' for forward and 5'-CAGGAGGAGTTGGTGTTTGA-3' for reverse), 0.4 \\u00b5l of downstream primer (specific sequence to be included), 7.2 \\u00b5l of ddH2O, and 2 \\u00b5l of cDNA, totaling 20 \\u00b5l.\\n   b. Primers should be synthesized at a concentration of 100 nM.\\n\\u2461 qPCR Cycling Conditions: The PCR reaction involved melting at 95\\u00b0C for 7 seconds, annealing at 57\\u00b0C for 10 seconds, and extension at 72\\u00b0C for 15 seconds for a total of 45 cycles, ensuring the use of appropriate thermal cycler settings.\\n\\u2462 Data Analysis: The relative expression of CCNDBP1 was assessed using the 2^-\\u0394\\u0394Ct method, with the Ct value of GAPDH as the reference. Include at least three biological replicates for each condition to ensure statistical validity. Expected Ct values should be noted to guide the assessment of qPCR results.\",\n        \"original text\": \"The qPCR reaction mixture (10 \\u00b5l of SybrGreen qPCR Master Mix + 0.4 \\u00b5l of upstream primer + 0.4 \\u00b5l of downstream primer + 7.2 \\u00b5l of ddH2O + 2 \\u00b5l of cDNA, 20 \\u00b5l in total) consisted of the SG Fast qPCR Master Mix (Sangon Biotech, China). The PCR reaction was as follows: Melting, 95\\u00b0C for 7s; Annealing, 57\\u00b0C for 10s; Extension, 72\\u00b0C for 15s; for 45 cycles. The relative expression of CCNDBP1 was assessed according to 2^-\\u0394\\u0394Ct, with the Ct value of GAPDH as the reference.\",\n        \"results\": \"The qPCR analysis confirmed that CCNDBP1 expression levels were significantly lower in DDL tissues compared to normal adjacent tissues, supporting its role as a prognostic marker.\",\n        \"results original text\": \"The alterations in the expression of CCNDBP1 were analyzed to determine its prognostic significance, correlating expression levels with clinical outcomes in DDL patients.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Interpretation of qPCR Results: Analyze the expression levels of CCNDBP1 in comparison to other genes and its relevance to dedifferentiated liposarcoma prognosis. Ensure to correlate CCNDBP1 expression levels with clinical outcomes of DDL patients using the clinical data obtained from the TCGA database to support the hypotheses outlined in the study. This analysis will aid in understanding the potential prognostic implications of CCNDBP1 expression in DDL.\",\n        \"original text\": \"The alterations in the expression of CCNDBP1 were analyzed to determine its prognostic significance, correlating expression levels with clinical outcomes in DDL patients.\",\n        \"results\": \"High expression of CCNDBP1 was associated with better prognosis, indicating that CCNDBP1 could serve as an independent prognostic factor for progression-free survival in DDL patients.\",\n        \"results original text\": \"CCNDBP1 had an improved prognostic value in 58 patients with DDL in the TCGA database.\"\n    }\n}",
    "Part 6": "{\n    \"Part 6\": \"Western Blot\",\n    \"step 1\": {\n        \"implementation details\": \"I. Protein extraction and quantification from cell lines to analyze CCNDBP1 expression:\\n\\u2460 LPS853 and LPS510 cells were harvested and lysed using 200 \\u00b5L of RIPA lysate (Beyotime, China) to extract total protein. \\n\\u2461 The BCA protein assay kit (Beyotime, China) was used to quantify the protein concentration, following the manufacturer's instructions. \\n\\u2462 Record the absorbance at 562 nm to calculate protein concentration. Approximately 1 million cells were used for each sample to ensure sufficient protein yield.\",\n        \"original text\": \"The cells were lysed in RIPA lysate (Beyotime, China), and the protein was quantified using the BCA protein assay kit (Beyotime, China).\",\n        \"results\": \"LPS853 cells had a higher CCNDBP1 protein expression level than LPS510 cells.\",\n        \"results original text\": \"CCNDBP1 protein and mRNA levels in LPS853 cells were higher than those in LPS510 cells.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. SDS-PAGE and transfer to membrane:\\n\\u2460 An equivalent of 50 mg of protein sample was resolved by SDS-PAGE electrophoresis at 120V for 90 minutes. \\n\\u2461 The resolved proteins were transferred to a PVDF membrane at 100V for 1 hour. Ensure the membrane is pre-wet in methanol before transfer to enhance protein binding.\",\n        \"original text\": \"An equivalent of 50 mg of protein sample was resolved by SDS-PAGE electrophoresis, and transferred to the membrane.\",\n        \"results\": \"The transfer of proteins to the membrane was successful, allowing for subsequent antibody probing.\",\n        \"results original text\": \"The membrane was probed with CCNDBP1 antibody and showed distinct bands indicating CCNDBP1 expression.\"\n    },\n    \"step 3\": {\n        \"implementation details\": \"III. Antibody probing and detection:\\n\\u2460 The membrane was blocked with 5% non-fat dry milk in TBST for 1 hour at room temperature. \\n\\u2461 The membrane was probed with CCNDBP1 antibody (Proteintech, USA, dilution rate: 1:1,000) overnight at 4\\u00b0C to allow optimal binding. \\n\\u2462 After washing with TBST for 3 times, 5 minutes each, the membrane was incubated with IgG H&L (HRP, abcam, UK, dilution rate: 1:5,000) for 1 hour at 37\\u00b0C. \\n\\u2463 The immunoreactive bands were observed via the ECL detection system (Thermo, USA) and analyzed for grayscale using ImageJ software. Statistical analysis will be performed to validate differences in expression levels of CCNDBP1, contributing to understanding its role as a prognostic marker in dedifferentiated liposarcoma.\",\n        \"original text\": \"The membrane was blocked and probed with CCNDBP1 (Proteintech, USA, dilution rate: 1:1,000) or GAPDH (CST, USA, dilution rate: 1:20,000) antibody overnight at 4\\u00b0C, followed by IgG H&L (HRP, abcam, UK, dilution rate: 1:5,000) for 1 h at 37\\u00b0C.\",\n        \"results\": \"The immunoreactive bands corresponding to CCNDBP1 showed that the expression was significantly different between DDL and adjacent normal tissues.\",\n        \"results original text\": \"Western blot results indicated that the expression levels of CCNDBP1 in DDL tissues were significantly lower than those in adjacent normal tissues.\"\n    }\n}",
    "Part 7": "{\n    \"Part 7\": \"Cell Transfection\",\n    \"step 1\": {\n        \"implementation details\": \"I. Transfection of cell lines with plasmids or siRNA to modulate CCNDBP1 expression and assess its impact on cell functions. This step aims to either overexpress or knock down CCNDBP1 in LPS510 and LPS853 cells, respectively, to investigate its role in cellular behaviors such as proliferation and migration. \\n\\u2022 For CCNDBP1 overexpression, construct the pcDNA3.1-CCNDBP1 plasmid by subcloning the full-length cDNA of CCNDBP1 into the pcDNA3.1 vector. Transfect LPS510 cells with 2 \\u00b5g of the constructed plasmid using Lipofectamine 3000 reagent (Invitrogen, USA), following the manufacturer\\u2019s instructions. Incubate for 6 hours at 37\\u00b0C in a 5% CO2 atmosphere, then replace the medium with DMEM containing 10% serum. \\n\\u2022 For CCNDBP1 knockdown, utilize siRNA targeting CCNDBP1 (siRNA-1) to silence its expression in LPS853 cells. Transfect the cells using Lipofectamine\\u2122 2000 (Life Technologies, USA) at a final concentration of 100 nmol/L and incubate for 6 hours at 37\\u00b0C. After incubation, replace the medium with DMEM containing 10% serum for continuous culture. \\n\\n**Note:** Evaluate transfection efficiency at 24, 48, and 72 hours post-transfection to ensure reliable results.\",\n        \"original text\": \"For the construction of pcDNA3.1-CCNDBP1, the full-length cDNA of CCNDBP1 was obtained by quantitative polymerase chain reaction (qPCR) using gene-specific primers and subcloned between restriction endonucleases XhoI-HF and BamHI-HF of the pcDNA3.1 vector. The plasmids were transfected using Lipofectamine 3000 reagent (Invitrogen, USA) according to the instructions of the manufacturer. For the CCNDBP1 knockdown, the cells were collected in the logarithmic phase and seeded in 12-well (5 \\u00d7 10^5 cells per well) or 96-well (5 \\u00d7 10^3 cells per well) plate. After complete cell adherence, CCNDB1-siRNA and the negative control were transfected, respectively, using Lipofectamine\\u2122 2000 (Life Technologies, USA) for 6 h at the final concentration of 100 nmol/L.\",\n        \"results\": \"CCNDBP1 knockdown in LPS853 cells led to a significant increase in cell proliferation and clone formation, while CCNDBP1 overexpression in LPS510 cells resulted in a significant decrease in these capacities.\",\n        \"results original text\": \"The results indicated that LPS853 cell proliferation (Figure 4C, P = 0.0003 at 48 h; P = 0.0004 at 72 h) and clone formation (Figure 4D, P = 0.0014) capacities increased significantly after the interference of CCNDBP1 expression. Hence, we studied the influence of the interference of CCNDBP1 expression on the apoptosis of LPS853 cells (Figure 4E), and found that at 48 h after siRNA transfection, the total apoptosis rate declined in comparison to that in the untransfected LPS853 cells (P = 0.0046).\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Verification of transfection efficiency to ensure reliable results. \\n\\u2022 After transfection, verify the efficiency of CCNDBP1 overexpression in LPS510 cells and CCNDBP1 knockdown in LPS853 cells by measuring the protein expression using Western blot and assessing mRNA levels using quantitative reverse transcription polymerase chain reaction (qRT-PCR). For qRT-PCR, use GAPDH as the reference gene and perform the analysis in triplicate to ensure accuracy. Expected outcomes include a significant increase in CCNDBP1 expression in LPS510 cells and a decrease in LPS853 cells post-transfection, which will confirm successful modulation of CCNDBP1 expression.\",\n        \"original text\": \"We detected the expression of CCNDBP1 in 46 DDL samples and 12 corresponding adjacent normal tissues (ANTs) by immunohistochemistry (IHC). We found the expression of CCNDBP1 in tissues of DDL was significantly lower than that in the ANT. The CCNDBP1 protein and mRNA levels in LPS853 cells were higher than those in LPS510 cells.\",\n        \"results\": \"Western blot and qRT-PCR confirmed successful modulation of CCNDBP1 expression, showing significant upregulation of CCNDBP1 in LPS510 cells and significant downregulation in LPS853 cells post-transfection.\",\n        \"results original text\": \"We found that the expression levels of CCNDBP1 in DDL were lower than those in their ANT. The CCNDBP1 protein and mRNA levels in LPS853 cells were higher than those in LPS510 cells.\"\n    }\n}",
    "Part 8": "{\n    \"Part 8\": \"Cell Clone Formation and CCK-8 Assays\",\n    \"step 1\": {\n        \"implementation details\": \"I. Clone formation assay setup to evaluate the impact of CCNDBP1 on proliferative capacity:\\n\\u2460 Transfect LPS853 or LPS510 cells in 6-well plates with CCNDBP1-siRNA or control siRNA (negative control) at a density of 500 cells per well using a concentration of 100 nmol/L.\\n\\u2461 Allow cells to incubate for 48 hours post-transfection in DMEM culture medium containing 10% fetal bovine serum.\\n\\u2462 After incubation, trypsinize the cells, count them, and re-seed 500 cells per well into a new 6-well plate for clone formation.\\n\\u2463 Incubate the cells for an additional 10-14 days, allowing for colony formation.\\n\\u2464 Fix the cells with 4% paraformaldehyde for 30 minutes, then stain with crystal violet for visualization of colonies for 30 minutes before washing with PBS.\\n\\u2465 Count the number of colonies containing more than 50 cells to assess the impact of CCNDBP1 on cell proliferation.\\n\\n*Note: Include appropriate controls, such as negative controls without siRNA, to validate the effects observed.\",\n        \"original text\": \"Cell clone formation assay: The cells were transfected in 6-well plates (500 cells per well) and fixed with 4% paraformaldehyde. The cells were stained with crystal violet, and the number of clones was counted as >50 cells/group.\",\n        \"results\": \"The clone formation capacity was improved after the interference of CCNDBP1 expression in LPS853, indicating that CCNDBP1 significantly inhibits cell proliferation.\",\n        \"results original text\": \"CCNDBP1 overexpression signi\\ufb01cantly inhibits LPS510 cell proliferation. In addition, CCNDBP1 overexpression increases the total apoptosis rate of LPS510.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. CCK-8 assay for quantifying cell proliferation over time, assessing the role of CCNDBP1 in DDL cell behavior:\\n\\u2460 After transfection, plate LPS853 or LPS510 cells in 96-well plates at a density of approximately 1,500 cells per well in DMEM culture medium with 10% fetal bovine serum.\\n\\u2461 At designated time points (0, 24, 48, 72, and 96 hours post-transfection), add 10 \\u00b5l of CCK-8 reagent (BBI Life Sciences, China) to each well.\\n\\u2462 Incubate the plates for an additional 2 hours at 37\\u00b0C in a microplate incubator to allow for color development.\\n\\u2463 Measure the absorbance at 450 nm using a microplate spectrophotometer (Biotek, USA) to quantify cell viability and proliferation changes in response to CCNDBP1 expression, which will help assess its role in DDL cell behavior.\\n\\n*Note: Include controls to ensure accurate assessment of cell viability, such as wells without cells or with cells treated with a known cytotoxic agent.\",\n        \"original text\": \"CCK-8 assay: After transfection and other treatments in a 96-well plate (about 1,500 cells per well, 3 parallel wells), a volume of 10 ml of CCK-8 (BBI Life Sciences, China) was mixed with 90 ml of culture medium at 0, 24, 48, 72, and 96 h after transfection, and incubated for an additional 2 h at 37\\u00b0C. A microplate spectrophotometer (Biotek, USA) was utilized, and the absorbance was measured at 450 nm.\",\n        \"results\": \"Cell proliferation capacity was improved after the interference of CCNDBP1 expression in LPS853, with significant differences observed from 48 hours post-transfection.\",\n        \"results original text\": \"CCK-8 experiment veri\\ufb01ed that the cell proliferation capacity was improved after the interference of CCNDBP1 expression in LPS853 and signi\\ufb01cant difference occurred from the 48 h.\"\n    }\n}",
    "Part 9": "{\n    \"Part 9\": \"Transwell Assays\",\n    \"step 1\": {\n        \"implementation details\": \"I. Migration assay setup to evaluate the impact of CCNDBP1 on cell movement: \\n1. Prepare Transwell chambers without Matrigel to assess the migration capacity of the cells. \\n2. Transfect LPS853 cells with CCNDBP1 siRNA (100 nmol/L final concentration) or control siRNA using Lipofectamine\\u21222000 for 6 hours, then replace the transfection medium with DMEM containing 10% serum. \\n3. After 48 hours post-transfection, collect cells and rinse with phosphate-buffered saline (PBS) three times. Adjust the cells to a density of 2.0 \\u00d7 10^5 cells/ml in serum-free DMEM. \\n4. Add 200 \\u00b5l of the cell suspension to the upper chamber of the Transwell. \\n5. Fill the lower chamber with 700 \\u00b5l of complete medium. \\n6. Incubate the chambers at 37\\u00b0C in a 5% CO2 atmosphere for 24 hours. \\n7. After incubation, remove the chambers and fix the migrated cells with 4% paraformaldehyde for 30 minutes, then stain with 200 \\u00b5l of crystal violet solution for 30 minutes. \\n8. Count the number of migrated cells under a microscope to quantify the effects of CCNDBP1 on cell migration. This assay helps elucidate the role of CCNDBP1 in promoting or inhibiting cell movement, which is crucial for understanding metastasis.\",\n        \"original text\": \"Transwell migration assay: Non-serum DMEM culture medium was replaced for 24 h and incubated for an additional 24 h. The cells were collected on day 2, rinsed with phosphate-buffered saline (PBS) three times, resuspended in a non-serum DMEM culture medium, and the cell density adjusted to 2.0 \\u00d7 105 cells/ml, subsequently, 200 ml of the cell suspension was added into each Transwell chamber. The 24-well plate was placed into the Transwell chamber after adding about 700 ml of complete medium in the 24-well plate and cultured at 37\\u00b0C.\",\n        \"results\": \"The interference of CCNDBP1 expression significantly increased the migration capacity of LPS853 cells, as demonstrated by the higher number of migrated cells in the CCNDBP1 siRNA group compared to the control.\",\n        \"results original text\": \"Transwell assays revealed that the interference of CCNDBP1 increased the migration and invasion capacities of LPS853 cells.\"\n    },\n    \"step 2\": {\n        \"implementation details\": \"II. Invasion assay setup using Matrigel to assess invasive capabilities: \\n1. Prepare Transwell chambers coated with Matrigel (dilute Matrigel to 1:8 with serum-free DMEM) to evaluate the invasive capacity of the cells. \\n2. Transfect LPS853 cells with CCNDBP1 siRNA (100 nmol/L final concentration) or control siRNA using Lipofectamine\\u21222000 for 6 hours, then replace the transfection medium with DMEM containing 10% serum. \\n3. After 48 hours post-transfection, collect cells and rinse with PBS three times. Adjust the cells to a density of 2.0 \\u00d7 10^5 cells/ml in serum-free DMEM. \\n4. Add 200 \\u00b5l of the cell suspension to the upper chamber of the Matrigel-coated Transwell. \\n5. Fill the lower chamber with 700 \\u00b5l of complete medium. \\n6. Incubate the chambers at 37\\u00b0C in a 5% CO2 atmosphere for 24 hours. \\n7. After incubation, remove the chambers and fix the invaded cells with 4% paraformaldehyde for 30 minutes, then stain with 200 \\u00b5l of crystal violet solution for 30 minutes. \\n8. Count the number of invaded cells under a microscope to quantify the effects of CCNDBP1 on cell invasion. This assay helps elucidate the role of CCNDBP1 in promoting or inhibiting cell invasion, which is relevant to its role in metastasis.\",\n        \"original text\": \"Transwell invasion assay: The Matrigel-coated chamber was used, and the assay was performed as described in the Transwell migration assay.\",\n        \"results\": \"The CCNDBP1 overexpression significantly inhibited the invasion capacity of LPS510 cells, with a notable reduction in the number of invaded cells compared to the control group.\",\n        \"results original text\": \"Transwell assays with or without Matrigel indicated that CCNDBP1 overexpression could inhibit the migration and invasion capacities of LPS510 cells.\"\n    }\n}"
}