{
    "Part 1": {
        "Part 1": "Sample Collection and Preparation",
        "step 1": {
            "implementation details": "Begin the process by downloading raw gene counts for tumor and normal tissue samples from the Recount3 R package (version 1.0). Ensure the raw reads from multiple sources, including cancer and non-diseased tissues generated by the TCGA and GTEx, are uniformly processed using the STAR (version 2.7.3a) and Megadepth (version 1.0.1) pipeline. Align and quantify the reads to the UCSC hg38 assembly. Specifically, download data for the TCGA-SARC and GTEx projects, focusing on putative sarcomagenic tissues of mesenchymal origin, such as adipose, fibroblasts, skeletal muscle, esophagus muscularis, stomach, uterus, and vessels. Use the following example command for data download: 'R\nlibrary(recount3)\nproject_info <- available_projects()\ndata_sarc <- create_rse(project = 'TCGA-SARC')\ndata_gtex <- create_rse(project = 'GTEx')'. Ensure all downloaded data is accessible and stored securely for further analysis. Verify data integrity by checking file sizes and using checksums. Store the data in a secure and organized manner, documenting each step for reproducibility. Refer to the Recount3 documentation for additional guidance and troubleshooting steps. Maintain a checklist for verifying data integrity and storage conditions.",
            "Reference Source": {
                "ijms-24-14732": {
                    "Part 1": [
                        "step 1"
                    ]
                },
                "41467_2024_Article_52067": {
                    "Part 1": []
                }
            }
        },
        "step 2": {
            "implementation details": "Select tumor samples from the TCGA SARC project and normal samples from GTEx projects. Focus on highly differentiated and dedifferentiated liposarcoma subtypes. Ensure samples meet selection criteria, such as tissue site specificity and quality metrics (e.g., percentage of aligned reads > 70%). Filter out low-quality and non-primary tumor samples. Modify subtype classification based on expert pathology reviews to ensure accurate representation of liposarcoma subtypes. Document the filtering process and quality assessment steps meticulously. Use tools such as FastQC for quality assessment and follow specific guidelines for RNA-seq sample selection. Maintain a checklist for verifying sample quality and selection criteria. Include references to relevant literature or guidelines for sample selection.",
            "Reference Source": "ijms-24-14732, Part 1, step 2"
        },
        "step 3": {
            "implementation details": "Preprocess the raw gene counts by mapping genomic features to an Entrez ID using the org.Hs.eg.db Bioconductor package (version 3.12.0). Normalize the downloaded raw counts for all samples using the Trimmed Mean of M-values (TMM) method with the edgeR package (version 3.32.1). Obtain normalized counts in the log scale using the voom function from the limma package (version 3.46.0). Perform quality control checks including data distribution visualization and outlier detection to ensure data integrity. Include explicit instructions on handling potential issues such as missing data or outliers. Refer to relevant literature or guidelines for preprocessing RNA-seq data. Maintain a checklist for verifying data integrity and preprocessing criteria. Provide a brief overview of the preprocessing step, outlining the purpose and expected outcomes.",
            "Reference Source": "ijms-24-14732, Part 1, step 3"
        }
    },
    "Part 2": {
        "Part 2": "RNA Sequencing and Quality Control",
        "step 1": {
            "implementation details": "I. RNA Extraction from Prepared Samples using Specific Extraction Kits and Protocols: (1) Collect tissue and cell line samples, ensuring they are stored at -80°C until RNA extraction. (2) Use the RNeasy Mini Kit (Qiagen) for RNA extraction from tissue samples, following the manufacturer's protocol. (3) For cell line samples, use the PARIS Kit (Ambion) to isolate RNA from both cytoplasmic and nuclear fractions. (4) Perform on-column DNase I treatment (10 U/µL, incubated for 15 minutes at room temperature) to remove genomic DNA contamination. (5) Verify RNA integrity and concentration using a NanoDrop spectrophotometer and an Agilent Bioanalyzer. (6) Store RNA samples at -80°C post-extraction and document all extraction steps. Expected RNA integrity number (RIN) should be above 7.0 for high-quality samples. (7) Troubleshooting: If RNA yield is low, ensure proper homogenization of samples and check for potential RNase contamination. If RNA integrity is poor, reassess sample handling and storage conditions.",
            "Reference Source": {
                "1-s2.0-S104366182200408X-main": {
                    "Part 1": [
                        "step 2"
                    ]
                },
                "nihms-2028845": {
                    "Part 1": [
                        "step 1"
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "II. RNA Sequencing of Extracted RNA: (1) Prepare cDNA from 1 µg of total RNA using the Transcriptor First Strand cDNA Synthesis Kit (Roche). (2) Construct strand-specific RNA-seq libraries using the TruSeq Library Prep Kit (Illumina) according to the manufacturer's instructions. (3) Perform sequencing on an Illumina NovaSeq 6000 platform, generating paired-end reads of 150 bases. (4) Ensure that the sequencing depth is at least 30 million reads per sample to capture lowly expressed transcripts. Document sequencing conditions and expected output metrics. (5) Provide references to similar studies that have successfully used these methods in liposarcoma research to enhance referability.",
            "Reference Source": {
                "1-s2.0-S104366182200408X-main": {
                    "Part 1": [
                        "step 2"
                    ]
                }
            }
        },
        "step 3": {
            "implementation details": "III. Quality Control of Sequencing Data using FastQC: (1) Use FastQC (https://www.bioinformatics.babraham.ac.uk/projects/fastqc/) to perform quality control checks on the raw sequencing data. (2) Analyze the quality reports to assess read quality, GC content, and sequence duplication levels. (3) Identify any potential issues such as adapter contamination or low-quality base calls. (4) Document the quality control results, ensuring that the per-base sequence quality scores are above 30 and duplication levels are within acceptable ranges. (5) Troubleshooting: If quality scores are low, consider re-sequencing or additional trimming of the reads.",
            "Reference Source": {
                "nihms-2028845": {
                    "Part 1": [
                        "step 2"
                    ]
                }
            }
        },
        "step 4": {
            "implementation details": "IV. Trimming of Low-Quality Reads with Trimmomatic: (1) Use Trimmomatic (http://www.usadellab.org/cms/?page=trimmomatic) to trim low-quality bases and remove adapter sequences from the raw reads. (2) Set the following parameters: LEADING:3, TRAILING:3, SLIDINGWINDOW:4:20, MINLEN:36. (3) Process all sequencing datasets, ensuring consistency across samples. (4) Verify the quality of trimmed reads using FastQC to confirm improvements in read quality and document any changes in quality metrics. (5) Troubleshooting: If trimming does not significantly improve quality, consider adjusting trimming parameters or using an alternative trimming tool.",
            "Reference Source": {
                "nihms-2028845": {
                    "Part 1": [
                        "step 2"
                    ]
                }
            }
        },
        "step 5": {
            "implementation details": "V. Normalization Techniques using RSEM: (1) Use RSEM (https://github.com/deweylab/RSEM) to calculate expression levels of transcripts in Transcripts Per Million (TPM). (2) Align the trimmed reads to the reference genome (GRCh38) using STAR aligner with RSEM integration. (3) Normalize expression data to TPM to facilitate comparisons across samples. (4) Document normalization procedures, ensuring consistency with previous studies, and store processed data securely for downstream analysis. (5) Data Management: Store raw and processed data in a secure data repository with appropriate metadata for future reference and analysis.",
            "Reference Source": {
                "nihms-2028845": {
                    "Part 1": [
                        "step 2"
                    ]
                }
            }
        }
    },
    "Part 3": {
        "Part 3": "Differential Expression and Pathway Analysis",
        "step 1": {
            "implementation details": "I. Differential Gene Expression Analysis between Highly Differentiated and Dedifferentiated Liposarcoma using Statistical Methods such as DESeq2 and edgeR\n1. Data Collection: Use RNA-seq data from 80 cases and single-cell sequencing data from 10 cases, specifically from datasets GSE221492 and GSE221493. Ensure data is aligned to the GRCh38 reference genome and normalized using TPM values.\n2. Data Preprocessing: Filter out low-quality reads and samples with low mapping rates, using a threshold of 20% for mitochondrial reads. Ensure that only samples meeting quality control metrics are included in the analysis.\n3. Differential Expression Analysis: Use DESeq2 and edgeR packages to identify differentially expressed genes (DEGs) between highly differentiated and dedifferentiated liposarcoma samples. Set a significance threshold of adjusted p-value < 0.05 using the Benjamini-Hochberg method for multiple testing correction.\n4. Batch Effect Correction: Include batch effect variables in the model design to account for potential confounding factors such as sequencing batch or sample source. Summarize findings at the end of the analysis.",
            "Reference Source": {
                "ijms-24-14732": {
                    "Part 5": [
                        "step 1"
                    ]
                },
                "cancers-15-03360": {
                    "Part 1": [
                        "step 2",
                        "step 3"
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "II. Functional Annotation of Differentially Expressed Genes (GO enrichment analysis)\n1. Gene Ontology Enrichment Analysis: Perform GO enrichment analysis on the DEGs identified in step 1 using the enrichR package. Focus on biological process ontology to identify enriched terms related to cellular functions and processes.\n2. Validation of Enrichment Results: Compare the enrichment results with known biological processes and pathways from relevant databases and literature to validate the findings. Use a significance threshold of adjusted p-value < 0.05 for the enrichment analysis. Summarize the key enriched terms and their biological relevance.",
            "Reference Source": "ijms-24-14732 Part 5 step 2"
        },
        "step 3": {
            "implementation details": "III. Metabolic Pathway Analysis using KEGG and GSEA\n1. KEGG Pathway Analysis: Use the KEGG database to identify metabolic pathways that are significantly enriched among the DEGs. Perform the analysis using the clusterProfiler package and set a significance threshold of adjusted p-value < 0.05.\n2. Gene Set Enrichment Analysis (GSEA): Conduct GSEA to identify enriched metabolic pathways and processes using the Molecular Signatures Database (MSigDB). Use the GSEA software and apply a significance threshold of FDR < 0.05.\n3. Validation of Pathway Analysis: Cross-reference identified pathways with existing literature and databases to ensure biological relevance and accuracy. Summarize the findings, highlighting key metabolic pathways involved.",
            "Reference Source": "cancers-15-03360 Part 1 step 6"
        }
    },
    "Part 4": {
        "Part 4": "Single-Cell Sequencing and Tumor Heterogeneity Analysis",
        "step 1": {
            "implementation details": "I. Preparation of Single-Cell Suspensions from Tumor Samples: Fresh tumor samples from the available frozen samples are thawed and cut into small pieces. These pieces are then dissociated using a digestion medium consisting of CO2-independent medium (Gibco) with 150 mg/ml Liberase TL (Roche) and 100 U/ml DNase 1 (Sigma Aldrich), incubated at 37°C for 30 minutes. The resulting cell suspension is filtered through a 70 μm cell strainer to remove debris. Cells are washed with PBS and counted using a hemocytometer. Viability is assessed using trypan blue exclusion, ensuring a viability of at least 85%. Cells are resuspended in PBS at a concentration of 1 million cells/ml and stored on ice until further processing. Ensure that samples are processed within 2 hours to maintain cell viability.",
            "Reference Source": {
                "41467_2024_Article_52067": {
                    "Part 3": [
                        "step 8"
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "II. Single-cell RNA Sequencing (scRNA-seq) Analysis: Single-cell suspensions are loaded onto a 10X Genomics Chromium Controller using the Chromium Single Cell 3’ Kit v3, targeting 3000 cells per sample. Libraries are prepared following the manufacturer's protocol, including reverse transcription, cDNA amplification, and library construction. Sequencing is performed on an Illumina NovaSeq 6000 platform, aiming for a depth of at least 50,000 reads per cell. Raw sequencing data are processed using Cell Ranger (v6.0.0), aligning reads to the GRCh38 reference genome and generating a gene-cell matrix. Verify the integrity of the generated matrix by assessing the number of detected genes per cell and the distribution of unique molecular identifiers (UMIs).",
            "Reference Source": {
                "41467_2024_Article_52067": {
                    "Part 3": [
                        "step 6"
                    ]
                }
            }
        },
        "step 3": {
            "implementation details": "III. Integration and Clustering of scRNA-seq Data: Processed data from Cell Ranger are imported into Seurat (v4.1.0) for integration and clustering. Data are normalized using the SCTransform function, and the 3000 most variable genes are identified. PCA is performed on these genes, and the first 50 principal components are used for clustering. UMAP is used for dimensionality reduction, and shared nearest-neighbor graph-based clustering is performed using the FindNeighbors and FindClusters functions with a resolution of 0.6 to identify cell clusters. Ensure that clustering results are validated by visual inspection of UMAP plots and by comparing with known cell type markers.",
            "Reference Source": {
                "41467_2024_Article_52067": {
                    "Part 3": [
                        "step 1",
                        "step 2"
                    ]
                }
            }
        },
        "step 4": {
            "implementation details": "IV. Identification of Tumor Cell Clusters and Metabolic Pathways: Differential gene expression analysis is conducted using the FindAllMarkers function in Seurat, employing a Wilcoxon rank sum test with Bonferroni correction. Genes with a log2-fold change ≥0.4 and an adjusted p-value ≤0.05 are considered significant. Pathway analysis is performed using Toppfun with a p-value cutoff of 0.05 to identify enriched metabolic pathways, focusing on pathways like lipid metabolism and TGF-β signaling. Include a rationale for selecting specific pathways based on previous literature and study objectives.",
            "Reference Source": {
                "41467_2024_Article_52067": {
                    "Part 3": [
                        "step 2",
                        "step 5"
                    ]
                }
            }
        },
        "step 5": {
            "implementation details": "V. Validation of Bulk RNA-seq Findings with Single-cell Data: Bulk RNA-seq data from GSE221492 are compared with single-cell RNA-seq data from GSE221493. Differential expression analysis at the single-cell level is performed using DESeq2, aligning reads to the GRCh38 reference genome. Clustering and pathway analysis results from single-cell data are cross-referenced with bulk RNA-seq findings to validate the presence of identified metabolic pathways. Consistency in expression patterns and pathway enrichment between datasets is assessed using statistical tests to ensure robustness.",
            "Reference Source": {
                "cancers-15-03360": {
                    "Part 3": [
                        "step 4"
                    ]
                }
            }
        }
    },
    "Part 5": {
        "Part 5": "Validation and Pathway Enrichment Analysis",
        "step 1": {
            "implementation details": "I. Validation of Differential Expression Results using Independent Datasets and Specific Criteria for Dataset Selection\n1. Identify independent datasets from GEO that include RNA-seq data for liposarcoma, focusing on datasets that provide both WDLPS and DDLPS samples. Use datasets GSE201056 and GSE213300 for validation purposes, as they contain relevant expression profiles.\n2. Download raw gene expression data and process using the same pipeline as in previous parts: align reads to the GRCh38 reference genome using STAR version 2.7.9a, normalize expression data using TPM values, and perform quality control checks with FastQC version 0.11.9 to ensure data integrity.\n3. Select DEGs identified in Part 3 and Part 4 and verify their expression patterns in the independent datasets. Use DESeq2 version 1.30.1 to re-evaluate differential expression and confirm consistency in expression patterns.\n4. Apply a significance threshold of adjusted p-value < 0.05 to identify validated DEGs. Document discrepancies and analyze potential reasons for any inconsistencies. Integrate RNA-seq data from the researcher's own 80 cases for additional validation.",
            "Reference Source": {
                "cancers-15-03360": {
                    "Part 1": [
                        "step 2",
                        "step 3"
                    ],
                    "Part 3": [
                        "step 1"
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "II. Pathway Enrichment Analysis to Identify Key Metabolic Pathways\n1. Utilize the validated DEGs from Step 1 to perform pathway enrichment analysis using the clusterProfiler package version 3.18.1. Focus on KEGG pathways related to metabolism to identify key metabolic pathways involved in liposarcoma differentiation.\n2. Set the FDR cutoff to p < 0.05 for pathway significance. Use the KEGG database version corresponding to the GRCh38 genome build for accurate pathway mapping.\n3. Visualize enriched pathways using dot plots and pathway maps generated with ggplot2 version 3.3.3 to highlight significant metabolic pathways. Prioritize pathways with the highest enrichment scores for further investigation.\n4. Document the top 10 enriched metabolic pathways and their biological functions, focusing on their relevance to liposarcoma biology and differentiation.",
            "Reference Source": "cancers-15-03360 Part 1 step 6"
        },
        "step 3": {
            "implementation details": "III. Cross-validation of Results with Publicly Available Datasets\n1. Cross-validate the pathway enrichment results with additional publicly available datasets such as GSE179720 and GSE221492. Ensure these datasets contain relevant liposarcoma samples and expression data.\n2. Perform pathway enrichment analysis on these datasets using the same parameters and criteria as in Step 2. Compare the results to identify common metabolic pathways enriched across multiple datasets.\n3. Analyze the consistency of pathway enrichment results and identify any novel pathways not previously detected. Document any new findings and their potential implications for liposarcoma differentiation.\n4. Discuss the biological significance of the findings and how they contribute to the understanding of metabolic differences in liposarcoma subtypes. Emphasize the integration of results with the researcher's own data for comprehensive validation.",
            "Reference Source": "cancers-15-03360 Part 3 step 4"
        }
    }
}