{
    "GSE202361": {
        "Status": "Public on Jan 01, 2024",
        "Title": "Neoadjuvant immune checkpoint blockade in retroperitoneal dedifferentiated liposarcoma and extremity/trunk undifferentiated pleomorphic sarcoma (NCT03307616)",
        "Organism": "Homo sapiens",
        "Experiment type": "Expression profiling by high throughput sequencing",
        "Summary": "Recent evidence suggests that immune checkpoint blockade (ICB) has some activity in metastatic dedifferentiated liposarcoma (DDLPS) and undifferentiated pleomorphic sarcoma (UPS). We conducted a randomized, non-comparative phase 2 trial (NCT03307616) of nivolumab or nivolumab/ipilimumab in patients with resectable retroperitoneal DDLPS (n=17) and extremity/truncal UPS (n=10), with UPS patients receiving concurrent radiation therapy. The primary endpoint of pathologic response as assessed by percent hyalinization was observed to be a median of 8.8% in DDLPS patients and 89% in UPS patients and similar in nivolumab and ipilimumab/nivolumab arms in both cohorts . Higher intratumoral densities of T-regulatory cells were associated with absence of pathologic response (hyalinization<30%). Tumor infiltration by B-cells was associated with higher densities of T-regulatory cells before treatment;  this association was lost upon ICB treatment. Our data demonstrate that neoadjuvant ICB with concurrent radiation may have significant efficacy in UPS and is associated complex immune changes in the tumor microenvironment in DDLPS and UPS.",
        "Overall design": "Tumor samples were collected at baseline, on treatment and at surgery for all patients, and analyzed using bulk RNA sequencing.",
        "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
        "Samples": {
            "GSM6111908": {
                "link": "/geo/query/acc.cgi?acc=GSM6111908",
                "name": "Sarcoma tumor tissue, Sample 1",
                "Status": "Public on Jan 01, 2024",
                "Title": "Sarcoma tumor tissue, Sample 1",
                "Sample type": "SRA",
                "Organism": "Homo sapiens",
                "Characteristics": "tissue: Sarcoma tumor tissuedisease state: Soft-Tissue Sarcomatreatment: Immune checkpoint blockadecollected date: 12-05-2017collected: baselineage: 49Sex: Moutcome: PDgrade: High Grade",
                "Extracted molecule": "cDNA",
                "Extraction protocol": "RNA was extracted by NORGEN Total RNA Purification Kit (Cat. 37500) (NORGEN BIOTEK CORP). The extracted RNA was treated with DNase I. The treated RNA then was cleaned-up using the AMPure XP beads (Beckman Coulter Life Sciences) and eluted into 1x TE buffer. The purified RNA was quantified using Quant-iT™ RiboGreen™ RNA Assay Kit (ThermoFisher SCIENTIFIC) and the RNA quality was accessed using Agilent RNA 6000 Nano Kit and the 2100 Bioanalyzer Instrument (Agilent Technologies).Up to 200 ng of each cDNA sample based on the PicoGreen quantification was sheared (mechanically fragmented) using the E220 Focused-ultrasonicator Covaris (Covaris). The sonication was performed under the following conditions: Peak Incident Power 200, Duty Cycle 25%, Cycles per Burst 50, and duration 10 seconds for 120 iterations. To ensure the proper fragment size, samples were examined on TapeStation 4200 using the DNA High Sensitivity kit (Agilent Technologies). The sheared cDNA was proceeded to library preparation using SureSelect XT Low Input Reagent Kit with indexes 1-96 (Agilent Technologies) as automated method on the Sciclone G3 NGSx Workstation (PerkinElmer, Inc.).This protocol consists of 3 enzymatic reactions for end repair, A-tailing and Adaptor ligation, followed by barcode insertion by PCR using Herculase II Fusion DNA Polymerase (8 to 14 cycles, based on input DNA quality and quantity). PCR primers were removed by using 1x volume of Agencourt AMPure PCR Purification kit (Agencourt Bioscience Corporation). The quality and quantity of the prepared libraries were evaluated using TapeStation 4200 and the DNA High Sensitivity kit (Agilent Technologies) to verify correct fragment size and to ensure complete removal of primer dimers.",
                "Library strategy": "RNA-Seq",
                "Library source": "transcriptomic",
                "Instrument model": "Illumina NovaSeq 6000",
                "Data processing": "Raw RNA sequencing reads of the samples were mapped to the hg19 reference genome using the STAR aligner.RSEM was used to quantify aligned reads and produce raw counts of known transcriptsThe raw count of transcripts in the samples were then converted to transcripts per million that normalize counts for library size and gene length.Assembly: hg19Supplementary files format and content: rawcounts and TPMs",
                "Platform ID": "GPL24676"
            }
        },
        "Supplementary file": [
            {
                "file_name": "GSE202361_AllSamples_TPM.txt.gz",
                "file_size": "3.5 Mb",
                "file_type": "TXT",
                "download_link": "/geo/download/?acc=GSE202361&format=file&file=GSE202361%5FAllSamples%5FTPM%2Etxt%2Egz"
            },
            {
                "file_name": "GSE202361_AllSamples_rawcount.txt.gz",
                "file_size": "2.9 Mb",
                "file_type": "TXT",
                "download_link": "/geo/download/?acc=GSE202361&format=file&file=GSE202361%5FAllSamples%5Frawcount%2Etxt%2Egz"
            }
        ]
    },
    "GSE205492": {
        "Status": "Public on Jun 14, 2022",
        "Title": "RNA sequencing analysis of NK cells, T cells and tumor from matched soft tissue sarcoma and peripheral blood",
        "Organism": "Homo sapiens",
        "Experiment type": "Expression profiling by high throughput sequencing",
        "Summary": "Using fluorescence-activated cell sorting, we isolated blood and tumor-infiltrating CD3-CD56+ NK and CD3+ T cells and CD45- viable tumor cells from STS patients undergoing surgery. We then evaluated differential gene expression (DGE) of these purified populations with RNA sequencing analysis",
        "Overall design": "The collection of matched whole blood and tumor specimens was approved by the IRB at the University of California, Davis. Human peripheral blood mononuclear cells (PBMCs) were isolated from whole blood using a density gradient centrifugation, followed by red blood cell lysis. Tumor tissue from patients undergoing STS resection was collected in sterile RPMI-1640, diluted with PBS and passed through a 70 µm filter, and then subjected to red blood cell lysis. Human cells were washed with PBS and staining buffer, and then incubated with Fc receptor blocking solution for 15 minutes. Cells were stained with the following fluorochrome-conjugated monoclonal antibodies: CD3-FITC, CD56-PE, CD45-BV510 and CD8-BV785. Live/dead staining was performed using Fixable Viability Dye 780. Data were acquired using a BD LSRFortessa flow cytometer and analyzed using FlowJo Software. Fluorescence-associated cell sorting (FACS) was performed using a BD inFlux cell sorter. Cells were sorted for blood and intra-tumoral NK cells (live CD45+CD3-CD56+), blood and intra-tumoral T cells (live CD45+CD3+CD56-), and tumor cells (live CD45-). Following FACS isolation, cells were cryopreserved and stored in liquid nitrogen for subsequent RNA extraction and sequencing. Cells were processed for RNA isolation using the Total RNA Purification Plus Micro Kit. RNAseq libraries were prepared by the University of California, Davis, Bioinformatics Core. Gene expression profiling was carried out using a 3'-Tag-RNA-Seq protocol. Up to forty-eight libraries were sequenced per lane on an Illumina HiSeq 4000 sequencer with single-end 100 base pair reads. Differential gene expression analysis was performed with the DESeq2 package for R. The Benjamini-Hochberg procedure was used to adjust for False Discovery Rate (FDR).",
        "Platforms": "Platforms (1), GPL20301, Illumina HiSeq 4000 (Homo sapiens)",
        "Samples": {
            "GSM6213616": {
                "link": "/geo/query/acc.cgi?acc=GSM6213616",
                "name": "CCS24002_BLOOD_NK_custom_NA",
                "Status": "Public on Jun 14, 2022",
                "Title": "CCS24002_BLOOD_NK_custom_NA",
                "Sample type": "SRA",
                "Organism": "Homo sapiens",
                "Characteristics": "tissue: peripheral bloodcell line: tissuecell type: NK cellsdisease state: Myxofibrosarcoma",
                "Extracted molecule": "cDNA",
                "Extraction protocol": "The collection of matched whole blood and tumor specimens was approved by the IRB at the University of California, Davis. Human peripheral blood mononuclear cells (PBMCs) were isolated from whole blood using a density gradient centrifugation, followed by red blood cell lysis. Tumor tissue from patients undergoing STS resection was collected in sterile RPMI-1640, diluted with PBS and passed through a 70 µm filter, and then subjected to red blood cell lysis. Human cells were washed with PBS and staining buffer, and then incubated with Fc receptor blocking solution for 15 minutes. Cells were stained with the following fluorochrome-conjugated monoclonal antibodies: CD3-FITC, CD56-PE, CD45-BV510 and CD8-BV785. Live/dead staining was performed using Fixable Viability Dye 780. Data were acquired using a BD LSRFortessa flow cytometer and analyzed using FlowJo Software. Fluorescence-associated cell sorting (FACS) was performed using a BD inFlux cell sorter. Cells were sorted for blood and intra-tumoral NK cells (live CD45+CD3-CD56+), blood and intra-tumoral T cells (live CD45+CD3+CD56-), and tumor cells (live CD45-). Following FACS isolation, cells were cryopreserved and stored in liquid nitrogen for subsequent RNA extraction and sequencing. Cells were processed for RNA isolation using the Total RNA Purification Plus Micro Kit.RNAseq libraries were prepared by the University of California, Davis, Bioinformatics Core. Gene expression profiling was carried out using a 3'-Tag-RNA-Seq protocol. Up to forty-eight libraries were sequenced per lane on an Illumina HiSeq 4000 sequencer with single-end 100 base pair reads. Differential gene expression analysis was performed with the DESeq2 package for R. The Benjamini-Hochberg procedure was used to adjust for False Discovery Rate (FDR).",
                "Library strategy": "RNA-Seq",
                "Library source": "transcriptomic",
                "Instrument model": "Illumina HiSeq 4000",
                "Data processing": "Read Count with DGEList (Edge R)Preprocessing and normalization factors in EdgeR/limmaLog transformed normalized expression with CPM functionVoom transformation and calculation of variance weights, filtering linear models in limmaAssembly: GRCh 38Supplementary files format and content: Excel file",
                "Platform ID": "GPL20301"
            }
        },
        "Supplementary file": [
            {
                "file_name": "GSE205492_rnaseq_workshop_normalized_counts.txt.gz",
                "file_size": "942.8 Kb",
                "file_type": "TXT",
                "download_link": "/geo/download/?acc=GSE205492&format=file&file=GSE205492%5Frnaseq%5Fworkshop%5Fnormalized%5Fcounts%2Etxt%2Egz"
            }
        ]
    },
    "GSE243904": {
        "Status": "Public on Sep 25, 2023",
        "Title": "Antitumor effects of PRMT5 inhibition in sarcomas [RNA-seq]",
        "Organism": "Homo sapiens",
        "Experiment type": "Expression profiling by high throughput sequencing",
        "Summary": "Patients with advanced soft-tissue sarcomas (STSs) have few therapeutic options. Protein arginine methyltransferase 5 (PRMT5), an anticancer target, has been extensively investigated in recent years in epithelial tumors. To date, no data related to the biological role of PRMT5 inhibition and its potential effect as a treatment in STS have been reported. To investigate the therapeutic potential of PRMT5 targeting in STS, we first evaluated the prognostic value of PRMT5 expression in 2 different cohorts of patients with STS. We then used the potent and selective GSK3326595 (GSK595) compound to investigate the antitumor effect of the pharmacological inhibition of PRMT5 in vitro via MTT, apoptosis, cell cycle, clonogenicity and proliferation assays. In vivo studies were performed with two animal models to evaluate the effects of GSK595 on tumor growth. The mechanisms of action were investigated by RNA sequencing, metabolic pathway analysis, Western blotting and glucose uptake/lactate production assays. High PRMT5 gene expression levels were significantly associated with worsened metastasis-free survival of STS patients. GSK595 decreased the global symmetric dimethylarginine level, the proliferation rate and clonogenicity of STS cell lines in vitro and tumor growth in vivo. Moreover, PRMT5 inhibition regulated aerobic glycolysis through downregulation of key enzymes of glycolysis as well as glucose uptake and lactate production. The present study demonstrated that PRMT5 regulates STS cell metabolism and thus represents a potential therapeutic target for STS. Additional studies in diverse sarcoma subtypes will be essential to confirm and expand upon these findings.",
        "Overall design": "To decipher the mechanism of action of PRMT5 inhibition in STS cell lines, we explored the transcriptomic changes in IB111 cells after 10 days of treatment by RNA sequencing. IB111 cells were untreated or treated with GSK595 at the IC50 every 3 days for 10 days in triplicate. RNA was then extracted and sequenced on a NovaSeq6000 S2 platform.",
        "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
        "Samples": {
            "GSM7798061": {
                "link": "/geo/query/acc.cgi?acc=GSM7798061",
                "name": "IB111 cell line, Control, rep1",
                "Status": "Public on Sep 25, 2023",
                "Title": "IB111 cell line, Control, rep1",
                "Sample type": "SRA",
                "Organism": "Homo sapiens",
                "Characteristics": "cell line: IB111cell type: dedifferentiated liposarcomagenotype: WTtreatment: Vehicle",
                "Treatment protocol": "IB111 cells were untreated or treated with GSK595 at the IC50 every 3 days for 10 days",
                "Growth protocol": "IB111 cells were maintained in RPMI medium 1640 GlutaMAX Supplement in the presence of 10% fetal bovine serum and 1% penicillin/streptomycin at 37°C in a humidified atmosphere containing 5% CO2",
                "Extracted molecule": "cDNA",
                "Extraction protocol": "RNA was extracted using an RNeasy Plus Mini Kit (Qiagen). The purity and concentration of the isolated RNA were determined with a NanoDrop spectrophotometer, and capillary electrophoresis using a Bioanalyzer 2100 was carried out to determine the RNA integrity number (RIN).RNA libraries were prepared using NEBNext® Ultra™ II mRNA-Seq library kit paired-end 100x2 read protocol",
                "Library strategy": "RNA-Seq",
                "Library source": "transcriptomic",
                "Instrument model": "Illumina NovaSeq 6000",
                "Data processing": "reads with low quality bases at 5’ and 3’ were trimmed using the Sickle package (Phred cut off 20, max trim size 30 nc)The SeqPrep package was used to remove sequencing adaptors from raw readsAn home-made python script was developed that split those merged reads into new non-overlapping R1 and R2 paired-end readsCurated reads were aligned using TOPHAT2 (based on aka BOWTIE2) on both the UCSC hg19 reference genome and transcriptomepost-alignment quality control of aligned reads by removing reads with mapping scores lower than 20 using Samtools (5). PCR duplicate reads were identified and removed using Picard MarkDuplicates (https://broadinstitute.github.io). Read counts were generated performed using the Python module HTSeqTranscript count data were normalized according the VOOM methodThe RNAseq differential gene expression between groups of samples was performed using the statistical t-test from the R package LIMMAWe defined the significantly up- or down-regulated transcripts using an FDR threshold of 0.05. The fold-change used to further filter the differential gene expression was set to a minimum value of 2Assembly: hg19Supplementary files format and content: tab-delimited text file of raw counts matrixSupplementary files format and content: tab delimited text file of diffenrential expression results",
                "Platform ID": "GPL24676"
            }
        },
        "Supplementary file": [
            {
                "file_name": "GSE243904_DGE_NORM_IB11_PRMT5_Treated_vs_notreated_LIMMA_T-TEST_AFFYX.txt.gz",
                "file_size": "2.9 Mb",
                "file_type": "TXT",
                "download_link": "/geo/download/?acc=GSE243904&format=file&file=GSE243904%5FDGE%5FNORM%5FIB11%5FPRMT5%5FTreated%5Fvs%5Fnotreated%5FLIMMA%5FT%2DTEST%5FAFFYX%2Etxt%2Egz"
            }
        ]
    },
    "GSE243759": {
        "Status": "Public on Sep 25, 2023",
        "Title": "Antitumor effects of PRMT5 inhibition in sarcomas",
        "Organism": "Homo sapiens",
        "Experiment type": "Expression profiling by array",
        "Summary": "Patients with advanced soft-tissue sarcomas (STSs) have few therapeutic options. Protein arginine methyltransferase 5 (PRMT5), an anticancer target, has been extensively investigated in recent years in epithelial tumors. To date, no data related to the biological role of PRMT5 inhibition and its potential effect as a treatment in STS have been reported.  To investigate the therapeutic potential of PRMT5 targeting in STS, we first evaluated the prognostic value of PRMT5 expression in 2 different cohorts of patients with STS. We then used the potent and selective GSK3326595 (GSK595) compound to investigate the antitumor effect of the pharmacological inhibition of PRMT5 in vitro via MTT, apoptosis, cell cycle, clonogenicity and proliferation assays. In vivo studies were performed with two animal models to evaluate the effects of GSK595 on tumor growth. The mechanisms of action were investigated by RNA sequencing, metabolic pathway analysis, Western blotting and glucose uptake/lactate production assays.  High PRMT5 gene expression levels were significantly associated with worsened metastasis-free survival of STS patients. GSK595 decreased the global symmetric dimethylarginine level, the proliferation rate and clonogenicity of STS cell lines in vitro and tumor growth in vivo. Moreover, PRMT5 inhibition regulated aerobic glycolysis through downregulation of key enzymes of glycolysis as well as glucose uptake and lactate production.  The present study demonstrated that PRMT5 regulates STS cell metabolism and thus represents a potential therapeutic target for STS. Additional studies in diverse sarcoma subtypes will be essential to confirm and expand upon these findings.",
        "Overall design": "To decipher the mechanism of action of PRMT5 inhibition in STS cell lines, four sarcoma cell lines (the IB111, IB114, IB115, and IB128 cells) were untreated or treated with GSK595 at IC80 every 3 days for 10 days and RNA were analyzed by Nanostring assay using an nCounter Metabolic Pathways Panel in the nCounter Max Analyzer.",
        "Platforms": "Platforms (1), GPL31904, NanoString  nCounter Human  Metabolic Pathways Panel [Gene Symbol version]",
        "Samples": {
            "GSM7795419": {
                "link": "/geo/query/acc.cgi?acc=GSM7795419",
                "name": "IB111 cell line, Control, rep1",
                "Supplementary file": [
                    {
                        "file_name": "GSM7795419_20211109_31020962105_run2_IB111_n1_ctl_07.RCC.gz",
                        "file_size": "8.7 Kb",
                        "file_type": "RCC",
                        "download_link": "/geo/download/?acc=GSM7795419&format=file&file=GSM7795419%5F20211109%5F31020962105%5Frun2%5FIB111%5Fn1%5Fctl%5F07%2ERCC%2Egz"
                    }
                ],
                "Status": "Public on Sep 25, 2023",
                "Title": "IB111 cell line, Control, rep1",
                "Sample type": "RNA",
                "Organism": "Homo sapiens",
                "Characteristics": "cell type: dedifferentiated liposarcoma",
                "Treatment protocol": "Cells were untreated or treated with GSK595 at their respective IC80 every 3 days for 10 days",
                "Growth protocol": "Cells were maintained in RPMI medium 1640 GlutaMAX Supplement in the presence of 10% fetal bovine serum and 1% penicillin/streptomycin at 37°C in a humidified atmosphere containing 5% CO2",
                "Extracted molecule": "total RNA",
                "Extraction protocol": "RNA was extracted using an RNeasy Plus Mini Kit (Qiagen). The purity and concentration of the isolated RNA were determined with a NanoDrop spectrophotometer, and capillary electrophoresis using a Bioanalyzer 2100 was carried out to determine the RNA integrity number (RIN).",
                "Data processing": "Raw gene expression was normalized using the RUVseq pipeline, and differential gene expression was analyzed using Deseq2 (v1.28). Pathway scoring was performed on normalized data using the single-sample GSEA method (ConsensusTME 0.0.1.9), and differences between vehicle and treated samples were evaluated for significance using Wilcoxon tests",
                "Platform ID": "GPL31904"
            }
        },
        "Supplementary file": [
            {
                "file_name": "GSE243759_RAW.tar",
                "file_size": "230.0 Kb",
                "file_type": "TAR (of RCC)",
                "download_link": "/geo/download/?acc=GSE243759&format=file"
            }
        ]
    },
    "GSE168205": {
        "Status": "Public on Mar 04, 2021",
        "Title": "The TAZ-CAMTA1 and YAP-TFE3 fusion proteins modulate the basal TAZ/YAP transcriptional program by recruiting the Ada2a-containing histone acetyltransferase complex [RNA-seq]",
        "Organism": "Homo sapiens",
        "Experiment type": "Expression profiling by high throughput sequencing",
        "Summary": "The WWTR1(TAZ)-CAMTA1 and YAP1-TFE3 gene fusions are disease defining gene alterations for epithelioid hemangioendothelioma, a vascular cancer. The resultant fusion proteins fuse the C terminus of CAMTA1 and TFE3 in frame to the N terminus of TAZ and YAP, respectively. An unbiased BioID-mass spectrometry/RNAi screen identified YEATS2 and ZZZ3 as components of the Ada2a-containing histone acetyltransferase complex and key interactors of both TAZ-CAMTA1 and YAP-TFE3.An integrative NGS approach including RNA-Seq and ATAC-Seq showed that the differentially expressed genes in YAP-TFE3 cells with knockdown of YEATS2 or ZZZ3 are nested in regions of open chromatin unique to YAP-TFE3.The altered transcriptional program of the fusion proteins is modulated by the Ada2a-containing histone acetyltransferase complex.",
        "Overall design": "mRNA profiles of SW872 liposarcoma cells transduced with fusion gene constructs with shRNAs targeting YEATS2 or  ZZZ3 were generated by deep sequencing, in duplicate.",
        "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
        "Samples": {
            "GSM5133945": {
                "link": "/geo/query/acc.cgi?acc=GSM5133945",
                "name": "TAZ-CAMTA1 shNon-targeting rep1",
                "Supplementary file": [
                    {
                        "file_name": "GSM5133945_TC_NT_1_lane2_20201012000_S17_L002-ready.counts.txt.gz",
                        "file_size": "248.4 Kb",
                        "file_type": "TXT",
                        "download_link": "/geo/download/?acc=GSM5133945&format=file&file=GSM5133945%5FTC%5FNT%5F1%5Flane2%5F20201012000%5FS17%5FL002%2Dready%2Ecounts%2Etxt%2Egz"
                    }
                ],
                "Status": "Public on Mar 04, 2021",
                "Title": "TAZ-CAMTA1 shNon-targeting rep1",
                "Sample type": "SRA",
                "Organism": "Homo sapiens",
                "Characteristics": "cell line: SW872transduction: TAZ-CAMTA1 shNon-targeting",
                "Growth protocol": "SW872 cells stably expressing TAZ-CAMTA1 or YAP-TFE3 with stable knockdown of YEATS2 or ZZZ3",
                "Extracted molecule": "cDNA",
                "Extraction protocol": "Total RNA was isolated using the PureLink™ RNA mini kit (Invitrogen-ThermoFisher Scientific).  On-column DNase (Invitrogen) treatment was performed according to manufacturer’s instructionsIllumina TruSeq stranded mRNA sample preparation kit",
                "Library strategy": "RNA-Seq",
                "Library source": "transcriptomic",
                "Instrument model": "Illumina NovaSeq 6000",
                "Data processing": "Illumina Casava1.7 software used for basecalling.Reads were demultiplexed and converted from the native Illumina BCL format to fastq format using an in-house python wrapper to Illumina’s ‘bcl2fastq’ conversion utility.FASTQ data were processed with ‘bcbio’, a best-practices pipeline available at the open-source ‘bcbio-nextgen’ projectReads from the SW872 line was aligned against the ensembl reference ‘hg38’Transcript-level abundances were converted to gene-level counts using the ‘tximport’ packageGenome_build: hg38Supplementary_files_format_and_content: tab-delimited text files include count values for each sample ...",
                "Platform ID": "GPL24676"
            }
        },
        "Supplementary file": [
            {
                "file_name": "GSE168205_RAW.tar",
                "file_size": "2.9 Mb",
                "file_type": "TAR (of TXT)",
                "download_link": "/geo/download/?acc=GSE168205&format=file"
            },
            {
                "file_name": "GSE168205_annotated_combined.counts.txt.gz",
                "file_size": "986.8 Kb",
                "file_type": "TXT",
                "download_link": "/geo/download/?acc=GSE168205&format=file&file=GSE168205%5Fannotated%5Fcombined%2Ecounts%2Etxt%2Egz"
            }
        ]
    },
    "GSE152778": {
        "Status": "Public on Dec 01, 2020",
        "Title": "The TAZ-CAMTA1 and YAP-TFE3 fusion proteins modulate the basal TAZ/YAP transcriptional program by recruiting the Ada2a-containing histone acetyltransferase complex [chipseq]",
        "Organism": "Homo sapiens",
        "Experiment type": "Genome binding/occupancy profiling by high throughput sequencing",
        "Summary": "The WWTR1(TAZ)-CAMTA1 and YAP1-TFE3 gene fusions are disease defining gene alterations for epithelioid hemangioendothelioma, a vascular cancer. The resultant fusion proteins fuse the C terminus of CAMTA1 and TFE3 in frame to the N terminus of TAZ and YAP, respectively. An unbiased BioID-mass spectrometry/RNAi screen identified YEATS2 and ZZZ3 as components of the Ada2a-containing histone acetyltransferase complex and key interactors of both TAZ-CAMTA1 and YAP-TFE3.An integrative NGS approach including RNA-Seq, ChIP-Seq, and ATAC-Seq showed TAZ-CAMTA1 and YAP-TFE3 transcriptional programs overlap with TAZ and YAP but also drive expression of a novel transcriptome.The altered transcriptional program of the fusion proteins owing to altered DNA binding as well as shifts in the chromatin landscape.",
        "Overall design": "chromatin binding profile of SW872 liposarcoma cells transduced with fusion gene constructs were generated by chromatin immunoprecipitation and subsequent deep sequencing, in triplicate, using Illumina HiSeq4000.",
        "Platforms": "Platforms (1), GPL20301, Illumina HiSeq 4000 (Homo sapiens)",
        "Samples": {
            "GSM4626152": {
                "link": "/geo/query/acc.cgi?acc=GSM4626152",
                "name": "CAMTA1_FLAG_IP Rep 1 (chipseq)",
                "Status": "Public on Dec 01, 2020",
                "Title": "CAMTA1_FLAG_IP Rep 1 (chipseq)",
                "Sample type": "SRA",
                "Organism": "Homo sapiens",
                "Characteristics": "cell line: SW872 liposarcoma cells",
                "Growth protocol": "SW872 cells were stably transduced and grown to 90% confluence 48 hrs before collection (except CAMTA1 collected at sub-confluence)",
                "Extracted molecule": "ChIP",
                "Extraction protocol": "Cells were cross-linked and prepared using the SimpleChIP Enzymatic Chromatin IP KIt according to manufacturer's instructions. Flag tagged proteins were immunoprecipated with the anti-DYKDDDDK rabbit monoclonal antibody (Cell Signaling)The SimpleChIP ChIP-seq DNA Library Prep Kit for Illumina was used to prepare the DNA library according to manufacturer's instructions",
                "Library strategy": "ChIP-Seq",
                "Library source": "genomic",
                "Instrument model": "Illumina HiSeq 4000",
                "Description": "camta1_1_FLAG",
                "Data processing": "Illumina Casava1.7 software used for basecalling.Reads were demultiplexed and converted from the native Illumina BCL format to fastq format using an in-house python wrapper to Illumina’s ‘bcl2fastq’ conversion utility.FASTQ data were processed with ‘bcbio’, a best-practices pipeline available at the open-source ‘bcbio-nextgen’ projectReads from the SW872 line was aligned against the ensembl reference ‘hg38’Transcript-level abundances were converted to gene-level counts using the ‘tximport’ packageGenome_build: hg38Supplementary_files_format_and_content: narrowPeak",
                "Platform ID": "GPL20301"
            }
        },
        "Supplementary file": [
            {
                "file_name": "GSE152778_CAMTA1_FLAG_peaks.narrowPeak.gz",
                "file_size": "5.0 Kb",
                "file_type": "NARROWPEAK",
                "download_link": "/geo/download/?acc=GSE152778&format=file&file=GSE152778%5FCAMTA1%5FFLAG%5Fpeaks%2EnarrowPeak%2Egz"
            },
            {
                "file_name": "GSE152778_EV_IgG_peaks.narrowPeak.gz",
                "file_size": "907 b",
                "file_type": "NARROWPEAK",
                "download_link": "/geo/download/?acc=GSE152778&format=file&file=GSE152778%5FEV%5FIgG%5Fpeaks%2EnarrowPeak%2Egz"
            },
            {
                "file_name": "GSE152778_TAZ4SA_FLAG_peaks.narrowPeak.gz",
                "file_size": "28.4 Kb",
                "file_type": "NARROWPEAK",
                "download_link": "/geo/download/?acc=GSE152778&format=file&file=GSE152778%5FTAZ4SA%5FFLAG%5Fpeaks%2EnarrowPeak%2Egz"
            },
            {
                "file_name": "GSE152778_TC_FLAG_peaks.narrowPeak.gz",
                "file_size": "27.6 Kb",
                "file_type": "NARROWPEAK",
                "download_link": "/geo/download/?acc=GSE152778&format=file&file=GSE152778%5FTC%5FFLAG%5Fpeaks%2EnarrowPeak%2Egz"
            },
            {
                "file_name": "GSE152778_TFE3_chip_peaks.narrowPeak.gz",
                "file_size": "10.3 Kb",
                "file_type": "NARROWPEAK",
                "download_link": "/geo/download/?acc=GSE152778&format=file&file=GSE152778%5FTFE3%5Fchip%5Fpeaks%2EnarrowPeak%2Egz"
            },
            {
                "file_name": "GSE152778_YAP5SA_chip_peaks.narrowPeak.gz",
                "file_size": "72.4 Kb",
                "file_type": "NARROWPEAK",
                "download_link": "/geo/download/?acc=GSE152778&format=file&file=GSE152778%5FYAP5SA%5Fchip%5Fpeaks%2EnarrowPeak%2Egz"
            },
            {
                "file_name": "GSE152778_YT_chip_peaks.narrowPeak.gz",
                "file_size": "67.1 Kb",
                "file_type": "NARROWPEAK",
                "download_link": "/geo/download/?acc=GSE152778&format=file&file=GSE152778%5FYT%5Fchip%5Fpeaks%2EnarrowPeak%2Egz"
            }
        ]
    },
    "GSE152737": {
        "Status": "Public on Dec 01, 2020",
        "Title": "The TAZ-CAMTA1 and YAP-TFE3 fusion proteins modulate the basal TAZ/YAP transcriptional program by recruiting the Ada2a-containing histone acetyltransferase complex [rnaseq_sw872]",
        "Organism": "Homo sapiens",
        "Experiment type": "Expression profiling by high throughput sequencing",
        "Summary": "The WWTR1(TAZ)-CAMTA1 and YAP1-TFE3 gene fusions are disease defining gene alterations for epithelioid hemangioendothelioma, a vascular cancer. The resultant fusion proteins fuse the C terminus of CAMTA1 and TFE3 in frame to the N terminus of TAZ and YAP, respectively. An unbiased BioID-mass spectrometry/RNAi screen identified YEATS2 and ZZZ3 as components of the Ada2a-containing histone acetyltransferase complex and key interactors of both TAZ-CAMTA1 and YAP-TFE3.An integrative NGS approach including RNA-Seq, ChIP-Seq, and ATAC-Seq showed TAZ-CAMTA1 and YAP-TFE3 transcriptional programs overlap with TAZ and YAP but also drive expression of a novel transcriptome.The altered transcriptional program of the fusion proteins owing to altered DNA binding as well as shifts in the chromatin landscape.",
        "Overall design": "mRNA profiles of SW872 liposarcoma cells transduced with fusion gene constructs were generated by deep sequencing, in triplicate, using Illumina HiSeq4000.",
        "Platforms": "Platforms (1), GPL20301, Illumina HiSeq 4000 (Homo sapiens)",
        "Samples": {
            "GSM4625436": {
                "link": "/geo/query/acc.cgi?acc=GSM4625436",
                "name": "CAMTA1 Rep 1 (rnaseq_sw872)",
                "Supplementary file": [
                    {
                        "file_name": "GSM4625436_SW872_CAMTA1_rep1-ready.counts.txt.gz",
                        "file_size": "257.9 Kb",
                        "file_type": "TXT",
                        "download_link": "/geo/download/?acc=GSM4625436&format=file&file=GSM4625436%5FSW872%5FCAMTA1%5Frep1%2Dready%2Ecounts%2Etxt%2Egz"
                    }
                ],
                "Status": "Public on Dec 01, 2020",
                "Title": "CAMTA1 Rep 1 (rnaseq_sw872)",
                "Sample type": "SRA",
                "Organism": "Homo sapiens",
                "Characteristics": "cell line: SW872 liposarcoma cells",
                "Growth protocol": "SW872 cells were stably transduced and grown to confluence 48 hrs before collection (except CAMTA1 collected at sub-confluence)",
                "Extracted molecule": "cDNA",
                "Extraction protocol": "Total RNA was isolated using the PureLink™ RNA mini kit (Invitrogen-ThermoFisher Scientific).  On-column DNase (Invitrogen) treatment was performed according to manufacturer’s instructionsIllumina TruSeq stranded mRNA sample preparation kit",
                "Library strategy": "RNA-Seq",
                "Library source": "transcriptomic",
                "Instrument model": "Illumina HiSeq 4000",
                "Description": "camta1_rep1",
                "Data processing": "Illumina Casava1.7 software used for basecalling.Reads were demultiplexed and converted from the native Illumina BCL format to fastq format using an in-house python wrapper to Illumina’s ‘bcl2fastq’ conversion utility.FASTQ data were processed with ‘bcbio’, a best-practices pipeline available at the open-source ‘bcbio-nextgen’ projectReads from the SW872 line was aligned against the ensembl reference ‘hg38’Transcript-level abundances were converted to gene-level counts using the ‘tximport’ packageGenome_build: hg38Supplementary_files_format_and_content: tab-delimited text files include count values for each sample ...",
                "Platform ID": "GPL20301"
            }
        },
        "Supplementary file": [
            {
                "file_name": "GSE152737_RAW.tar",
                "file_size": "6.0 Mb",
                "file_type": "TAR (of TXT)",
                "download_link": "/geo/download/?acc=GSE152737&format=file"
            }
        ]
    }
}