{
    "download successfully": [
        {
            "title": "<ArticleTitle>PIK3R3, part of the regulatory domain of PI3K, is upregulated in sarcoma stem-like cells and promotes invasion, migration, and chemotherapy resistance.</ArticleTitle>",
            "abstract": "To identify drivers of sarcoma cancer stem-like cells (CSCs), we compared gene expression using RNA sequencing between HT1080 fibrosarcoma and SK-LMS-1 leiomyosarcoma spheroids (which are enriched for CSCs) compared with the parent populations. The most overexpressed survival signaling-related gene in spheroids was phosphoinositide-3-kinase regulatory subunit 3 (PIK3R3), a regulatory subunit of PI3K, which functions in tumorigenesis and metastasis. In a human sarcoma microarray, PIK3R3 was also overexpressed by 4.1-fold compared with normal tissues. PIK3R3 inhibition using shRNA in the HT1080, SK-LMS-1, and DDLS8817 dedifferentiated liposarcoma in spheroids and in CD133+ cells (a CSC marker) reduced expression of CD133 and the stem cell factor Nanog and blocked spheroid formation by 61-71%. Mechanistic studies showed that in spheroid cells, PIK3R3 activated AKT and ERK signaling. Inhibition of PIK3R3, AKT, or ERK using shRNA or inhibitors decreased expression of Nanog, spheroid formation by 68-73%, and anchorage-independent growth by 76-91%. PIK3R3 or ERK1/2 inhibition similarly blocked sarcoma spheroid cell migration, invasion, secretion of MMP-2, xenograft invasion into adjacent normal tissue, and chemotherapy resistance. Together, these results show that signaling through the PIK3R3/ERK/Nanog axis promotes sarcoma CSC phenotypes such as migration, invasion, and chemotherapy resistance, and identify PIK3R3 as a potential therapeutic target in sarcoma.",
            "doi": "10.1038/s41419-021-04036-5",
            "pmid": "34321458",
            "pmcid": "8319167",
            "score": 4,
            "path": "22/papers/8319167.pdf"
        },
        {
            "title": "<article-title>Functional Profiling of Soft Tissue Sarcoma Using Mechanistic Models</article-title>\n      ",
            "abstract": "<p>Soft tissue sarcoma is an umbrella term for a group of rare cancers that are difficult to treat. In addition to surgery, neoadjuvant chemotherapy has shown the potential to downstage tumors and prevent micrometastases. However, finding effective therapeutic targets remains a research challenge. Here, a previously developed computational approach called mechanistic models of signaling pathways has been employed to unravel the impact of observed changes at the gene expression level on the ultimate functional behavior of cells. In the context of such a mechanistic model, RNA-Seq counts sourced from the Recount3 resource, from The Cancer Genome Atlas (TCGA) Sarcoma project, and non-diseased sarcomagenic tissues from the Genotype-Tissue Expression (GTEx) project were utilized to investigate signal transduction activity through signaling pathways. This approach provides a precise view of the relationship between sarcoma patient survival and the signaling landscape in tumors and their environment. Despite the distinct regulatory alterations observed in each sarcoma subtype, this study identified 13 signaling circuits, or elementary sub-pathways triggering specific cell functions, present across all subtypes, belonging to eight signaling pathways, which served as predictors for patient survival. Additionally, nine signaling circuits from five signaling pathways that highlighted the modifications tumor samples underwent in comparison to normal tissues were found. These results describe the protective role of the immune system, suggesting an anti-tumorigenic effect in the tumor microenvironment, in the process of tumor cell detachment and migration, or the dysregulation of ion homeostasis. Also, the analysis of signaling circuit intermediary proteins suggests multiple strategies for therapy.</p>\n      ",
            "doi": null,
            "pmid": null,
            "pmcid": null,
            "score": 4,
            "path": "22/papers/ijms-24-14732.pdf"
        },
        {
            "title": "<article-title>Bioinformatics Screen Reveals Gli-Mediated Hedgehog Signaling as an Associated Pathway to Poor Immune Infiltration of Dedifferentiated Liposarcoma</article-title>\n      ",
            "abstract": "<p>Liposarcomas (LPSs) are a rare soft tissue malignancy with a variable clinical prognosis dependent on tumor differentiation. Well-differentiated (WDLPS) and dedifferentiated (DDLPS) liposarcomas most commonly occur both in extremities and the retroperitoneal cavity. Surgical resection and post-operative monitoring are effective forms of treatment; however, many tumors do recur and require chemotherapeutic intervention. Liposarcomas have high intratumoral variability, which can influence drug response and microenvironment interactions. Using a broad bioinformatics approach, we show that Hedgehog signaling, a developmental pathway, is upregulated in DDLPS and correlates with a tumor gene expression signature that suggests reduced immune cell infiltration and increased extracellular matrix (ECM) protein expression.</p>\n         <p>Liposarcomas are the most diagnosed soft tissue sarcoma, with most cases consisting of well-differentiated (WDLPS) or dedifferentiated (DDLPS) histological subtypes. While both tumor subtypes can have clinical recurrence due to incomplete resections, DDLPS often has worse prognosis due to a higher likelihood of metastasis compared to its well-differentiated counterpart. Unfortunately, targeted therapeutic interventions have lagged in sarcoma oncology, making the need for molecular targeted therapies a promising future area of research for this family of malignancies. In this work, previously published data were analyzed to identify differential pathways that may contribute to the dedifferentiation process in liposarcoma. Interestingly, Gli-mediated Hedgehog signaling appeared to be enriched in dedifferentiated adipose progenitor cells and DDLPS tumors, and coincidentally Gli1 is often co-amplified with MDM2 and CDK4, given its genomic proximity along chromosome 12q13-12q15. However, we find that Gli2, but not Gli1, is differentially expressed between WDLPS and DDLPS, with a noticeable co-expression signature between Gli2 and genes involved in ECM remodeling. Additionally, Gli2 co-expression had a noticeable transcriptional signature that could suggest Gli-mediated Hedgehog signaling as an associated pathway contributing to poor immune infiltration in these tumors.</p>\n        ",
            "doi": null,
            "pmid": null,
            "pmcid": null,
            "score": 4,
            "path": "22/papers/cancers-15-03360.pdf"
        },
        {
            "title": "<article-title>Cellular origin and clonal evolution of human dedifferentiated liposarcoma</article-title>",
            "abstract": "<p id=\"Par1\">Dedifferentiated liposarcoma (DDLPS) is the most frequent high-grade soft tissue sarcoma subtype. It is characterized by a component of undifferentiated tumor cells coexisting with a component of well-differentiated adipocytic tumor cells. Both dedifferentiated (DD) and well-differentiated (WD) components exhibit <italic>MDM2</italic> amplification, however their cellular origin remains elusive. Using single-cell RNA sequencing, DNA sequencing, in situ multiplex immunofluorescence and functional assays in paired WD and DD components from primary DDLPS tumors, we characterize the cellular heterogeneity of DDLPS tumor and micro-environment. We identify a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue. We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution. Last, we show that DD tumor cells keep important biological properties of ASC including pluripotency and that their adipogenic properties are inhibited by a TGF-β-high immunosuppressive tumor micro-environment.</p>",
            "doi": "10.1038/s41467-024-52067-1",
            "pmid": null,
            "pmcid": null,
            "score": 4,
            "path": "22/papers/41467_2024_Article_52067.pdf"
        },
        {
            "title": "<ArticleTitle>Transcriptome analysis identifies TODL as a novel lncRNA associated with proliferation, differentiation, and tumorigenesis in liposarcoma through FOXM1.</ArticleTitle>",
            "abstract": "Liposarcoma, the most common soft tissue sarcoma, is a group of fat cell mesenchymal tumors with different histological subtypes. The dysregulation of long non-coding RNAs (lncRNAs) has been observed in human cancers including a few studies in sarcoma. However, the global transcriptome analysis and potential role of lncRNAs remain unexplored in liposarcoma. The present investigation uncovers the transcriptomic profile of liposarcoma by RNA sequencing to gain insight into the global transcriptional changes in liposarcoma. Our RNA sequencing analysis has identified that many oncogenic lncRNAs are differentially expressed in different subtypes of liposarcoma including MALAT1, PVT1, SNHG15, LINC00152, and MIR210HG. Importantly, we identified a highly overexpressed, unannotated, and novel lncRNA in dedifferentiated liposarcomas. We have named it TODL, transcript overexpressed in dedifferentiated liposarcoma. TODL lncRNA displayed significantly higher expression in dedifferentiated liposarcoma cell lines and patient samples. Interestingly, functional studies revealed that TODL lncRNA has an oncogenic function in liposarcoma cells by regulating proliferation, cell cycle, apoptosis, differentiation, and tumorigenesis in the murine model. Silencing of TODL lncRNA highlighted the enrichment of several key oncogenic signaling pathways including cell cycle, transcriptional misregulation, FOXM1 network, p53 signaling, PLK1 signaling, FoxO, and signaling Aurora signaling pathways. RNA pull-down assay revealed the binding of TODL lncRNA with FOXM1, an oncogenic transcription factor, and the key regulator of the cell cycle. Silencing of TODL lncRNA also induces adipogenesis in dedifferentiated liposarcomas. Altogether, our finding indicates that TODL could be utilized as a novel, specific diagnostic biomarker, and a pharmacological target for therapeutic development in controlling aggressive and metastatic dedifferentiated liposarcomas.",
            "doi": "10.1016/j.phrs.2022.106462",
            "pmid": "36167276",
            "pmcid": null,
            "score": 4,
            "path": "22/papers/1-s2.0-S104366182200408X-main.pdf"
        },
        {
            "title": "<ArticleTitle>miR-193b-Regulated Signaling Networks Serve as Tumor Suppressors in Liposarcoma and Promote Adipogenesis in Adipose-Derived Stem Cells.</ArticleTitle>",
            "abstract": "Well-differentiated and dedifferentiated liposarcomas (WDLS/DDLS) account for approximately 13% of all soft tissue sarcoma in adults and cause substantial morbidity or mortality in the majority of patients. In this study, we evaluated the functions of miRNA (miR-193b) in liposarcoma in vitro and in vivo Deep RNA sequencing on 93 WDLS, 145 DDLS, and 12 normal fat samples demonstrated that miR-193b was significantly underexpressed in DDLS compared with normal fat. Reintroduction of miR-193b induced apoptosis in liposarcoma cells and promoted adipogenesis in human adipose-derived stem cells (ASC). Integrative transcriptomic and proteomic analysis of miR-193b-target networks identified novel direct targets, including CRK-like proto-oncogene (CRKL) and focal adhesion kinase (FAK). miR-193b was found to regulate FAK-SRC-CRKL signaling through CRKL and FAK. miR-193b also stimulated reactive oxygen species signaling by targeting the antioxidant methionine sulfoxide reductase A to modulate liposarcoma cell survival and ASC differentiation state. Expression of miR-193b in liposarcoma cells was downregulated by promoter methylation, resulting at least in part from increased expression of the DNA methyltransferase DNMT1 in WDLS/DDLS. In vivo, miR-193b mimetics and FAK inhibitor (PF-562271) each inhibited liposarcoma xenograft growth. In summary, miR-193b not only functions as a tumor suppressor in liposarcoma but also promotes adipogenesis in ASC. Furthermore, this study reveals key tyrosine kinase and DNA methylation pathways in liposarcoma, some with immediate implications for therapeutic exploration. Cancer Res; 77(21); 5728-40. ©2017 AACR.",
            "doi": "10.1158/0008-5472.CAN-16-2253",
            "pmid": "28882999",
            "pmcid": null,
            "score": 4,
            "path": "22/papers/miR-193b–Regulated.pdf"
        },
        {
            "title": "<article-title>Multivariate analysis of metabolic state vulnerabilities across diverse cancer contexts reveals synthetically lethal associations</article-title>",
            "abstract": "<p id=\"P3\">Targeting the distinct metabolic needs of tumor cells has recently emerged as a promising strategy for cancer therapy. The heterogeneous, context-dependent nature of cancer cell metabolism, however, poses challenges in identifying effective therapeutic interventions. Here, we utilize various unsupervised and supervised multivariate modeling approaches to systematically pinpoint recurrent metabolic states within hundreds of cancer cell lines, elucidate their association with tumor lineage and growth environments, and uncover vulnerabilities linked to their metabolic states across diverse genetic and tissue contexts. We validate key findings via analysis of data from patient-derived tumors and pharmacological screens, and by performing new genetic and pharmacological experiments. Our analysis uncovers new synthetically lethal associations between the tumor metabolic state (e.g., oxidative phosphorylation), driver mutations (e.g., loss of tumor suppressor PTEN), and actionable biological targets (e.g., mitochondrial electron transport chain). Investigating the mechanisms underlying these relationships can inform the development of more precise and context-specific, metabolism-targeted cancer therapies.</p>",
            "doi": "10.1101/2023.11.28.569098",
            "pmid": null,
            "pmcid": null,
            "score": 4,
            "path": "22/papers/nihms-2028845.pdf"
        }
    ],
    "download failed": []
}