[
    {
        "title": "<article-title>Cellular origin and clonal evolution of human dedifferentiated liposarcoma</article-title>",
        "abstract": "<p id=\"Par1\">Dedifferentiated liposarcoma (DDLPS) is the most frequent high-grade soft tissue sarcoma subtype. It is characterized by a component of undifferentiated tumor cells coexisting with a component of well-differentiated adipocytic tumor cells. Both dedifferentiated (DD) and well-differentiated (WD) components exhibit <italic>MDM2</italic> amplification, however their cellular origin remains elusive. Using single-cell RNA sequencing, DNA sequencing, in situ multiplex immunofluorescence and functional assays in paired WD and DD components from primary DDLPS tumors, we characterize the cellular heterogeneity of DDLPS tumor and micro-environment. We identify a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue. We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution. Last, we show that DD tumor cells keep important biological properties of ASC including pluripotency and that their adipogenic properties are inhibited by a TGF-β-high immunosuppressive tumor micro-environment.</p>",
        "doi": "10.1038/s41467-024-52067-1",
        "pmid": null,
        "pmcid": null,
        "score": 4
    },
    {
        "title": "<ArticleTitle>Transcriptome analysis identifies TODL as a novel lncRNA associated with proliferation, differentiation, and tumorigenesis in liposarcoma through FOXM1.</ArticleTitle>",
        "abstract": "Liposarcoma, the most common soft tissue sarcoma, is a group of fat cell mesenchymal tumors with different histological subtypes. The dysregulation of long non-coding RNAs (lncRNAs) has been observed in human cancers including a few studies in sarcoma. However, the global transcriptome analysis and potential role of lncRNAs remain unexplored in liposarcoma. The present investigation uncovers the transcriptomic profile of liposarcoma by RNA sequencing to gain insight into the global transcriptional changes in liposarcoma. Our RNA sequencing analysis has identified that many oncogenic lncRNAs are differentially expressed in different subtypes of liposarcoma including MALAT1, PVT1, SNHG15, LINC00152, and MIR210HG. Importantly, we identified a highly overexpressed, unannotated, and novel lncRNA in dedifferentiated liposarcomas. We have named it TODL, transcript overexpressed in dedifferentiated liposarcoma. TODL lncRNA displayed significantly higher expression in dedifferentiated liposarcoma cell lines and patient samples. Interestingly, functional studies revealed that TODL lncRNA has an oncogenic function in liposarcoma cells by regulating proliferation, cell cycle, apoptosis, differentiation, and tumorigenesis in the murine model. Silencing of TODL lncRNA highlighted the enrichment of several key oncogenic signaling pathways including cell cycle, transcriptional misregulation, FOXM1 network, p53 signaling, PLK1 signaling, FoxO, and signaling Aurora signaling pathways. RNA pull-down assay revealed the binding of TODL lncRNA with FOXM1, an oncogenic transcription factor, and the key regulator of the cell cycle. Silencing of TODL lncRNA also induces adipogenesis in dedifferentiated liposarcomas. Altogether, our finding indicates that TODL could be utilized as a novel, specific diagnostic biomarker, and a pharmacological target for therapeutic development in controlling aggressive and metastatic dedifferentiated liposarcomas.",
        "doi": "10.1016/j.phrs.2022.106462",
        "pmid": "36167276",
        "pmcid": null,
        "score": 4
    },
    {
        "title": "<ArticleTitle>PLAG1-rearrangment in a uterine leiomyosarcoma with myxoid stroma and heterologous differentiation.</ArticleTitle>",
        "abstract": "A variety of molecular alterations have been reported in uterine leiomyosarcomas, but most are considered nondiagnostic. There are, however, rare exceptions including PLAG1 rearrangement which has recently been identified in a subset of myxoid leiomyosarcomas. A 41-year-old woman presented with symptoms of a fibroid. She underwent a myomectomy which revealed a high-grade uterine sarcoma with areas of myxoid stroma and heterologous elements. The tumor expressed desmin, smooth muscle actin, H-caldesmon, and estrogen and progesterone receptors. RNA sequencing revealed a novel TRIM13-PLAG1 fusion gene which was subsequently independently confirmed by fluorescence in situ hybridization. On further evaluation the patient was found to have multiple pulmonary metastases and died due to disease progression shortly after diagnosis. This report describes a novel fusion partner of PLAG1 in a uterine leiomyosarcoma with myxoid leiomyosarcoma and heterologous elements, thereby broadening the spectrum of morphologic and genetic findings within this rare group of neoplasms.",
        "doi": "10.1002/gcc.22980",
        "pmid": "34184333",
        "pmcid": "9121515",
        "score": 2
    },
    {
        "title": "<ArticleTitle>CD4+ T cell and M2 macrophage infiltration predict dedifferentiated liposarcoma patient outcomes.</ArticleTitle>",
        "abstract": "Dedifferentiated liposarcoma (DDLPS) is one of the most common soft tissue sarcoma subtypes and is devastating in the advanced/metastatic stage. Despite the observation of clinical responses to PD-1 inhibitors, little is known about the immune microenvironment in relation to patient prognosis.",
        "doi": "10.1136/jitc-2021-002812",
        "pmid": "34465597",
        "pmcid": "8413967",
        "score": 2
    },
    {
        "title": "<ArticleTitle>Molecular Characterization of a Rare Dedifferentiated Liposarcoma With Rhabdomyosarcomatous Differentiation in a 24 Year Old.</ArticleTitle>",
        "abstract": "Aims. The aim of this study was to identify potential driver genetic alterations in a dedifferentiated liposarcoma (DDLPS) with rhabdomyosarcomatous differentiation. Methods and Results. A 24-year-old female underwent resection of an abdominal mass, which on a previous biopsy demonstrated rhabdomyosarcomatous differentiation concerning for embryonal rhabdomyosarcoma. Histologically the resected tumor displayed a high-grade sarcoma with rhabdomyosarcomatous differentiation in the background of well-differentiated liposarcoma consistent with DDLPS. Fluorescence in situ hybridization confirmed MDM2 amplification, as did array-based copy number profiling. Whole-exome sequencing revealed a somatic FGFR1 hotspot mutation and RNA sequencing an LMNB2-MAP2K6 fusion only within the dedifferentiated component. Conclusions. This study represents an in-depth examination of a rare DDLPS with rhabdomyosarcomatous differentiation in a young individual. Additionally, it is also instructive of a potential pitfall when assessing for MDM2 amplification in small biopsies. Despite exhaustive analysis, mutation and gene copy number analysis did not identify any molecular events that would underlie the rhabdomyoblastic differentiation. Our understanding of what causes some tumors to dedifferentiate as well as undergo divergent differentiation is limited, and larger studies are needed.",
        "doi": "10.1177/1066896919890401",
        "pmid": "31801397",
        "pmcid": "8302235",
        "score": 3
    },
    {
        "title": "<ArticleTitle>miR-193b-Regulated Signaling Networks Serve as Tumor Suppressors in Liposarcoma and Promote Adipogenesis in Adipose-Derived Stem Cells.</ArticleTitle>",
        "abstract": "Well-differentiated and dedifferentiated liposarcomas (WDLS/DDLS) account for approximately 13% of all soft tissue sarcoma in adults and cause substantial morbidity or mortality in the majority of patients. In this study, we evaluated the functions of miRNA (miR-193b) in liposarcoma in vitro and in vivo Deep RNA sequencing on 93 WDLS, 145 DDLS, and 12 normal fat samples demonstrated that miR-193b was significantly underexpressed in DDLS compared with normal fat. Reintroduction of miR-193b induced apoptosis in liposarcoma cells and promoted adipogenesis in human adipose-derived stem cells (ASC). Integrative transcriptomic and proteomic analysis of miR-193b-target networks identified novel direct targets, including CRK-like proto-oncogene (CRKL) and focal adhesion kinase (FAK). miR-193b was found to regulate FAK-SRC-CRKL signaling through CRKL and FAK. miR-193b also stimulated reactive oxygen species signaling by targeting the antioxidant methionine sulfoxide reductase A to modulate liposarcoma cell survival and ASC differentiation state. Expression of miR-193b in liposarcoma cells was downregulated by promoter methylation, resulting at least in part from increased expression of the DNA methyltransferase DNMT1 in WDLS/DDLS. In vivo, miR-193b mimetics and FAK inhibitor (PF-562271) each inhibited liposarcoma xenograft growth. In summary, miR-193b not only functions as a tumor suppressor in liposarcoma but also promotes adipogenesis in ASC. Furthermore, this study reveals key tyrosine kinase and DNA methylation pathways in liposarcoma, some with immediate implications for therapeutic exploration. Cancer Res; 77(21); 5728-40. ©2017 AACR.",
        "doi": "10.1158/0008-5472.CAN-16-2253",
        "pmid": "28882999",
        "pmcid": null,
        "score": 4
    },
    {
        "title": "<ArticleTitle>c-Jun promotes cell migration and drives expression of the motility factor ENPP2 in soft tissue sarcomas.</ArticleTitle>",
        "abstract": "Genomic amplification of the c-Jun proto-oncogene has been identified in ∼30% of dedifferentiated liposarcomas (DDLPS), but the functional contribution of c-Jun to the progression of DDLPS remains poorly understood. In previous work we showed that knock-down of c-Jun by RNA interference impaired the in vitro proliferation and in vivo growth of a DDLPS cell line (LP6) with genomic amplification of the c-Jun locus. Here, we used gene expression analysis and functional studies in a broad panel of cell lines to further define the role of c-Jun in DDLPS and other soft tissue sarcomas. We show that c-Jun knock-down impairs transition through the G1 phase of the cell cycle in multiple DDLPS cell lines. We also found that high levels of c-Jun expression are both necessary and sufficient to promote DDLPS cell migration and invasion in vitro. Our data suggest that high levels of c-Jun enhance motility in part by driving the expression of ENPP2/Autotaxin. c-Jun over-expression has minimal effects on in vitro proliferation but substantially enhances the in vivo growth of weakly tumourigenic DDLPS cell lines. Finally, we provide evidence that c-Jun genomic amplification and over-expression may have similar functional consequences in other types of soft tissue sarcoma. Our data suggest a model in which relatively low levels of c-Jun are sufficient for in vitro proliferation, but high levels of c-Jun enhance invasiveness and capacity for in vivo tumour growth. These observations provide an explanation for the selective advantage provided by c-Jun genomic amplification in vivo and suggest that sarcomas with elevated c-Jun levels are likely to have a particularly high malignant potential. Data from exon array and RNA-Seq experiments have been deposited in the GEO database (Accession No. GSE57531).",
        "doi": "10.1002/path.4379",
        "pmid": "24852265",
        "pmcid": "4472460",
        "score": 3
    },
    {
        "title": "<article-title>Multivariate analysis of metabolic state vulnerabilities across diverse cancer contexts reveals synthetically lethal associations</article-title>\n      ",
        "abstract": "<p id=\"P3\">Targeting the distinct metabolic needs of tumor cells has recently emerged as a promising strategy for cancer therapy. The heterogeneous, context-dependent nature of cancer cell metabolism, however, poses challenges to identifying effective therapeutic interventions. Here, we utilize various unsupervised and supervised multivariate modeling approaches to systematically pinpoint recurrent metabolic states within hundreds of cancer cell lines, elucidate their association with tumor lineage and growth environments, and uncover vulnerabilities linked to their metabolic states across diverse genetic and tissue contexts. We validate key findings via analysis of data from patient-derived tumors and pharmacological screens and by performing genetic and pharmacological experiments. Our analysis uncovers synthetically lethal associations between the tumor metabolic state (e.g., oxidative phosphorylation), driver mutations (e.g., loss of tumor suppressor PTEN), and actionable biological targets (e.g., mitochondrial electron transport chain). Investigating the mechanisms underlying these relationships can inform the development of more precise and context-specific, metabolism-targeted cancer therapies.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Adipose Tissue Plasticity: A Comprehensive Definition and Multidimensional Insight</article-title>",
        "abstract": "<p>Adipose tissue is composed of adipocytes, stromal vascular fraction, nerves, surrounding immune cells, and the extracellular matrix. Under various physiological or pathological conditions, adipose tissue shifts cellular composition, lipid storage, and organelle dynamics to respond to the stress; this remodeling is called “adipose tissue plasticity”. Adipose tissue plasticity includes changes in the size, species, number, lipid storage capacity, and differentiation function of adipocytes, as well as alterations in the distribution and cellular composition of adipose tissue. This plasticity has a major role in growth, obesity, organismal protection, and internal environmental homeostasis. Moreover, certain thresholds exist for this plasticity with significant individualized differences. Here, we comprehensively elaborate on the specific connotation of adipose tissue plasticity and the relationship between this plasticity and the development of many diseases. Meanwhile, we summarize possible strategies for treating obesity in response to adipose tissue plasticity, intending to provide new insights into the dynamic changes in adipose tissue and contribute new ideas to relevant clinical problems.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>An engineered model of metastatic colonization of human bone marrow reveals breast cancer cell remodeling of the hematopoietic niche</article-title>",
        "abstract": "<p>Metastatic disease remains the most significant cause of mortality in cancer patients, due in part to the lack of model systems capable of recapitulating human, patient-specific effects of metastasis. Disseminated cancer cells find microenvironmental niches that support their survival after treatment, leading to recurrence of disease later in life. We report the development of an engineered model of breast cancer (BC) colonization of human bone marrow (BM), allowing for the dissection of niche components that sustain tumor cell adaptation and characterization of blood and immune cell responses to cancer invasion. Further, we demonstrate utility of this model for studying the growth of primary patient-derived BC organoids within the BM niche, providing a unique personalized model of secondary metastatic colonization.</p>",
        "doi": "10.1073/pnas.2405257121",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Comprehensive analysis of prognostic and immunological role of basement membrane‐related genes in soft tissue sarcoma</article-title>",
        "abstract": "<p>Soft tissue sarcoma (STS) represents highly multifarious malignant tumors that often occur in adolescents and have a poor prognosis. The basement membrane, as an ancient cellular matrix, was recently proven to play a vital role in developing abundant tumors. The relationship between basement membrane‐related genes and STS remains unknown.</p> <p>Consensus clustering was employed to identify subgroups related to differentially expressed basement membrane‐related genes. Cox and least absolute shrinkage and selection operator regression analyses were utilized to construct this novel signature. Then, we established a nomogram and calibration curve, including the risk score and available clinical characteristics. Finally, we carried out functional enrichment analysis and immune microenvironment analysis to investigate enriched pathways and the tumor immune microenvironment related to the novel signature.</p> <p>A prognostic predictive signature consisting of eight basement membrane‐related genes was established. Kaplan–Meier survival curves demonstrated that the patients in the high‐risk group had a poor prognosis. Independent analysis illustrated that this risk model could be an independent prognostic predictor. We validated the accuracy of our signature in the validation data set. In addition, gene set enrichment analysis and immune microenvironment analysis showed that patients with low‐risk scores were enriched in some pathways associated with immunity. Finally, in vitro experiments showed significantly differential expression levels of these signature genes in STS cells and PSAT1 could promote the malignant behavior of STS.</p> <p>The novel signature is a promising prognostic predictor for STS. The present study may improve the prognosis and enhance individualized treatment for STS in the future.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>The Nuclear NF-κB Regulator IκBζ: Updates on Its Molecular Functions and Pathophysiological Roles</article-title>",
        "abstract": "<p>More than a decade after the discovery of the classical cytoplasmic IκB proteins, IκBζ was identified as an additional member of the IκB family. Unlike cytoplasmic IκB proteins, IκBζ has distinct features, including its nuclear localization, preferential binding to NF-κB subunits, unique expression properties, and specialized role in NF-κB regulation. While the activation of NF-κB is primarily controlled by cytoplasmic IκB members at the level of nuclear entry, IκBζ provides an additional layer of NF-κB regulation in the nucleus, enabling selective gene activation. Human genome-wide association studies (GWAS) and gene knockout experiments in mice have elucidated the physiological and pathological roles of IκBζ. Despite the initial focus to its role in activated macrophages, IκBζ has since been recognized as a key player in the IL-17-triggered production of immune molecules in epithelial cells, which has garnered significant clinical interest. Recent research has also unveiled a novel molecular function of IκBζ, linking NF-κB and the POU transcription factors through its N-terminal region, whose role had remained elusive for many years.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Advantages of the zebrafish tumor xenograft model: the evaluation of efficacy in cancer therapy and the application to the study of lncRNAs</article-title>",
        "abstract": "<p>In the current preclinical anti-tumor researches, there is a general lack of an <italic>in vivo</italic> model that can quickly and efficiently screen effective anti-tumor drugs. As a species that is 87% genetically similar to humans, zebrafish have been widely used to model human diseases, and they are considered an alternative economic model for studying cancer development, proliferation, and metastasis. The zebrafish tumor xenograft model has been effectively used for cancer drug development at all levels, including target validation, and high-throughput screening of long non-coding RNAs (lncRNAs) that may be involved in tumor regulation. In this review, we provide a comprehensive overview of zebrafish as an <italic>in vivo</italic> model for cancer cell growth, migration, anti-tumor immunotherapy, and anti-tumor drug screening. In addition, the regulatory mechanisms of some active lncRNAs have been identified to play a role in the pathogenesis of cancer, but it is still necessary to take advantage of the efficient zebrafish model to screen and learn more about the role of these molecules in tumor development and migration. Current anti-tumor therapies are limited by severe toxicity and multidrug resistance. There is an urgent need for the cost-effective and efficient <italic>in vivo</italic> research tools to improve our understanding and overcome these problems. This paper reviews the different purposes of anti-tumor research using zebrafish model. We discuss the use of zebrafish in cancer cell proliferation and metastasis, identifying signaling pathways, cancer drug discovery and treatment development, and toxicity studies. Finally, this review highlights the limitations of the field and future directions to effectively utilize zebrafish as a highly efficient model for cancer treatment development.</p>",
        "doi": "10.3389/fimmu.2024.1483192",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Transcriptional rewiring in CD8<sup>+</sup> T cells: implications for CAR-T cell therapy against solid tumours</article-title>",
        "abstract": "<p>T cells engineered to express chimeric-antigen receptors (CAR-T cells) can effectively control relapsed and refractory haematological malignancies in the clinic. However, the successes of CAR-T cell therapy have not been recapitulated in solid tumours due to a range of barriers such as immunosuppression, poor infiltration, and tumour heterogeneity. Numerous strategies are being developed to overcome these barriers, which include improving culture conditions and manufacturing protocols, implementing novel CAR designs, and novel approaches to engineering the T cell phenotype. In this review, we describe the various emerging strategies to improve CAR T cell therapy for solid tumours. We specifically focus on new strategies to modulate cell function and fate that have precipitated from the growing knowledge of transcriptional circuits driving T cell differentiation, with the ultimate goal of driving more productive anti-tumour T cell immunity. Evidence shows that enrichment of particular phenotypic subsets of T cells in the initial cell product correlates to improved therapeutic responses and clinical outcomes. Furthermore, T cell exhaustion and poor persistence are major factors limiting therapeutic efficacy. The latest preclinical work shows that targeting specific master regulators and transcription factors can overcome these key barriers, resulting in superior T cell therapeutic products. This can be achieved by targeting key transcriptional circuits promoting memory-like phenotypes or sustaining key effector functions within the hostile tumour microenvironment. Additional discussion points include emerging considerations for the field such as (i) targeting permutations of transcription factors, (ii) transient expression systems, (iii) tissue specificity, and (iv) expanding this strategy beyond CAR-T cell therapy and cancer.</p>",
        "doi": "10.3389/fimmu.2024.1412731",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>The roles of TAF1 in neuroscience and beyond</article-title>",
        "abstract": "<p>The transcriptional machinery is essential for gene expression and regulation; dysregulation of transcription can result in a range of pathologies, including neurodegeneration, cancer, developmental disorders and cardiovascular disease. A key component of RNA polymerase II-mediated transcription is the basal transcription factor IID, which is formed of the TATA box-binding protein (TBP) and 14 TBP-associated factors (TAFs), the largest of which is the TAF1 protein, encoded on the X chromosome (Xq13.1). <italic toggle=\"yes\">TAF1</italic> is dysregulated in X-linked dystonia–parkinsonism and congenital mutations in the gene are causative for neurodevelopmental phenotypes; TAF1 dysfunction is also associated with cardiac anomalies and cancer. However, how TAF1 contributes to pathology is unclear. Here, we highlight the key aspects of the <italic toggle=\"yes\">TAF1</italic> gene and protein function that may link transcriptional regulation with disorders of development, growth and adult-onset disorders of motor impairment. We highlight the need to experimentally investigate the full range of TAF1 messenger RNA variants and protein isoforms in human and mouse to aid our understanding of TAF1 biology. Furthermore, the X-linked nature of <italic toggle=\"yes\">TAF1</italic>-related diseases adds complexity to understanding phenotypes. Overall, we shed light on the aspects of TAF1 biology that may contribute to disease and areas that could be addressed for future research and targeted therapeutics.</p>",
        "doi": "10.1098/rsos.240790",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Epigenetics in the formation of pathological aggregates in amyotrophic lateral sclerosis</article-title>",
        "abstract": "<p>The progressive degeneration of motor neurons in amyotrophic lateral sclerosis (ALS) is accompanied by the formation of a broad array of cytoplasmic and nuclear neuronal inclusions (protein aggregates) largely containing RNA-binding proteins such as TAR DNA-binding protein 43 (TDP-43) or fused in sarcoma/translocated in liposarcoma (FUS/TLS). This process is driven by a liquid-to-solid phase separation generally from proteins in membrane-less organelles giving rise to pathological biomolecular condensates. The formation of these protein aggregates suggests a fundamental alteration in the mRNA expression or the levels of the proteins involved. Considering the role of the epigenome in gene expression, alterations in DNA methylation, histone modifications, chromatin remodeling, non-coding RNAs, and RNA modifications become highly relevant to understanding how this pathological process takes effect. In this review, we explore the evidence that links epigenetic mechanisms with the formation of protein aggregates in ALS. We propose that a greater understanding of the role of the epigenome and how this inter-relates with the formation of pathological LLPS in ALS will provide an attractive therapeutic target.</p>",
        "doi": "10.3389/fnmol.2024.1417961",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>The Interplay between Autophagy and Mitochondria in Cancer</article-title>",
        "abstract": "<p>Besides producing cellular energy, mitochondria are crucial in controlling oxidative stress and modulating cellular metabolism, particularly under stressful conditions. A key aspect of this regulatory role involves the recycling process of autophagy, which helps to sustain energy homeostasis. Autophagy, a lysosome-dependent degradation pathway, plays a fundamental role in maintaining cellular homeostasis by degrading damaged organelles and misfolded proteins. In the context of tumor formation, autophagy significantly influences cancer metabolism and chemotherapy resistance, contributing to both tumor suppression and surveillance. This review focuses on the relationship between mitochondria and autophagy, specifically in the context of cancer progression. Investigating the interaction between autophagy and mitochondria reveals new possibilities for cancer treatments and may result in the development of more effective therapies targeting mitochondria, which could have significant implications for cancer treatment. Additionally, this review highlights the increasing understanding of autophagy’s role in tumor development, with a focus on modulating mitochondrial function and autophagy in both pre-clinical and clinical cancer research. It also explores the potential for developing more-targeted and personalized therapies by investigating autophagy-related biomarkers.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Unveiling the role of GAS41 in cancer progression</article-title>\n      ",
        "abstract": "<p id=\"Par1\">GAS41, a member of the human YEATS domain family, plays a pivotal role in human cancer development. It serves as a highly promising epigenetic reader, facilitating precise regulation of cell growth and development by recognizing essential histone modifications, including histone acetylation, benzoylation, succinylation, and crotonylation. Functional readouts of these histone modifications often coincide with cancer progression. In addition, <italic>GAS41</italic> functions as a novel oncogene, participating in numerous signaling pathways. Here, we summarize the epigenetic functions of GAS41 and its role in the carcinoma progression. Moving forward, elucidating the downstream target oncogenes regulated by GAS41 and the developing small molecule inhibitors based on the distinctive YEATS recognition properties will be pivotal in advancing this research field.</p>\n         <p>The online version contains supplementary material available at 10.1186/s12935-023-03098-z.</p>\n        ",
        "doi": "10.1186/s12935-023-03098-z",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Macrophage-Based Therapeutic Strategies in Hematologic Malignancies</article-title>\n      ",
        "abstract": "<p>Tumor-associated macrophages (TAMs) are the most prevalent immunosuppressive myeloid cells in the tumor microenvironment, playing significant functions in the regulation of tumor progression, invasion, and metastatic processes. The M1 and M2-polarized phenotypes of TAMs (immunostimulatory and immunosuppressive myeloid cells, respectively) have been potentially implicated in various cancers and autoimmune diseases. Understanding the precise function of TAMs could improve the assessment of the cancer response to T cell-based treatments and reverse tumor resistance to conventional therapies. Here, the involvement of TAMs in the development of various cancers, mainly hematologic tumors, and their pleiotropic activities are comprehensively discussed.</p>\n         <p>Macrophages are types of immune cells, with ambivalent functions in tumor growth, which depend on the specific environment in which they reside. Tumor-associated macrophages (TAMs) are a diverse population of immunosuppressive myeloid cells that play significant roles in several malignancies. TAM infiltration in malignancies has been linked to a poor prognosis and limited response to treatments, including those using checkpoint inhibitors. Understanding the precise mechanisms through which macrophages contribute to tumor growth is an active area of research as targeting these cells may offer potential therapeutic approaches for cancer treatment. Numerous investigations have focused on anti-TAM-based methods that try to eliminate, rewire, or target the functional mediators released by these cells. Considering the importance of these strategies in the reversion of tumor resistance to conventional therapies and immune modulatory vaccination could be an appealing approach for the immunosuppressive targeting of myeloid cells in the tumor microenvironment (TME). The combination of reprogramming and TAM depletion is a special feature of this approach compared to other clinical strategies. Thus, the present review aims to comprehensively overview the pleiotropic activities of TAMs and their involvement in various stages of cancer development as a potent drug target, with a focus on hematologic tumors.</p>\n        ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Gene Fusions in Soft Tissue Tumors: Recurrent and Overlapping Pathogenetic Themes</article-title>\n      ",
        "abstract": "<p id=\"P1\">Gene fusions have been described in approximately one-third of soft tissue tumors (STT); of the 142 different fusions that have been reported, more than half are recurrent in the same histologic subtype. These gene fusions constitute pivotal driver mutations, and detailed studies of their cellular effects have provided important knowledge about pathogenetic mechanisms in STT. Furthermore, most fusions are strongly associated with a particular histotype, serving as ideal molecular diagnostic markers. In recent years, it has also become apparent that some chimeric proteins, directly or indirectly, constitute excellent treatment targets, making the detection of gene fusions in STT ever more important. Indeed, pharmacological treatment of STT displaying fusions that activate protein kinases, such as ALK and ROS1, or growth factors, such as PDGFB, is already in clinical use. However, the vast majority (52/78) of recurrent gene fusions create structurally altered and/or deregulated transcription factors, and a small but growing subset develops through rearranged chromatin regulators. The present review provides an overview of the spectrum of currently recognized gene fusions in STT, and, on the basis of the protein class involved, the mechanisms by which they exert their oncogenic effect are discussed.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Single-cell transcriptomics reveals tumor landscape in ovarian carcinosarcoma</article-title>",
        "abstract": "<p>The present study used single-cell RNA sequencing (scRNA-seq) to characterize the cellular composition of ovarian carcinosarcoma (OCS) and identify its molecular characteristics.</p> <p>scRNA-seq was performed in resected primary OCS for an in-depth analysis of tumor cells and the tumor microenvironment. Immunohistochemistry staining was used for validation. The scRNA-seq data of OCS were compared with those of high-grade serous ovarian carcinoma (HGSOC) tumors and other OCS tumors.</p> <p>Both malignant epithelial and malignant mesenchymal cells were observed in the OCS patient of this study. We identified four epithelial cell subclusters with different biological roles. Among them, epithelial subcluster 4 presented high levels of breast cancer type 1 susceptibility protein homolog (<italic toggle=\"yes\">BRCA1</italic>) and DNA topoisomerase 2-α (<italic toggle=\"yes\">TOP2A</italic>) expression and was related to drug resistance and cell cycle. We analyzed the interaction between epithelial and mesenchymal cells and found that fibroblast growth factor (FGF) and pleiotrophin (PTN) signalings were the main pathways contributing to communication between these cells. Moreover, we compared the malignant epithelial and mesenchymal cells of this OCS tumor with our previous published HGSOC scRNA-seq data and OCS data. All the epithelial subclusters in the OCS tumor could be found in the HGSOC samples. Notably, the mesenchymal subcluster C14 exhibited specific expression patterns in the OCS tumor, characterized by elevated expression of cytochrome P450 family 24 subfamily A member 1 (<italic toggle=\"yes\">CYP24A1</italic>), collagen type XXIII α1 chain (<italic toggle=\"yes\">COL23A1</italic>), cholecystokinin (<italic toggle=\"yes\">CCK</italic>), bone morphogenetic protein 7 (<italic toggle=\"yes\">BMP7</italic>), <italic toggle=\"yes\">PTN</italic>, Wnt inhibitory factor 1 (<italic toggle=\"yes\">WIF1</italic>), and insulin-like growth factor 2 (<italic toggle=\"yes\">IGF2</italic>). Moreover, this subcluster showed distinct characteristics when compared with both another previously published OCS tumor and normal ovarian tissue.</p> <p>This study provides the single-cell transcriptomics signature of human OCS, which constitutes a new resource for elucidating OCS diversity.</p>",
        "doi": "10.1631/jzus.B2300407",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>An update to experimental and clinical aspects of tumor-associated macrophages in cancer development: hopes and pitfalls</article-title>",
        "abstract": "<p id=\"Par1\">Tumor-associated macrophages (TAMs) represent one of the most abundant tumor-infiltrating stromal cells, and their normal function in tumor microenvironment (TME) is to suppress tumor cells by producing cytokines which trigger both direct cell cytotoxicity and antibody-mediated immune response. However, upon prolonged exposure to TME, the classical function of these so-called M1-type TAMs can be converted to another type, “M2-type,” which are recruited by tumor cells so that they promote tumor growth and metastasis. This is the reason why the accumulation of TAMs in TME is correlated with poor prognosis in cancer patients. Both M1- and M2-types have high degree of plasticity, and M2-type cells can be reprogrammed to M1-type for therapeutic purposes. This characteristic introduces TAMs as promising target for developing novel cancer treatments. In addition, inhibition of M2-type cells and blocking their recruitment in TME, as well as their depletion by inducing apoptosis, are other approaches for effective immunotherapy of cancer. In this review, we summarize the potential of TAMs to be targeted for cancer immunotherapy and provide an up-to-date about novel strategies for targeting TAMs.</p>",
        "doi": "10.1007/s10238-024-01417-w",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Multivariate analysis of metabolic state vulnerabilities across diverse cancer contexts reveals synthetically lethal associations</article-title>",
        "abstract": "<p id=\"P3\">Targeting the distinct metabolic needs of tumor cells has recently emerged as a promising strategy for cancer therapy. The heterogeneous, context-dependent nature of cancer cell metabolism, however, poses challenges in identifying effective therapeutic interventions. Here, we utilize various unsupervised and supervised multivariate modeling approaches to systematically pinpoint recurrent metabolic states within hundreds of cancer cell lines, elucidate their association with tumor lineage and growth environments, and uncover vulnerabilities linked to their metabolic states across diverse genetic and tissue contexts. We validate key findings via analysis of data from patient-derived tumors and pharmacological screens, and by performing new genetic and pharmacological experiments. Our analysis uncovers new synthetically lethal associations between the tumor metabolic state (e.g., oxidative phosphorylation), driver mutations (e.g., loss of tumor suppressor PTEN), and actionable biological targets (e.g., mitochondrial electron transport chain). Investigating the mechanisms underlying these relationships can inform the development of more precise and context-specific, metabolism-targeted cancer therapies.</p>",
        "doi": "10.1101/2023.11.28.569098",
        "pmid": null,
        "pmcid": null,
        "score": 4
    },
    {
        "title": "<article-title>Cancer stem cells: advances in knowledge and implications for cancer therapy</article-title>",
        "abstract": "<p id=\"Par1\">Cancer stem cells (CSCs), a small subset of cells in tumors that are characterized by self-renewal and continuous proliferation, lead to tumorigenesis, metastasis, and maintain tumor heterogeneity. Cancer continues to be a significant global disease burden. In the past, surgery, radiotherapy, and chemotherapy were the main cancer treatments. The technology of cancer treatments continues to develop and advance, and the emergence of targeted therapy, and immunotherapy provides more options for patients to a certain extent. However, the limitations of efficacy and treatment resistance are still inevitable. Our review begins with a brief introduction of the historical discoveries, original hypotheses, and pathways that regulate CSCs, such as WNT/β-Catenin, hedgehog, Notch, NF-κB, JAK/STAT, TGF-β, PI3K/AKT, PPAR pathway, and their crosstalk. We focus on the role of CSCs in various therapeutic outcomes and resistance, including how the treatments affect the content of CSCs and the alteration of related molecules, CSCs-mediated therapeutic resistance, and the clinical value of targeting CSCs in patients with refractory, progressed or advanced tumors. In summary, CSCs affect therapeutic efficacy, and the treatment method of targeting CSCs is still difficult to determine. Clarifying regulatory mechanisms and targeting biomarkers of CSCs is currently the mainstream idea.</p>",
        "doi": "10.1038/s41392-024-01851-y",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>P53 Activation Promotes Maturational Characteristics of Pluripotent Stem Cell‐Derived Cardiomyocytes in 3‐Dimensional Suspension Culture Via <styled-content style=\"fixed-case\" toggle=\"no\">FOXO</styled-content>‐FOXM1 Regulation</article-title>",
        "abstract": "<p>Current protocols generate highly pure human induced pluripotent stem cell–derived cardiomyocytes (hiPSC‐CMs) in vitro that recapitulate characteristics of mature in vivo cardiomyocytes. Yet, a risk of arrhythmias exists when hiPSC‐CMs are injected into large animal models. Thus, understanding hiPSC‐CM maturational mechanisms is crucial for clinical translation. Forkhead box (FOX) transcription factors regulate postnatal cardiomyocyte maturation through a balance between FOXO and FOXM1. We also previously demonstrated that p53 activation enhances hiPSC‐CM maturation. Here, we investigate whether p53 activation modulates the FOXO/FOXM1 balance to promote hiPSC‐CM maturation in 3‐dimensional suspension culture.</p> <p>Three‐dimensional cultures of hiPSC‐CMs were treated with Nutlin‐3a (p53 activator, 10 μM), LOM612 (FOXO relocator, 5 μM), AS1842856 (FOXO inhibitor, 1 μM), or RCM‐1 (FOXM1 inhibitor, 1 μM), starting 2 days after onset of beating, with dimethyl sulfoxide (0.2% vehicle) as control. P53 activation promoted hiPSC‐CM metabolic and electrophysiological maturation alongside FOXO upregulation and FOXM1 downregulation, in n=3 to 6 per group for all assays. FOXO inhibition significantly decreased expression of cardiac‐specific markers such as TNNT2. In contrast, FOXO activation or FOXM1 inhibition promoted maturational characteristics such as increased contractility, oxygen consumption, and voltage peak maximum upstroke velocity, in n=3 to 6 per group for all assays. Further, by single‐cell RNA sequencing of n=2 LOM612‐treated cells compared with dimethyl sulfoxide, LOM612‐mediated FOXO activation promoted expression of cardiac maturational pathways.</p> <p>We show that p53 activation promotes FOXO and suppresses FOXM1 during 3‐dimensional hiPSC‐CM maturation. These results expand our understanding of hiPSC‐CM maturational mechanisms in a clinically‐relevant 3‐dimensional culture system.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Integrating bulk RNA-seq and scRNA-seq analyses revealed the function and clinical value of thrombospondins in colon cancer</article-title>",
        "abstract": "<p>Acting as mediators in cell-matrix and cell-cell communication, matricellular proteins play a crucial role in cancer progression. Thrombospondins (TSPs), a type of matricellular glycoproteins, are key regulators in cancer biology with multifaceted roles. Although TSPs have been implicated in anti-tumor immunity and epithelial-mesenchymal transition (EMT) in several malignancies, their specific roles to colon cancer remain elusive. Addressing this knowledge gap is essential, as understanding the function of TSPs in colon cancer could identify new therapeutic targets and prognostic markers.</p> <p>Analyzing 1981 samples from 10 high-throughput datasets, including six bulk RNA-seq, three scRNA-seq, and one spatial transcriptome dataset, our study investigated the prognostic relevance, risk stratification value, immune heterogeneity, and cellular origin of TSPs, as well as their influence on cancer-associated fibroblasts (CAFs). Utilizing survival analysis, unsupervised clustering, and functional enrichment, along with multiple correlation analyses of the tumor-microenvironment (TME) via Gene Set Variation Analysis (GSVA), spatial localization, Monocle2, and CellPhoneDB, we provided insights into the clinical and cellular implications of TSPs.</p> <p>First, we observed significant upregulation of <italic>THBS2</italic> and <italic>COMP</italic> in colon cancer, both of which displayed significant prognostic value. Additionally, we detected a significant positive correlation between TSPs and immune cells, as well as marker genes of EMT. Second, based on TSPs expression, patients were divided into two clusters with distinct prognoses: the high TSPs expression group (TSPs-H) was characterized by pronounced immune and stromal cell infiltration, and notably elevated T-cell exhaustion scores. Subsequently, we found that <italic>THBS2</italic> and <italic>COMP</italic> may be associated with the differentiation of CAFs into pan-iCAFs and pan-dCAFs, which are known for their heightened matrix remodeling activities. Moreover, <italic>THBS2</italic> enhanced CAFs communication with vascular endothelial cells and monocyte-macrophages. CAFs expressing <italic>THBS2</italic> (<italic>THBS2</italic><sup>+</sup> CAFs) demonstrated higher scores across multiple signaling pathways, including angiogenic, EMT, Hedgehog, Notch, Wnt, and TGF-β, when compared to <italic>THBS2</italic><sup>-</sup> CAFs. These observations suggest that <italic>THBS2</italic> may be associated with stronger pro-carcinogenic activity in CAFs.</p> <p>This study revealed the crucial role of TSPs and the significant correlation between THBS2 and CAFs interactions in colon cancer progression, providing valuable insights for targeting TSPs to mitigate cancer progression.</p>",
        "doi": "10.1016/j.csbj.2024.05.021",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Leveraging metabolic modeling and machine learning to uncover modulators of quiescence depth</article-title>",
        "abstract": "<p>Quiescence, a temporary withdrawal from the cell cycle, plays a key role in tissue homeostasis and regeneration. Quiescence is increasingly viewed as a continuum between shallow and deep quiescence, reflecting different potentials to proliferate. The depth of quiescence is altered in a range of diseases and during aging. Here, we leveraged genome-scale metabolic modeling (GEM) to define the metabolic and epigenetic changes that take place with quiescence deepening. We discovered contrasting changes in lipid catabolism and anabolism and diverging trends in histone methylation and acetylation. We then built a multi-cell type machine learning model that accurately predicts quiescence depth in diverse biological contexts. Using both machine learning and genome-scale flux simulations, we performed high-throughput screening of chemical and genetic modulators of quiescence and identified novel small molecule and genetic modulators with relevance to cancer and aging.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Exploring the promising potential of induced pluripotent stem cells in cancer research and therapy</article-title>\n      ",
        "abstract": "<p id=\"Par1\">The advent of iPSCs has brought about a significant transformation in stem cell research, opening up promising avenues for advancing cancer treatment. The formation of cancer is a multifaceted process influenced by genetic, epigenetic, and environmental factors. iPSCs offer a distinctive platform for investigating the origin of cancer, paving the way for novel approaches to cancer treatment, drug testing, and tailored medical interventions. This review article will provide an overview of the science behind iPSCs, the current limitations and challenges in iPSC-based cancer therapy, the ethical and social implications, and the comparative analysis with other stem cell types for cancer treatment. The article will also discuss the applications of iPSCs in tumorigenesis, the future of iPSCs in tumorigenesis research, and highlight successful case studies utilizing iPSCs in tumorigenesis research. The conclusion will summarize the advancements made in iPSC-based tumorigenesis research and the importance of continued investment in iPSC research to unlock the full potential of these cells.</p>\n      ",
        "doi": "10.1186/s12943-023-01873-0",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Combined Inhibition of <italic toggle=\"yes\">UBE2C</italic> and <italic toggle=\"yes\">PLK1</italic> Reduce Cell Proliferation and Arrest Cell Cycle by Affecting <italic toggle=\"yes\">ACLY</italic> in Pan-Cancer</article-title>\n      ",
        "abstract": "<p>Various studies have shown that the cell-cycle-related regulatory proteins UBE2C, PLK1, and BIRC5 promote cell proliferation and migration in different types of cancer. However, there is a lack of in-depth and systematic research on the mechanism of these three as therapeutic targets. In this study, we found a positive correlation between the expression of <italic toggle=\"yes\">UBE2C</italic> and <italic toggle=\"yes\">PLK1</italic>/<italic toggle=\"yes\">BIRC5</italic> in the Cancer Genome Atlas (TCGA) database, revealing a potential combination therapy candidate for pan-cancer. Quantitative real-time PCR (qRT-PCR), Western blotting (WB), cell phenotype detection, and RNA-seq techniques were used to evidence the effectiveness of the combination candidate. We found that combined interference of <italic toggle=\"yes\">UBE2C</italic> with <italic toggle=\"yes\">PLK1</italic> and <italic toggle=\"yes\">UBE2C</italic> with <italic toggle=\"yes\">BIRC5</italic> affected metabolic pathways by significantly downregulating the mRNA expression of <italic toggle=\"yes\">IDH1</italic> and <italic toggle=\"yes\">ACLY</italic>, which was related to the synthesis of acetyl-CoA. By combining the PLK1 inhibitor volasertib and the ACLY inhibitor bempedoic acid, it showed a higher synergistic inhibition of cell viability and higher synergy scores in seven cell lines, compared with those of other combination treatments. Our study reveals the potential mechanisms through which cell-cycle-related genes regulate metabolism and proposes a potential combined targeted therapy for patients with higher <italic toggle=\"yes\">PLK1</italic> and <italic toggle=\"yes\">ACLY</italic> expression in pan-cancer.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Complete loss of <italic>TP53</italic> and <italic>RB1</italic> is associated with complex genome and low immune infiltrate in pleomorphic rhabdomyosarcoma</article-title>\n      ",
        "abstract": "<p>Rhabdomyosarcoma accounts for roughly 1% of adult sarcomas, with pleomorphic rhabdomyosarcoma (PRMS) as the most common subtype. Survival outcomes remain poor for patients with PRMS, and little is known about the molecular drivers of this disease. To better characterize PRMS, we performed a broad array of genomic and immunostaining analyses on 25 patient samples. In terms of gene expression and methylation, PRMS clustered more closely with other complex karyotype sarcomas than with pediatric alveolar and embryonal rhabdomyosarcoma. Immune infiltrate levels in PRMS were among the highest observed in multiple sarcoma types and contrasted with low levels in other rhabdomyosarcoma subtypes. Lower immune infiltrate was associated with complete loss of both <italic>TP53</italic> and <italic>RB1</italic>. This comprehensive characterization of the genetic, epigenetic, and immune landscape of PRMS provides a roadmap for improved prognostications and therapeutic exploration.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>FOXM1-regulated ZIC2 promotes the malignant phenotype of renal clear cell carcinoma by activating UBE2C/mTOR signaling pathway</article-title>\n      ",
        "abstract": "<p><bold>Background:</bold> As a transcription factor, Zic family member 2 (ZIC2) has been involved in more and more studies of tumorigenesis, which has been proved by our research team to be an effective prognostic marker for Pan-cancer. However, the prognosis, tumor promoting effect and regulatory mechanism of ZIC2 in clear cell renal cell carcinoma (ccRCC) are still unknown.</p>\n         <p><bold>Methods:</bold> The potential clinical significance of ZIC2 was evaluated by bioinformatics analysis using data from TCGA, GEO, and ArrayExpress data sets. WB and IHC were used to detect ZIC2 expression in tumors and adjacent tissues. CCK-8, EdU, colony formation, cell cycle, wound healing, transwell, subcutaneous xenograft, and lung metastasis models were used to detect the biological function of ZIC2. The regulatory mechanism of ZIC2 was confirmed by data of RNA-seq, ATAC-seq, MS-PCR, Chip-PCR, and luciferase reporter experiments.</p>\n         <p><bold>Results:</bold> ZIC2 was markedly upregulated and correlated with poor clinicopathological features in ccRCC. Knockdown of ZIC2 resulted in reduced cell proliferation, invasion, migration, induction of G2/M phase arrest, and reduced tumor formation and lung metastasis in nude mice. The opposite was observed after overexpression. Mechanistically, the high expression of ZIC2 is regulated by hypomethylation and high H3K4Me3 in the promoter region, as well as positive transcriptional regulation by FOXM1. And then, ZIC2 transcriptase-positively regulates UBE2C and activates AKT/mTOR signaling pathway to promote tumor malignant progression.</p>\n         <p><bold>Conclusion:</bold> This study reveals that FOXM1-ZIC2-UBE2C-mTOR signaling axis promotes the progression of ccRCC, which can be used as a prognostic indicator and potential therapeutic target.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Impact of supraphysiologic MDM2 expression on chromatin networks and therapeutic responses in sarcoma</article-title>\n      ",
        "abstract": "<p>Amplification of MDM2 on supernumerary chromosomes is a common mechanism of P53 inactivation across tumors. Here, we investigated the impact of MDM2 overexpression on chromatin, gene expression, and cellular phenotypes in liposarcoma. Three independent regulatory circuits predominate in aggressive, dedifferentiated tumors. RUNX and AP-1 family transcription factors bind mesenchymal gene enhancers. P53 and MDM2 co-occupy enhancers and promoters associated with P53 signaling. When highly expressed, MDM2 also binds thousands of P53-independent growth and stress response genes, whose promoters engage in multi-way topological interactions. Overexpressed MDM2 concentrates within nuclear foci that co-localize with PML and YY1 and could also contribute to P53-independent phenotypes associated with supraphysiologic MDM2. Importantly, we observe striking cell-to-cell variability in MDM2 copy number and expression in tumors and models. Whereas liposarcoma cells are generally sensitive to MDM2 inhibitors and their combination with pro-apoptotic drugs, MDM2-high cells tolerate them and may underlie the poor clinical efficacy of these agents.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Identification of anoikis-related molecular patterns to define tumor microenvironment and predict immunotherapy response and prognosis in soft-tissue sarcoma</article-title>\n        ",
        "abstract": "<p>\n<bold>Background:</bold> Soft-tissue sarcoma (STS) is a massive threat to human health due to its high morbidity and malignancy. STS also represents more than 100 histologic and molecular subtypes, with different prognosis. There is growing evidence that anoikis play a key role in the proliferation and invasion of tumors. However, the effects of anoikis in the immune landscape and the prognosis of STS remain unclear.</p>\n         <p>\n<bold>Methods:</bold> We analyzed the genomic and transcriptomic profiling of 34 anoikis-related genes (ARGs) in patient cohort of pan-cancer and STS from The Cancer Genome Atlas (TCGA) database. Single-cell transcriptome was used to disclose the expression patterns of ARGs in specific cell types. Gene expression was further validated by real-time PCR and our own sequencing data. We established the Anoikis cluster and Anoikis subtypes by using unsupervised consensus clustering analysis. An anoikis scoring system was further built based on the differentially expressed genes (DEGs) between Anoikis clusters. The clinical and biological characteristics of different groups were evaluated.</p>\n         <p>\n<bold>Results:</bold> The expressions of most ARGs were significantly different between STS and normal tissues. We found some common ARGs profiles across the pan-cancers. Network of 34 ARGs demonstrated the regulatory pattern and the association with immune cell infiltration. Patients from different Anoikis clusters or Anoikis subtypes displayed distinct clinical and biological characteristics. The scoring system was efficient in prediction of prognosis and immune cell infiltration. In addition, the scoring system could be used to predict immunotherapy response.</p>\n         <p>\n<bold>Conclusion:</bold> Overall, our study thoroughly depicted the anoikis-related molecular and biological profiling and interactions of ARGs in STS. The Anoikis score model could guide the individualized management.</p>\n      ",
        "doi": "10.3389/fphar.2023.1136184",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>The FUS::DDIT3 fusion oncoprotein inhibits BAF complex targeting and activity in myxoid liposarcoma</article-title>\n      ",
        "abstract": "<p id=\"P3\">Mammalian SWI/SNF (mSWI/SNF or BAF) ATP-dependent chromatin remodeling complexes play critical roles in governing genomic architecture and gene expression and are frequently perturbed in human cancers. Transcription factors (TFs), including fusion oncoproteins, can bind to BAF complex surfaces to direct chromatin targeting and accessibility, often activating oncogenic gene loci. Here, we demonstrate that the FUS::DDIT3 fusion oncoprotein hallmark to myxoid liposarcoma (MLPS) inhibits BAF complex-mediated remodeling of adipogenic enhancer sites via sequestration of the adipogenic TF, CEBPB, from the genome. In mesenchymal stem cells, small molecule inhibition of BAF complex ATPase activity attenuates adipogenesis via failure of BAF-mediated DNA accessibility and gene activation at CEBPB target sites. BAF chromatin occupancy and gene expression profiles of FUS::DDIT3-expressing cell lines and primary tumors exhibit similarity to SMARCB1-deficient tumor types. These data present a mechanism by which a fusion oncoprotein generates a BAF complex loss-of-function phenotype, independent of deleterious subunit mutations.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Multi-site desmoplastic small round cell tumors are genetically related and immune-cold</article-title>\n      ",
        "abstract": "<p id=\"Par1\">Desmoplastic small round cell tumor (DSRCT) is a highly aggressive soft tissue sarcoma that is characterized by the <italic>EWSR1-WT1</italic> fusion protein. Patients present with hundreds of tumor implants in their abdominal cavity at various sites. To determine the genetic relatedness among these sites, exome and RNA sequencing were performed on 22 DSRCT specimens from 14 patients, four of whom had specimens from various tissue sites. Multi-site tumors from individual DSRCT patients had a shared origin and were highly related. Other than the <italic>EWSR1-WT1</italic> fusion, very few secondary cancer gene mutations were shared among the sites. Among these, <italic>ARID1A</italic>, was recurrently mutated, which corroborates findings by others in DSRCT patients. Knocking out <italic>ARID1A</italic> in JN-DSRCT cells using CRISPR/CAS9 resulted in significantly lower cell proliferation and increased drug sensitivity. The transcriptome data were integrated using network analysis and drug target database information to identify potential therapeutic opportunities in EWSR1-WT1-associated pathways, such as PI3K and mTOR pathways. Treatment of JN-DSRCT cells with the PI3K inhibitor alpelisib and mTOR inhibitor temsirolimus reduced cell proliferation. In addition, the low mutation burden was associated with an immune-cold state in DSRCT. Together, these data reveal multiple genomic and immune features of DSRCT and suggest therapeutic opportunities in patients.</p>\n      ",
        "doi": "10.1038/s41698-022-00257-9",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>GTF2E2 is a novel biomarker for recurrence after surgery and promotes progression of esophageal squamous cell carcinoma via miR-139-5p/GTF2E2/FUS axis</article-title>\n      ",
        "abstract": "<p id=\"Par1\">Esophageal squamous cell carcinoma (ESCC) is one of the most lethal gastrointestinal malignancies with high mortality. Recurrence develops within only a few years after curative resection and perioperative adjuvant therapy in 30–50% of these patients. Therefore, it is essential to identify postoperative recurrence biomarkers to facilitate selecting the following surveillance and therapeutic strategies. The general transcription factor IIE subunit beta (GTF2E2) is crucial for physiological and pathological functions, but its roles in the aggression and recurrence of ESCC remain ambiguous. In this study, we found that GTF2E2 was highly expressed in ESCC samples, and elevated GTF2E2 expression predicted early recurrence after surgery for ESCC patients. High expression of GTF2E2 associated with more aggressive clinic features and poor prognosis. GTF2E2 promoted the proliferation and mobility of ESCC cells in vitro and in vivo. We further revealed that miR-139-5p repressed GTF2E2 expression by downregulating its mRNA through binding with Argonaute 2 (Ago2). Rescue assays suggested that miR-139-5p affected GTF2E2-mediated ESCC progression. Moreover, GTF2E2 positively interacted with FUS promoter and regulated FUS expression, and the phenotype changes caused by GTF2E2 manipulation were recovered by rescuing FUS expression in ESCC cells. Additionally, we demonstrated that GTF2E2 promotes ESCC cells progression via activation of the AKT/ERK/mTOR pathway. In conclusion, GTF2E2 may serve as a novel biomarker for recurrence after surgery and a potential therapeutic target for ESCC patients, and it promotes ESCC progression via miR-139-5p/GTF2E2/FUS axis.</p>\n      ",
        "doi": "10.1038/s41388-021-02122-8",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Pan-cancer analyses demonstrate that ANKRD6 is associated with a poor prognosis and correlates with M2 macrophage infiltration in colon cancer</article-title>\n      ",
        "abstract": "<p>Ankyrin repeat domain-containing protein 6 (ANKRD6) is an ankyrin repeat-containing protein which is structurally related to vertebrate inversin and Drosophila Diego. However, the correlations between ANKRD6 and tumor-infiltrating immune cells in cancers is not clear.</p>\n         <p>ANKRD6 expression was analyzed by Oncomine, Tumor Immune Estimation Resource (TIMER) and Gene Expression Profiling Interactive Analysis (GEPIA). PrognoScan and GEPIA were used to evaluate the influence of ANKRD6 on clinical prognosis. TIMER and CIBERSORT were used to analyze correlations between ANKRD6 expression levels and tumor immune cell infiltrates. Immunohistochemical analysis of the relationship between ANKRD6 expression and overall survival, as well as the relationship between ANKRD6 expression and M2 macrophage infiltration, was performed.</p>\n         <p>High level of ANKRD6 expression was associated with poor prognosis of colon cancer. ANKRD6 expression level was positively correlated with infiltrating levels of CD8+ T cells, CD4+ T cells, macrophages, neutrophils and dendritic cells in colon cancer by using TIMER. Using CIBERSORT, we found that in plasma cells, CD8+ T cells, CD4+ memory resting T cells, follicular helper T cells and activated natural killer cells were significantly lower in the ANKRD6-high group than in the ANKRD6-low group. M0 and M2 macrophages were significantly higher in the ANKRD6-high group than in the ANKRD6-low group. Immunohistochemistry confirmed that M2 macrophage infiltration in the ANKRD6-high group significantly increased.</p>\n         <p>The high ANKRD6 expression is associated with poor prognosis of colon cancer. ANKRD6 expression is positively correlated with M2 macrophage infiltration in colon cancer.</p>\n        ",
        "doi": "10.21147/j.issn.1000-9604.2021.01.10",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Modification of Seurat v4 for the Development of a Phase Assignment Tool Able to Distinguish between G2 and Mitotic Cells</article-title>",
        "abstract": "<p>Single-cell RNA sequencing (scRNAseq) is a rapidly advancing field enabling the characterisation of heterogeneous gene expression profiles within a population. The cell cycle phase is a major contributor to gene expression variance between cells and computational analysis tools have been developed to assign cell cycle phases to cells within scRNAseq datasets. Whilst these tools can be extremely useful, all have the drawback that they classify cells as only G1, S or G2/M. Existing discrete cell phase assignment tools are unable to differentiate between G2 and M and continuous-phase-assignment tools are unable to identify a region corresponding specifically to mitosis in a pseudo-timeline for continuous assignment along the cell cycle. In this study, bulk RNA sequencing was used to identify differentially expressed genes between mitotic and interphase cells isolated based on phospho-histone H3 expression using fluorescence-activated cell sorting. These gene lists were used to develop a methodology which can distinguish G2 and M phase cells in scRNAseq datasets. The phase assignment tools present in Seurat were modified to allow for cell cycle phase assignment of all stages of the cell cycle to identify a mitotic-specific cell population.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Identification of a PANoptosis-related Gene Signature for Predicting the Prognosis, Tumor Microenvironment and Therapy Response in Breast Cancer</article-title>",
        "abstract": "<p>Breast cancer (BC) is the most prevalent malignancy among women worldwide. Mounting evidence suggests that PANoptosis participates in cancer development and therapy. However, the role of PANoptosis in BC remains unclear. In this study, we identified ten PANoptosis-related genes using Cox regression analysis, random forest (RF) algorithm and least absolute shrinkage and selection operator (LASSO) algorithm. A PANoptosis-related score (PRS) was calculated based on the coefficient of LASSO. Notably, we divided the patients into high- and low-risk groups according to the PRS and revealed a negative correlation between PRS and overall survival. Next, a nomogram model was constructed and validated to improve the clinical application of PRS. Functional enrichment analyses and the Bayesian network demonstrated that differentially expressed genes between high- and low-risk groups were mainly enriched in immune-related pathways. Besides, we found significant differences in tumor mutation burden and tumor immune microenvironment between patients in these two groups using bulk-RNA and single-cell RNA sequencing data. Furthermore, charged multivesicular body protein 2B (CHMP2B) was identified as the hub gene by combining LASSO, weighted gene co-expression network analysis, RF and eXtreme Gradient Boosting. Importantly, using immunohistochemistry analysis based on our tissue microarray, we found that CHMP2B was highly expressed in tumor tissue, and CD4 and CD8 were more likely to be positive in the CHMP2B-negative group. Survival analyses revealed that CHMP2B adversely impacted the survival of BC patients. In conclusion, we not only constructed a highly accurate predictive model based on PRS, but also revealed the importance of PANoptosis-related gene signature in the modulation of the tumor microenvironment and drug sensitivity in BC.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Functional Profiling of Soft Tissue Sarcoma Using Mechanistic Models</article-title>\n      ",
        "abstract": "<p>Soft tissue sarcoma is an umbrella term for a group of rare cancers that are difficult to treat. In addition to surgery, neoadjuvant chemotherapy has shown the potential to downstage tumors and prevent micrometastases. However, finding effective therapeutic targets remains a research challenge. Here, a previously developed computational approach called mechanistic models of signaling pathways has been employed to unravel the impact of observed changes at the gene expression level on the ultimate functional behavior of cells. In the context of such a mechanistic model, RNA-Seq counts sourced from the Recount3 resource, from The Cancer Genome Atlas (TCGA) Sarcoma project, and non-diseased sarcomagenic tissues from the Genotype-Tissue Expression (GTEx) project were utilized to investigate signal transduction activity through signaling pathways. This approach provides a precise view of the relationship between sarcoma patient survival and the signaling landscape in tumors and their environment. Despite the distinct regulatory alterations observed in each sarcoma subtype, this study identified 13 signaling circuits, or elementary sub-pathways triggering specific cell functions, present across all subtypes, belonging to eight signaling pathways, which served as predictors for patient survival. Additionally, nine signaling circuits from five signaling pathways that highlighted the modifications tumor samples underwent in comparison to normal tissues were found. These results describe the protective role of the immune system, suggesting an anti-tumorigenic effect in the tumor microenvironment, in the process of tumor cell detachment and migration, or the dysregulation of ion homeostasis. Also, the analysis of signaling circuit intermediary proteins suggests multiple strategies for therapy.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 4
    },
    {
        "title": "<article-title>Bioinformatics Screen Reveals Gli-Mediated Hedgehog Signaling as an Associated Pathway to Poor Immune Infiltration of Dedifferentiated Liposarcoma</article-title>\n      ",
        "abstract": "<p>Liposarcomas (LPSs) are a rare soft tissue malignancy with a variable clinical prognosis dependent on tumor differentiation. Well-differentiated (WDLPS) and dedifferentiated (DDLPS) liposarcomas most commonly occur both in extremities and the retroperitoneal cavity. Surgical resection and post-operative monitoring are effective forms of treatment; however, many tumors do recur and require chemotherapeutic intervention. Liposarcomas have high intratumoral variability, which can influence drug response and microenvironment interactions. Using a broad bioinformatics approach, we show that Hedgehog signaling, a developmental pathway, is upregulated in DDLPS and correlates with a tumor gene expression signature that suggests reduced immune cell infiltration and increased extracellular matrix (ECM) protein expression.</p>\n         <p>Liposarcomas are the most diagnosed soft tissue sarcoma, with most cases consisting of well-differentiated (WDLPS) or dedifferentiated (DDLPS) histological subtypes. While both tumor subtypes can have clinical recurrence due to incomplete resections, DDLPS often has worse prognosis due to a higher likelihood of metastasis compared to its well-differentiated counterpart. Unfortunately, targeted therapeutic interventions have lagged in sarcoma oncology, making the need for molecular targeted therapies a promising future area of research for this family of malignancies. In this work, previously published data were analyzed to identify differential pathways that may contribute to the dedifferentiation process in liposarcoma. Interestingly, Gli-mediated Hedgehog signaling appeared to be enriched in dedifferentiated adipose progenitor cells and DDLPS tumors, and coincidentally Gli1 is often co-amplified with MDM2 and CDK4, given its genomic proximity along chromosome 12q13-12q15. However, we find that Gli2, but not Gli1, is differentially expressed between WDLPS and DDLPS, with a noticeable co-expression signature between Gli2 and genes involved in ECM remodeling. Additionally, Gli2 co-expression had a noticeable transcriptional signature that could suggest Gli-mediated Hedgehog signaling as an associated pathway contributing to poor immune infiltration in these tumors.</p>\n        ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 4
    },
    {
        "title": "<article-title>HOXA5-mediated stabilization of IκB-α inhibits the NF-κB pathway and suppresses malignant transformation of breast epithelial cells</article-title>\n      ",
        "abstract": "<p id=\"P2\">HOXA5 is a transcription factor and tumor suppressor that promotes differentiation of breast epithelial cells and is frequently lost during malignant transformation. HOXA5 loss alone, however, does not confer tumorigenicity. To determine which molecular alterations combined with loss of HOXA5 expression can transform cells, we examined isogenic derivatives of a non-malignant breast epithelial cell line containing knock-in or knock-out mutations in key breast cancer genes. Knockdown (KD) of HOXA5 in cells harboring double knock-in (DKI) of mutated PIK3CA (E545K) and HER2 (V777L) induced epithelial-mesenchymal transition and migration and promoted invasive tumor outgrowth within mouse mammary ducts. The NF-κB pathway was significantly upregulated in DKI cells following HOXA5 KD. HOXA5 KD upregulated multiple NF-κB target genes, including IL6. IκB-α protein, but not RNA, expression was reduced in HOXA5-KD cells. HOXA5 bound and stabilized IκB-α, forming a nuclear HOXA5-IκB-α complex. ChIP-seq database queries revealed that HOXA5 and IκB-α are co-enriched at 528 genomic loci. In breast cancer patients, high co-expression of HOXA5 and IκB-α conferred a significantly better overall- and progression-free survival. Collectively, these data suggest that HOXA5 suppresses malignancy in breast epithelial cells by blunting NF-κB action via stabilization of its inhibitor IκB-α.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Pan-sarcoma characterization of lncRNAs in the crosstalk of EMT and tumour immunity identifies distinct clinical outcomes and potential implications for immunotherapy</article-title>",
        "abstract": "<p id=\"Par1\">The epithelial-to-mesenchymal transition (EMT) is a reversible process that may interact with tumour immunity through multiple approaches. There is increasing evidence demonstrating the interconnections among EMT-related processes, the tumour microenvironment, and immune activity, as well as its potential influence on the immunotherapy response. Long non-coding RNAs (lncRNAs) are emerging as critical modulators of gene expression. They play fundamental roles in tumour immunity and act as promising biomarkers of immunotherapy response. However, the potential roles of lncRNA in the crosstalk of EMT and tumour immunity are still unclear in sarcoma. We obtained multi-omics profiling of 1440 pan-sarcoma patients from 19 datasets. Through an unsupervised consensus clustering approach, we categorised EMT molecular subtypes. We subsequently identified 26 EMT molecular subtype and tumour immune-related lncRNAs (EILncRNA) across pan-sarcoma types and developed an EILncRNA signature-based weighted scoring model (EILncSig). The EILncSig exhibited favourable performance in predicting the prognosis of sarcoma, and a high-EILncSig was associated with exclusive tumour microenvironment (TME) characteristics with desert-like infiltration of immune cells. Multiple altered pathways, somatically-mutated genes and recurrent CNV regions associated with EILncSig were identified. Notably, the EILncSig was associated with the efficacy of immune checkpoint inhibition (ICI) therapy. Using a computational drug-genomic approach, we identified compounds, such as Irinotecan that may have the potential to convert the EILncSig phenotype. By integrative analysis on multi-omics profiling, our findings provide a comprehensive resource for understanding the functional role of lncRNA-mediated immune regulation in sarcomas, which may advance the understanding of tumour immune response and the development of lncRNA-based immunotherapeutic strategies for sarcoma.</p> <p>The online version contains supplementary material available at 10.1007/s00018-022-04462-4.</p>",
        "doi": "10.1007/s00018-022-04462-4",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<ArticleTitle>Single cell transcriptomic profiling identifies tumor-acquired and therapy-resistant cell states in pediatric rhabdomyosarcoma.</ArticleTitle>",
        "abstract": "Rhabdomyosarcoma (RMS) is a pediatric tumor that resembles undifferentiated muscle cells; yet the extent to which cell state heterogeneity is shared with human development has not been described. Using single-cell/nucleus RNA sequencing from patient tumors, patient-derived xenografts, primary in vitro cultures, and cell lines, we identify four dominant muscle-lineage cell states: progenitor, proliferative, differentiated, and ground cells. We stratify these RMS cells/nuclei along the continuum of human muscle development and show that they share expression patterns with fetal/embryonal myogenic precursors rather than postnatal satellite cells. Fusion-negative RMS (FN-RMS) have a discrete stem cell hierarchy that recapitulates fetal muscle development and contain therapy-resistant FN-RMS progenitors that share transcriptomic similarity with bipotent skeletal mesenchymal cells. Fusion-positive RMS have tumor-acquired cells states, including a neuronal cell state, that are not found in myogenic development. This work identifies previously underappreciated cell state heterogeneity including unique treatment-resistant and tumor-acquired cell states that differ across RMS subtypes.",
        "doi": "10.1038/s41467-024-50527-2",
        "pmid": "39060228",
        "pmcid": "11282092",
        "score": 2
    },
    {
        "title": "<ArticleTitle>Disruption of MAM integrity in mutant FUS oligodendroglial progenitors from hiPSCs.</ArticleTitle>",
        "abstract": "Amyotrophic lateral sclerosis (ALS) is a rapidly progressive and fatal neurodegenerative disorder, characterized by selective loss of motor neurons (MNs). A number of causative genetic mutations underlie the disease, including mutations in the fused in sarcoma (FUS) gene, which can lead to both juvenile and late-onset ALS. Although ALS results from MN death, there is evidence that dysfunctional glial cells, including oligodendroglia, contribute to neurodegeneration. Here, we used human induced pluripotent stem cells (hiPSCs) with a R521H or a P525L mutation in FUS and their isogenic controls to generate oligodendrocyte progenitor cells (OPCs) by inducing SOX10 expression from a TET-On SOX10 cassette. Mutant and control iPSCs differentiated efficiently into OPCs. RNA sequencing identified a myelin sheath-related phenotype in mutant OPCs. Lipidomic studies demonstrated defects in myelin-related lipids, with a reduction of glycerophospholipids in mutant OPCs. Interestingly, FUSR521H OPCs displayed a decrease in the phosphatidylcholine/phosphatidylethanolamine ratio, known to be associated with maintaining membrane integrity. A proximity ligation assay further indicated that mitochondria-associated endoplasmic reticulum membranes (MAM) were diminished in both mutant FUS OPCs. Moreover, both mutant FUS OPCs displayed increased susceptibility to ER stress when exposed to thapsigargin, and exhibited impaired mitochondrial respiration and reduced Ca2+ signaling from ER Ca2+ stores. Taken together, these results demonstrate a pathological role of mutant FUS in OPCs, causing defects in lipid metabolism associated with MAM disruption manifested by impaired mitochondrial metabolism with increased susceptibility to ER stress and with suppressed physiological Ca2+ signaling. As such, further exploration of the role of oligodendrocyte dysfunction in the demise of MNs is crucial and will provide new insights into the complex cellular mechanisms underlying ALS.",
        "doi": "10.1007/s00401-023-02666-x",
        "pmid": "38170217",
        "pmcid": "10764485",
        "score": 2
    },
    {
        "title": "<ArticleTitle>lncRNA Sequencing Reveals Neurodegeneration-Associated FUS Mutations Alter Transcriptional Landscape of iPS Cells That Persists in Motor Neurons.</ArticleTitle>",
        "abstract": "Fused-in sarcoma (FUS) gene mutations have been implicated in amyotrophic lateral sclerosis (ALS). This study aimed to investigate the impact of FUS mutations (R521H and P525L) on the transcriptome of induced pluripotent stem cells (iPSCs) and iPSC-derived motor neurons (iMNs). Using RNA sequencing (RNA Seq), we characterized differentially expressed genes (DEGs) and differentially expressed lncRNAs (DELs) and subsequently predicted lncRNA-mRNA target pairs (TAR pairs). Our results show that FUS mutations significantly altered the expression profiles of mRNAs and lncRNAs in iPSCs. Using this large dataset, we identified and verified six key differentially regulated TAR pairs in iPSCs that were also altered in iMNs. These target transcripts included: GPR149, NR4A, LMO3, SLC15A4, ZNF404, and CRACD. These findings indicated that selected mutant FUS-induced transcriptional alterations persist from iPSCs into differentiated iMNs. Functional enrichment analyses of DEGs indicated pathways associated with neuronal development and carcinogenesis as likely altered by these FUS mutations. Furthermore, ingenuity pathway analysis (IPA) and GO network analysis of lncRNA-targeted mRNAs indicated associations between RNA metabolism, lncRNA regulation, and DNA damage repair. Our findings provide insights into potential molecular mechanisms underlying the pathophysiology of ALS-associated FUS mutations and suggest potential therapeutic targets for the treatment of ALS.",
        "doi": "10.3390/cells12202461",
        "pmid": "37887305",
        "pmcid": "10604943",
        "score": 2
    },
    {
        "title": "<ArticleTitle>lncRNA Sequencing Reveals Neurodegeneration-associated FUS Mutations Alter Transcriptional Landscape of iPS Cells That Persists In Motor Neurons.</ArticleTitle>",
        "abstract": "Fused-in Sarcoma (FUS) gene mutations have been implicated in amyotrophic lateral sclerosis (ALS). This study aimed to investigate the impact of FUS mutations (R521H and P525L) on the transcriptome of induced pluripotent stem cells (iPSCs) and iPSC-derived motor neurons (iMNs). Using RNA sequencing (RNA Seq), we characterized differentially expressed genes (DEGs), differentially expressed lncRNAs (DELs), and subsequently predicted lncRNA-mRNA target pairs (TAR pairs). Our results show that FUS mutations significantly altered expression profiles of mRNAs and lncRNAs in iPSCs. We identified key differentially regulated TAR pairs, including LMO3, TMEM132D, ERMN, GPR149, CRACD, and ZNF404 in mutant FUS iPSCs. We performed reverse transcription PCR (RT-PCR) validation in iPSCs and iMNs. Validation confirmed RNA-Seq findings and suggested that mutant FUS-induced transcriptional alterations persisted from iPSCs into differentiated iMNs. Functional enrichment analyses of DEGs indicated pathways associated with neuronal development and carcinogenesis that were likely altered by FUS mutations. Ingenuity Pathway Analysis (IPA) and GO network analysis of lncRNA-targeted mRNAs indicated associations related to RNA metabolism, lncRNA regulation, and DNA damage repair. Our findings provide insights into the molecular mechanisms underlying the pathophysiology of ALS-associated FUS mutations and suggest potential therapeutic targets for the treatment of ALS.",
        "doi": "10.21203/rs.3.rs-3112246/v1",
        "pmid": "37461717",
        "pmcid": "10350127",
        "score": 2
    },
    {
        "title": "<ArticleTitle>Loss of mutual protection between human osteoclasts and chondrocytes in damaged joints initiates osteoclast-mediated cartilage degradation by MMPs.</ArticleTitle>",
        "abstract": "Osteoclasts are multinucleated, bone-resorbing cells. However, they also digest cartilage during skeletal maintenance, development and in degradative conditions including osteoarthritis, rheumatoid arthritis and primary bone sarcoma. This study explores the mechanisms behind the osteoclast-cartilage interaction. Human osteoclasts differentiated on acellular human cartilage expressed osteoclast marker genes (e.g. CTSK, MMP9) and proteins (TRAP, VNR), visibly damaged the cartilage surface and released glycosaminoglycan in a contact-dependent manner. Direct co-culture with chondrocytes during differentiation increased large osteoclast formation (p < 0.0001) except when co-cultured on dentine, when osteoclast formation was inhibited (p = 0.0002). Osteoclasts cultured on dentine inhibited basal cartilage degradation (p = 0.012). RNA-seq identified MMP8 overexpression in osteoclasts differentiated on cartilage versus dentine (8.89-fold, p = 0.0133), while MMP9 was the most highly expressed MMP. Both MMP8 and MMP9 were produced by osteoclasts in osteosarcoma tissue. This study suggests that bone-resident osteoclasts and chondrocytes exert mutually protective effects on their 'native' tissue. However, when osteoclasts contact non-native cartilage they cause degradation via MMPs. Understanding the role of osteoclasts in cartilage maintenance and degradation might identify new therapeutic approaches for pathologies characterized by cartilage degeneration.",
        "doi": "10.1038/s41598-021-02246-7",
        "pmid": "34811438",
        "pmcid": "8608887",
        "score": 2
    },
    {
        "title": "<ArticleTitle>PIK3R3, part of the regulatory domain of PI3K, is upregulated in sarcoma stem-like cells and promotes invasion, migration, and chemotherapy resistance.</ArticleTitle>",
        "abstract": "To identify drivers of sarcoma cancer stem-like cells (CSCs), we compared gene expression using RNA sequencing between HT1080 fibrosarcoma and SK-LMS-1 leiomyosarcoma spheroids (which are enriched for CSCs) compared with the parent populations. The most overexpressed survival signaling-related gene in spheroids was phosphoinositide-3-kinase regulatory subunit 3 (PIK3R3), a regulatory subunit of PI3K, which functions in tumorigenesis and metastasis. In a human sarcoma microarray, PIK3R3 was also overexpressed by 4.1-fold compared with normal tissues. PIK3R3 inhibition using shRNA in the HT1080, SK-LMS-1, and DDLS8817 dedifferentiated liposarcoma in spheroids and in CD133+ cells (a CSC marker) reduced expression of CD133 and the stem cell factor Nanog and blocked spheroid formation by 61-71%. Mechanistic studies showed that in spheroid cells, PIK3R3 activated AKT and ERK signaling. Inhibition of PIK3R3, AKT, or ERK using shRNA or inhibitors decreased expression of Nanog, spheroid formation by 68-73%, and anchorage-independent growth by 76-91%. PIK3R3 or ERK1/2 inhibition similarly blocked sarcoma spheroid cell migration, invasion, secretion of MMP-2, xenograft invasion into adjacent normal tissue, and chemotherapy resistance. Together, these results show that signaling through the PIK3R3/ERK/Nanog axis promotes sarcoma CSC phenotypes such as migration, invasion, and chemotherapy resistance, and identify PIK3R3 as a potential therapeutic target in sarcoma.",
        "doi": "10.1038/s41419-021-04036-5",
        "pmid": "34321458",
        "pmcid": "8319167",
        "score": 4,
        "path": "22/papers/8319167.pdf"
    },
    {
        "title": "<article-title>Regulation of R-Loops in DNA Tumor Viruses</article-title>",
        "abstract": "<p>R-loops are triple-stranded nucleic acid structures that occur when newly synthesized single-stranded RNA anneals to duplex DNA upon the collision of replication forks with transcription complexes. These RNA–DNA hybrids facilitate several transcriptional processes in the cell and have been described extensively in the literature. Recently, evidence has emerged that R-loops are key regulators of DNA tumor virus transcription and the replication of their lifecycle. Studies have demonstrated that R-loops on the Human Papillomavirus (HPV) genome must be resolved to maintain genome maintenance and avoid viral integration, a hallmark of HPV cancers. For Epstein–Barr virus (EBV), R-loops are formed at the <italic toggle=\"yes\">oriLyt</italic> to establish lytic replication. Structural maintenance of chromosome proteins 5/6 (SMC5/6) bind to these viral R-loops to repress EBV lytic replication. Most viruses in the <italic toggle=\"yes\">herpesvirales</italic> order, such as KSHV, contain R-loop-forming sequences. In this perspective, we will describe the current, although limited, literature demonstrating the importance of RNA–DNA hybrids to regulate DNA virus transcription. We will also detail potential new areas of R-loop research and how these viruses can be used as tools to study the growing field of R-loops.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Radiopharmaceuticals for Pancreatic Cancer: A Review of Current Approaches and Future Directions</article-title>",
        "abstract": "<p>The poor prognosis of pancreatic cancer requires novel treatment options. This review examines the evolution of radiopharmaceuticals in the treatment of pancreatic cancer. Established strategies such as peptide receptor radionuclide therapy (PRRT) offer targeted and effective treatment, compared to conventional treatments. However, there are currently no radiopharmaceuticals approved for the treatment of pancreatic cancer in Europe, which requires further research and novel approaches. New radiopharmaceuticals including radiolabeled antibodies, peptides, and nanotechnological approaches are promising in addressing the challenges of pancreatic cancer therapy. These new agents may offer more specific targeting and potentially improve efficacy compared to traditional therapies. Further research is needed to optimize efficacy, address limitations, and explore the overall potential of these new strategies in the treatment of this aggressive and harmful pathology.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Molecular Basis of Pancreatic Neuroendocrine Tumors</article-title>",
        "abstract": "<p>Pancreatic neuroendocrine tumors (NETs) are rare well-differentiated neoplasms with limited therapeutic options and unknown cells of origin. The current classification of pancreatic neuroendocrine tumors is based on proliferative grading, and guides therapeutic strategies, however, tumors within grades exhibit profound heterogeneity in clinical manifestation and outcome. Manifold studies have highlighted intra-patient differences in tumors at the genetic and transcriptomic levels. Molecular classification might become an alternative or complementary basis for treatment decisions and reflect tumor biology, actionable cellular processes. Here, we provide a comprehensive review of genomic, transcriptomic, proteomic and epigenomic studies of pancreatic NETs to elucidate patterns shared between proposed subtypes that could form a foundation for new classification. We denote four NET subtypes with distinct molecular features, which were consistently reproduced using various omics technologies.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>The Role of Soluble CD163 (sCD163) in Human Physiology and Pathophysiology</article-title>",
        "abstract": "<p>Soluble CD163 (sCD163) is a circulating inflammatory mediator, indicative of acute and chronic, systemic and non-systemic inflammatory conditions. It is the cleavage outcome, consisting of almost the entire extracellular domain, of the CD163, a receptor expressed in monocytic lineages. Its expression is proportional to the abundance of CD163<sup>+</sup> macrophages. Various mechanisms trigger the shedding of the CD163 receptor or the accumulation of CD163-expressing macrophages, inducing the sCD163 concentration in the circulation and bodily fluids. The activities of sCD163 range from hemoglobin (Hb) scavenging, macrophage marker, decoy receptor for cytokines, participation in immune defense mechanisms, and paracrine effects in various tissues, including the endothelium. It is an established marker of macrophage activation and thus participates in many diseases, including chronic inflammatory conditions, such as atherosclerosis, asthma, and rheumatoid arthritis; acute inflammatory conditions, such as sepsis, hepatitis, and malaria; insulin resistance; diabetes; and tumors. The sCD163 levels have been correlated with the severity, stage of the disease, and clinical outcome for many of these conditions. This review article summarizes the expression and role of sCD163 and its precursor protein, CD163, outlines the sCD163 generation mechanisms, the biological activities, and the known underlying molecular mechanisms, with an emphasis on its impact on the endothelium and its contribution in the pathophysiology of human diseases.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Macrophage variants in laboratory research: most are well done, but some are RAW</article-title>",
        "abstract": "<p>Macrophages play a pivotal role in the innate immune response. While their most characteristic function is phagocytosis, it is important not to solely characterize macrophages by this activity. Their crucial roles in body development, homeostasis, repair, and immune responses against pathogens necessitate a broader understanding. Macrophages exhibit remarkable plasticity, allowing them to modify their functional characteristics in response to the tissue microenvironment (tissue type, presence of pathogens or inflammation, and specific signals from neighboring cells) swiftly. While there is no single defined “macrophage” entity, there is a diverse array of macrophage types because macrophage ontogeny involves the differentiation of progenitor cells into tissue-resident macrophages, as well as the recruitment and differentiation of circulating monocytes in response to tissue-specific cues. In addition, macrophages continuously sense and respond to environmental cues and tissue conditions, adjusting their functional and metabolic states accordingly. Consequently, it is of paramount importance to comprehend the heterogeneous origins and functions of macrophages employed in <italic>in vitro</italic> studies, as each available <italic>in vitro</italic> macrophage model is associated with specific sets of strengths and limitations. This review centers its attention on a comprehensive comparison between immortalized mouse macrophage cell lines and primary mouse macrophages. It provides a detailed analysis of the strengths and weaknesses inherent in these <italic>in vitro</italic> models. Finally, it explores the subtle distinctions between diverse macrophage cell lines, offering insights into numerous factors beyond the model type that can profoundly influence macrophage function.</p>",
        "doi": "10.3389/fcimb.2024.1457323",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>A new clinical prognosis model for breast cancer with ADSS as the hub gene</article-title>",
        "abstract": "<p><bold>Background:</bold> Breast cancer (BRCA) is the most common malignant tumor and the leading cause of cancer death worldwide. Adenylosuccinate synthetase (ADSS) is highly expressed in BRCA and its subtypes malignant tumors and is associated with poor prognosis.</p> <p><bold>Methods:</bold> By applying ROC curve, survival analysis, WGCNA, enrichment analysis, Cox regression model and other methods, this study explores the role of ADSS in BRCA and constructs a scoring model.</p> <p><bold>Results:</bold> In this study, the ADSS demonstrated good diagnostic efficacy and high expression in breast cancer tissues. Further exploration of the role of ADSS in BRCA revealed that its significantly related coexpressed genes are clearly involved in biological functions and signaling pathways associated with cell proliferation and differentiation. Additionally, the ADSS-related scoring model showed a significant prognostic impact on clinical characteristics, such as metastasis to lymph nodes, and it was discovered that the ADSS score and related scoring genes may affect the immune microenvironment of BRCA patients, potentially participating in the occurrence of this disease.</p> <p><bold>Conclusion:</bold> In summary, our gene expression analysis of ADSS in BRCA generated a clinical scoring model based on the ADSS that may be used to assess prognostic risk and provide potential clinical applications and rational therapeutic targets.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Nanomedicine for cancer patient‐centered care</article-title>",
        "abstract": "<p>Cancer is a leading cause of morbidity and mortality worldwide, and an increase in incidence is estimated in the next future, due to population aging, which requires the development of highly tolerable and low‐toxicity cancer treatment strategies. The use of nanotechnology to tailor treatments according to the genetic and immunophenotypic characteristics of a patient's tumor, and to allow its targeted release, can meet this need, improving the efficacy of treatment and minimizing side effects. Nanomedicine‐based approach for the diagnosis and treatment of cancer is a rapidly evolving field. Several nanoformulations are currently in clinical trials, and some have been approved and marketed. However, their large‐scale production and use are still hindered by an in‐depth debate involving ethics, intellectual property, safety and health concerns, technical issues, and costs. Here, we survey the key approaches, with specific reference to organ‐on chip technology, and cutting‐edge tools, such as CRISPR/Cas9 genome editing, through which nanosystems can meet the needs for personalized diagnostics and therapy in cancer patients. An update is provided on the nanopharmaceuticals approved and marketed for cancer therapy and those currently undergoing clinical trials. Finally, we discuss the emerging avenues in the field and the challenges to be overcome for the transfer of nano‐based precision oncology into clinical daily life.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Knowledge landscape of tumor-associated neutrophil: a bibliometric and visual analysis from 2000-2024</article-title>",
        "abstract": "<p>Neutrophils have long been consistently adjudged to hold a dominant position in acute inflammation, which once led people to undervalue their role in chronic malignancy. It is now acknowledged that neutrophils also infiltrate into the tumor microenvironment in substantial quantities and form a highly abundant immune population within the tumor, known as tumor-associated neutrophils (TANs). There has been a surge of interest in researching the eminent heterogeneity and plasticity of TANs in recent years, and scholars increasingly cotton on to the multifaceted functions of TANs so that strenuous endeavors have been devoted to enunciating their potential as therapeutic targets. Yet it remains much left to translate TAN-targeted immunotherapies into clinical practice. Therefore, there is great significance to comprehensively appraise the research status, focal point, and evolution trend of TAN by using bibliometric analysis.</p> <p>Publications related to TAN research from 2000 to 2024 are extracted from the Web of Science Core Collection. Bibliometric analysis and visualization were performed by tools encompassing Microsoft Excel, VOSviewer, CiteSpace, R-bibliometrix, and so on.</p> <p>The bibliometric analysis included a total of 788 publications authored by 5291 scholars affiliated with 1000 institutions across 58 countries/regions, with relevant articles published in 324 journals. Despite China’s maximum quantity of publications and top 10 institutions, the United States is the leading country with the most high-quality publications and is also the global cooperation center. FRONTIERS IN IMMUNOLOGY published the most papers, whereas CANCER RESEARCH is the highest co-cited journal. Israeli professor Fridlender, Zvi G. is the founder, pioneer, and cultivator with the highest citation counts and H-index in the TAN area. Our analysis prefigures the future trajectories: TAN heterogeneity, neutrophil extracellular trap, the crosstalk between TANs and immunocytes, and immunotherapy will likely be the focus of future research.</p> <p>A comprehensive bibliometric and visual analysis is first performed to map the current landscape and intellectual structure of TAN, which proffers fresh perspectives for further research. The accurate identification of distinct TAN subpopulations and the precise targeting of key pro-tumor/anti-tumor subpopulations hold immense potential to develop into a TAN-targeted immunotherapy.</p>",
        "doi": "10.3389/fimmu.2024.1448818",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Independent effects of testosterone, estradiol, and sex chromosomes on gene expression in immune cells of trans- and cisgender individuals</article-title>",
        "abstract": "<p id=\"P3\">The origins of sex differences in human disease are elusive, in part because of difficulties in separating the effects of sex hormones and sex chromosomes. To separate these variables, we examined gene expression in four groups of trans- or cisgender individuals: XX individuals treated with exogenous testosterone (n=21), XY treated with exogenous estradiol (n=13), untreated XX (n=20), and untreated XY (n=15). We performed single-cell RNA-sequencing of 358,426 peripheral blood mononuclear cells. Across the autosomes, 8 genes responded with a significant change in expression to testosterone, 34 to estradiol, and 32 to sex chromosome complement with no overlap between the groups. No sex-chromosomal genes responded significantly to testosterone or estradiol, but X-linked genes responded to sex chromosome complement in a remarkably stable manner across cell types. Through leveraging a four-state study design, we successfully separated the independent actions of testosterone, estradiol, and sex chromosome complement on genome-wide gene expression in humans.</p>",
        "doi": "10.1101/2024.10.08.617275",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Molecular targets and strategies in the development of nucleic acid cancer vaccines: from shared to personalized antigens</article-title>",
        "abstract": "<p id=\"Par1\">Recent breakthroughs in cancer immunotherapies have emphasized the importance of harnessing the immune system for treating cancer. Vaccines, which have traditionally been used to promote protective immunity against pathogens, are now being explored as a method to target cancer neoantigens. Over the past few years, extensive preclinical research and more than a hundred clinical trials have been dedicated to investigating various approaches to neoantigen discovery and vaccine formulations, encouraging development of personalized medicine. Nucleic acids (DNA and mRNA) have become particularly promising platform for the development of these cancer immunotherapies. This shift towards nucleic acid-based personalized vaccines has been facilitated by advancements in molecular techniques for identifying neoantigens, antigen prediction methodologies, and the development of new vaccine platforms. Generating these personalized vaccines involves a comprehensive pipeline that includes sequencing of patient tumor samples, data analysis for antigen prediction, and tailored vaccine manufacturing. In this review, we will discuss the various shared and personalized antigens used for cancer vaccine development and introduce strategies for identifying neoantigens through the characterization of gene mutation, transcription, translation and post translational modifications associated with oncogenesis. In addition, we will focus on the most up-to-date nucleic acid vaccine platforms, discuss the limitations of cancer vaccines as well as provide potential solutions, and raise key clinical and technical considerations in vaccine development.</p> <p>The online version contains supplementary material available at 10.1186/s12929-024-01082-x.</p>",
        "doi": "10.1186/s12929-024-01082-x",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Effect of fentanyl on HIV expression in peripheral blood mononuclear cells</article-title>",
        "abstract": "<p>Illicit drug use, particularly the synthetic opioid fentanyl, presents a significant global health challenge. Previous studies have shown that fentanyl enhances viral replication; yet, the mechanisms by which it affects HIV pathogenesis remain unclear. This study investigated the impact of fentanyl on HIV replication in CD4<sup>+</sup> T lymphocytes.</p> <p>CD4<sup>+</sup> T lymphocytes from HIV-negative donors were activated, infected with HIV<sub>NL4-3</sub>, and treated with fentanyl. HIV proviral DNA and p24 antigen expression were quantified using real-time PCR and ELISA, respectively. Single-cell RNA libraries were analyzed to identify differentially expressed genes.</p> <p>Results indicated that fentanyl treatment increased HIV p24 expression and proviral DNA levels, and naltrexone mitigated these effects. Single-cell RNAseq analysis identified significantly altered gene expression in CD4<sup>+</sup> T lymphocytes.</p> <p>The results of our findings suggest that fentanyl promotes HIV replication <italic>ex vivo</italic>, emphasizing the need for a deeper understanding of opioid-virus interactions to develop better treatment strategies for individuals with HIV and opioid use disorder.</p>",
        "doi": "10.3389/fmicb.2024.1463441",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Localization, tissue biology, and T cell state — implications for cancer immunotherapy</article-title>\n      ",
        "abstract": "<p id=\"P3\">Tissue localization is a critical determinant of T cell immunity. CD8<sup>+</sup> T cells are contact-dependent killers, which requires them to physically be within the tissue of interest to kill peptide–MHC class I-bearing target cells. Following their migration and extravasation into tissues, T cells receive many extrinsic cues from the local microenvironment, and these signals shape T cell differentiation, fate and function. Because major organ systems are variable in their functions and compositions, they apply disparate pressures on T cells to adapt to the local microenvironment. Additional complexity arises in the context of malignant lesions (either primary or metastatic), and this has made understanding the factors that dictate T cell function and longevity in tumours challenging. Moreover, T cell differentiation state influences how cues from the microenvironment are interpreted by tissue-infiltrating T cells, highlighting the importance of T cell state in the context of tissue biology. Here, we review the intertwined nature of T cell differentiation state, location, survival and function, and explain how dysfunctional T cell populations can adopt features of tissue-resident memory T cells to persist in tumours. Finally, we discuss how these factors have shaped responses to cancer immunotherapy.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>The burgeoning spatial multi-omics in human gastrointestinal cancers</article-title>",
        "abstract": "<p>The development and progression of diseases in multicellular organisms unfold within the intricate three-dimensional body environment. Thus, to comprehensively understand the molecular mechanisms governing individual development and disease progression, precise acquisition of biological data, including genome, transcriptome, proteome, metabolome, and epigenome, with single-cell resolution and spatial information within the body’s three-dimensional context, is essential. This foundational information serves as the basis for deciphering cellular and molecular mechanisms. Although single-cell multi-omics technology can provide biological information such as genome, transcriptome, proteome, metabolome, and epigenome with single-cell resolution, the sample preparation process leads to the loss of spatial information. Spatial multi-omics technology, however, facilitates the characterization of biological data, such as genome, transcriptome, proteome, metabolome, and epigenome in tissue samples, while retaining their spatial context. Consequently, these techniques significantly enhance our understanding of individual development and disease pathology. Currently, spatial multi-omics technology has played a vital role in elucidating various processes in tumor biology, including tumor occurrence, development, and metastasis, particularly in the realms of tumor immunity and the heterogeneity of the tumor microenvironment. Therefore, this article provides a comprehensive overview of spatial transcriptomics, spatial proteomics, and spatial metabolomics-related technologies and their application in research concerning esophageal cancer, gastric cancer, and colorectal cancer. The objective is to foster the research and implementation of spatial multi-omics technology in digestive tumor diseases. This review will provide new technical insights for molecular biology researchers.</p>",
        "doi": "10.7717/peerj.17860",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>A comprehensive review of electrophysiological techniques in amyotrophic lateral sclerosis research</article-title>",
        "abstract": "<p>Amyotrophic lateral sclerosis (ALS), a devastating neurodegenerative disease, is characterized by progressive motor neuron degeneration, leading to widespread weakness and respiratory failure. While a variety of mechanisms have been proposed as causes of this disease, a full understanding remains elusive. Electrophysiological alterations, including increased motor axon excitability, likely play an important role in disease progression. There remains a critical need for non-animal disease models that can integrate electrophysiological tools to better understand underlying mechanisms, track disease progression, and evaluate potential therapeutic interventions. This review explores the integration of electrophysiological technologies with ALS disease models. It covers cellular and clinical electrophysiological tools and their applications in ALS research. Additionally, we examine conventional animal models and highlight advancements in humanized models and 3D organoid technologies. By bridging the gap between these models, we aim to enhance our understanding of ALS pathogenesis and facilitate the development of new therapeutic strategies.</p>",
        "doi": "10.3389/fncel.2024.1435619",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Bioinformatic-Experimental Screening Uncovers Multiple Targets for Increase of MHC-I Expression through Activating the Interferon Response in Breast Cancer</article-title>",
        "abstract": "<p>Expression of major histocompatibility complex I (MHC-I) on tumor cells is extremely important for the antitumor immune response for its essential role in activating various immune cells, including tumor-specific CD8+ T cells. Cancers of lower MHC-I expression commonly exhibit less immune cell infiltration and worse prognosis in clinic. In this study, we conducted bioinformatic-experimental screening to identify potential gene targets to enhance MHC-I expression in breast cancer (BRCA). Through a combination of MHC-I scoring, gene expression correlation analysis, survival prognostication, and Cibersort tumor-infiltrated lymphocytes (TILs) scoring, we identify 144 genes negatively correlated with both MHC-I expression and TILs in breast cancer. Furthermore, we verified partially according to KEGG functional enrichment or gene-dependency analysis and figured out multiple genes, including <italic toggle=\"yes\">PIP5K1A</italic>, <italic toggle=\"yes\">NCKAP1</italic>, <italic toggle=\"yes\">CYFIP1</italic>, <italic toggle=\"yes\">DIS3</italic>, <italic toggle=\"yes\">TBP</italic>, and <italic toggle=\"yes\">EXOC1</italic>, as effective gene targets for increasing MHC-I expression in breast cancer. Mechanistically, knockout of each of these genes activated the intrinsic interferon response in breast cancer cells, which not only promoted MHC-I expression but also caused immunogenic cell death of breast cancer. Finally, the scRNA-seq confirmed the negative correlation of PIP5K1A et al. with TILs in breast cancer patients. Collectively, we identified multiple gene targets for an increase in MHC-I expression in breast cancer in this study.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Improving tumor microenvironment assessment in chip systems through next-generation technology integration</article-title>",
        "abstract": "<p>The tumor microenvironment (TME) comprises a diverse array of cells, both cancerous and non-cancerous, including stromal cells and immune cells. Complex interactions among these cells play a central role in driving cancer progression, impacting critical aspects such as tumor initiation, growth, invasion, response to therapy, and the development of drug resistance. While targeting the TME has emerged as a promising therapeutic strategy, there is a critical need for innovative approaches that accurately replicate its complex cellular and non-cellular interactions; the goal being to develop targeted, personalized therapies that can effectively elicit anti-cancer responses in patients. Microfluidic systems present notable advantages over conventional <italic>in vitro</italic> 2D co-culture models and <italic>in vivo</italic> animal models, as they more accurately mimic crucial features of the TME and enable precise, controlled examination of the dynamic interactions among multiple human cell types at any time point. Combining these models with next-generation technologies, such as bioprinting, single cell sequencing and real-time biosensing, is a crucial next step in the advancement of microfluidic models. This review aims to emphasize the importance of this integrated approach to further our understanding of the TME by showcasing current microfluidic model systems that integrate next-generation technologies to dissect cellular intra-tumoral interactions across different tumor types. Carefully unraveling the complexity of the TME by leveraging next generation technologies will be pivotal for developing targeted therapies that can effectively enhance robust anti-tumoral responses in patients and address the limitations of current treatment modalities.</p>",
        "doi": "10.3389/fbioe.2024.1462293",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Anoikis in cell fate, physiopathology, and therapeutic interventions</article-title>",
        "abstract": "<p>The extracellular matrix (ECM) governs a wide spectrum of cellular fate processes, with a particular emphasis on anoikis, an integrin‐dependent form of cell death. Currently, anoikis is defined as an intrinsic apoptosis. In contrast to traditional apoptosis and necroptosis, integrin correlates ECM signaling with intracellular signaling cascades, describing the full process of anoikis. However, anoikis is frequently overlooked in physiological and pathological processes as well as traditional in vitro research models. In this review, we summarized the role of anoikis in physiological and pathological processes, spanning embryonic development, organ development, tissue repair, inflammatory responses, cardiovascular diseases, tumor metastasis, and so on. Similarly, in the realm of stem cell research focused on the functional evolution of cells, anoikis offers a potential solution to various challenges, including in vitro cell culture models, stem cell therapy, cell transplantation, and engineering applications, which are largely based on the regulation of cell fate by anoikis. More importantly, the regulatory mechanisms of anoikis based on molecular processes and ECM signaling will provide new strategies for therapeutic interventions (drug therapy and cell‐based therapy) in disease. In summary, this review provides a systematic elaboration of anoikis, thus shedding light on its future research.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Epithelial‑derived head and neck squamous tumourigenesis (Review)</article-title>",
        "abstract": "<p>Head and neck squamous cell carcinomas (HNSCCs), a heterogeneous group of cancers that arise from the mucosal epithelia cells in the head and neck areas, present great challenges in diagnosis, treatment and prognosis due to their complex aetiology and various clinical manifestations. Several factors, including smoking, alcohol consumption, oncogenic genes, growth factors, Epstein-Barr virus and human papillomavirus infections can contribute to HNSCC development. The unpredictable tumour microenvironment adds to the complexity of managing HNSCC. Despite significant advances in therapies, the prediction of outcome after treatment for patients with HNSCC remains poor, and the 5-year overall survival rate is low due to late diagnosis. Early detection greatly increases the chances of successful treatment. The present review aimed to bring together the latest findings related to the molecular mechanisms of HNSCC carcinogenesis and progression. Comprehensive genomic, transcriptomic, metabolomic, microbiome and proteomic analyses allow researchers to identify important biological markers such as genetic alterations, gene expression signatures and protein markers that drive HNSCC tumours. These biomarkers associated with the stages of initiation, progression and metastasis of cancer are useful in the management of patients with cancer in order to improve their life expectancy and quality of life.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Combination of multiple omics techniques for a personalized therapy or treatment selection</article-title>\n      ",
        "abstract": "<p>Despite targeted therapies and immunotherapies have revolutionized the treatment of cancer patients, only a limited number of patients have long-term responses. Moreover, due to differences within cancer patients in the tumor mutational burden, composition of the tumor microenvironment as well as of the peripheral immune system and microbiome, and in the development of immune escape mechanisms, there is no “one fit all” therapy. Thus, the treatment of patients must be personalized based on the specific molecular, immunologic and/or metabolic landscape of their tumor. In order to identify for each patient the best possible therapy, different approaches should be employed and combined. These include (i) the use of predictive biomarkers identified on large cohorts of patients with the same tumor type and (ii) the evaluation of the individual tumor with “omics”-based analyses as well as its <italic>ex vivo</italic> characterization for susceptibility to different therapies.</p>\n      ",
        "doi": "10.3389/fimmu.2023.1258013",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Proteomic and Metabolomic Profiling in Soft Tissue Sarcomas</article-title>\n      ",
        "abstract": "<p id=\"Par1\">Advances in proteomic and metabolomic technologies have accelerated our understanding of multiple aspects of cancer biology across distinct tumour types. Here we review the current state-of-the-art in the use of proteomics and metabolomics in soft tissue sarcomas. We highlight the utility of these Omics-based methodologies to identify new drug targets, synthetic lethal interactions, candidate therapeutics and novel biomarkers to facilitate patient stratification. Due to the unbiased and global nature of these profiling methods to assess the levels of protein expression, post-translational modifications such as phosphorylation and glycosylation as well as key metabolites, many of these findings have broad applications not just in specific histotypes but across multiple STS subtypes. Specific examples of proteomic and metabolomic findings that have led to the development of early phase clinical trials of investigational agents will be discussed. While promising, the use of these technologies in the study of sarcoma is still limited, and there is a need for further research in this area. In particular, it would be important to integrate these approaches with other Omics strategies such as genomics and epigenomics as well as implement these tools alongside clinical trials in order to maximize the impact of these tools on our biological understanding and treatment of this group of rare diseases of unmet need.</p>\n      ",
        "doi": "10.1007/s11864-022-00947-3",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Targeting Asparagine and Serine Metabolism in Germinal Centre-Derived B Cells Non-Hodgkin Lymphomas (B-NHL)</article-title>\n      ",
        "abstract": "<p>BL and DLBCL are subtypes of B-cell lymphomas that arise from germinal centre B lymphocytes. Differentiation between BL and DLBCL is critical and can be challenging, as these two types of cancer share the same morphological, immunophenotypic, and genetic characteristics. In this study, we have examined metabolism in BL and DLBCL lymphomas and found distinctive differences in serine metabolism. We show that BL cells consume significantly more extracellular asparagine than DLBCL cells. Using a tracer-based approach, we find that asparagine regulates the serine uptake and serine synthesis in BL and DLBCL cells. Calculation of Differentially Expressed Genes (DEGs) from RNAseq datasets of BL and DLBCL patients show that BL cancers express the genes involved in serine synthesis at a higher level than DLBCL. Remarkably, combined use of an inhibitor of serine biosynthesis pathway and an anticancer drug asparaginase increases the sensitivity of BL cells to extracellular asparagine deprivation without inducing a change in the sensitivity of DLBCL cells to asparaginase. In summary, our study unravels metabolic differences between BL and DLBCL with diagnostic potential which may also open new avenues for treatment.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Soft Tissue Sarcoma: An Insight on Biomarkers at Molecular, Metabolic and Cellular Level</article-title>\n      ",
        "abstract": "<p>Soft tissue sarcoma is a rare mesenchymal malignancy. Despite the advancements in the fields of radiology, pathology and surgery, these tumors often recur locally and/or with metastatic disease. STS is considered to be a diagnostic challenge due to the large variety of histological subtypes with clinical and histopathological characteristics which are not always distinct. One of the important clinical problems is a lack of useful biomarkers. Therefore, the discovery of biomarkers that can be used to detect tumors or predict tumor response to chemotherapy or radiotherapy could help clinicians provide more effective clinical management.</p>\n         <p>Soft tissue sarcomas (STSs) are a heterogeneous group of rare tumors. Although constituting only 1% of all human malignancies, STSs represent the second most common type of solid tumors in children and adolescents and comprise an important group of secondary malignancies. Over 100 histologic subtypes have been characterized to date (occurring predominantly in the trunk, extremity, and retroperitoneum), and many more are being discovered due to molecular profiling. STS mortality remains high, despite adjuvant chemotherapy. New prognostic stratification markers are needed to help identify patients at risk of recurrence and possibly apply more intensive or novel treatments. Recent scientific advancements have enabled a more precise molecular characterization of sarcoma subtypes and revealed novel therapeutic targets and prognostic/predictive biomarkers. This review aims at providing a comprehensive overview of the most relevant cellular, molecular and metabolic biomarkers for STS, and highlight advances in STS-related biomarker research.</p>\n        ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>PI5P4Ks drive metabolic homeostasis through peroxisome-mitochondria interplay</article-title>\n      ",
        "abstract": "<p id=\"P3\">PI5P4Ks are a class of phosphoinositide kinases that phosphorylate PI-5-P to PI-4,5-P2. Distinct localization of phosphoinositides is fundamental for a multitude of cellular functions. Here, we identify a role for peroxisomal PI-4,5-P2 generated by the PI5P4Ks in maintaining energy balance. We demonstrate that PI-4,5-P2 regulates peroxisomal fatty acid oxidation by mediating trafficking of lipid droplets to peroxisomes, which is essential for sustaining mitochondrial metabolism. Using fluorescent-tagged lipids and metabolite tracing, we show that loss of the PI5P4Ks significantly impairs lipid uptake and b-oxidation in the mitochondria. Further, loss of PI5P4Ks results in dramatic alterations in mitochondrial structural and functional integrity, which under nutrient deprivation is further exacerbated, causing cell death. Notably, inhibition of the PI5P4Ks in cancer cells and mouse tumor models leads to decreased cell viability and tumor growth, respectively. Together, these studies reveal an unexplored role for PI5P4Ks in preserving metabolic homeostasis, which is necessary for tumorigenesis.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Loss of G-Protein Pathway Suppressor 2 Promotes Tumor Growth Through Activation of AKT Signaling</article-title>\n      ",
        "abstract": "<p>G Protein Suppressor 2 (GPS2) is a multifunctional protein that exerts important roles in inflammation and metabolism in adipose, liver, and immune cells. GPS2 has recently been identified as a significantly mutated gene in breast cancer and other malignancies and proposed to work as a putative tumor suppressor. However, molecular mechanisms by which GPS2 prevents cancer development and/or progression are largely unknown. Here, we have profiled the phenotypic changes induced by GPS2 depletion in MDA-MB-231 triple negative breast cancer cells and investigated the underlying molecular mechanisms. We found that GPS2-deleted MDA-MB-231 cells exhibited increased proliferative, migratory, and invasive properties <italic>in vitro</italic>, and conferred greater tumor burden <italic>in vivo</italic> in an orthotopic xenograft mouse model. Transcriptomic, proteomic and phospho-proteomic profiling of GPS2-deleted MBA-MB-231 revealed a network of altered signals that relate to cell growth and PI3K/AKT signaling. Overlay of GPS2-regulated gene expression with MDA-MB-231 cells modified to express constitutively active AKT showed significant overlap, suggesting that sustained AKT activation is associated with loss of GPS2. Accordingly, we demonstrate that the pro-oncogenic phenotypes associated with GPS2 deletion are rescued by pharmacological inhibition of AKT with MK2206. Collectively, these observations confirm a tumor suppressor role for GPS2 and reveal that loss of GPS2 promotes breast cancer cell proliferation and tumor growth through uncontrolled activation of AKT signaling. Moreover, our study points to GPS2 as a potential biomarker for a subclass of breast cancers that would be responsive to PI3K-class inhibitor drugs.</p>\n      ",
        "doi": "10.3389/fcell.2020.608044",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Tumor stemness score to estimate epithelial-to-mesenchymal transition (EMT) and cancer stem cells (CSCs) characterization and to predict the prognosis and immunotherapy response in bladder urothelial carcinoma</article-title>\n      ",
        "abstract": "<p id=\"Par1\">A growing number of investigations have suggested a close link between cancer stem cells (CSCs), epithelial-to-mesenchymal transition (EMT), and the tumor microenvironment (TME). However, the relationships between these physiological processes in bladder urothelial carcinoma (BLCA) remain unclear.</p>\n         <p id=\"Par2\">We first explored biomarkers of tumor stemness (TS) by single-cell sequencing analysis. Then, subtypes of bladder urothelial carcinoma (BLCA) were identified using clustering analysis based on TS biomarkers. The TS score was constructed using principal component analysis to quantify tumor stemness in BLCA. Then, meta-analysis was performed to measure the hazard ratio of the TS score in BLCA cohorts. Moreover, we evaluated the clinical value of the TS score for predicting the response to tumor immunotherapy using immunotherapy cohorts. Finally, we built an EMT cell model by treating T24 cells with TGF-β and validated the relationship between the TS score and the EMT process in tumors by real-time quantitative PCR, cell invasion assays, and RNA-seq. In total, 3846 BLCA cells, 6 cell lines, 1627 BLCA samples, and 9858 samples from 32 other types of tumors were included in our study.</p>\n         <p id=\"Par3\">Three TS clusters and two TS-related gene clusters were identified with differential EMT activity status, CSC features, and TME characteristics in BLCA. Then, a TS scoring system was established with 61 TS-related genes to quantify the TS. The prognostic value of the TS score was then confirmed in multiple independent cohorts. A high TS score was associated with high EMT activity, CSC characteristics, high stromal cell content, high TP53 mutation rate, poor prognosis, and high tumor immunotherapy tolerance. The cell line experiment and RNA-seq further validated that our TS score can reflect the EMT and CSC characterization of tumor cells.</p>\n         <p id=\"Par4\">Overall, this research provides a better understanding of tumor invasion and metastasis mechanisms through an analysis of TS patterns with different EMT processes and CSC characteristics. The TS score provides an index for EMT and CSC research and helps clinicians develop treatment plans and predict outcomes for patients.</p>\n         <p>The online version contains supplementary material available at 10.1186/s13287-023-03239-1.</p>\n        ",
        "doi": "10.1186/s13287-023-03239-1",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<ArticleTitle>Deciphering the role of FUS::DDIT3 expression and tumor microenvironment in myxoid liposarcoma development.</ArticleTitle>",
        "abstract": "Myxoid liposarcoma (MLS) displays a distinctive tumor microenvironment and is characterized by the FUS::DDIT3 fusion oncogene, however, the precise functional contributions of these two elements remain enigmatic in tumor development.",
        "doi": "10.1186/s12967-024-05211-w",
        "pmid": "38671504",
        "pmcid": "11046918",
        "score": 3
    },
    {
        "title": "<ArticleTitle>Insight of a lipid metabolism prognostic model to identify immune landscape and potential target for retroperitoneal liposarcoma.</ArticleTitle>",
        "abstract": "The exploration of lipid metabolism dysregulation may provide novel perspectives for retroperitoneal liposarcoma (RPLS). In our study, we aimed to investigate potential targets and facilitate further understanding of immune landscape in RPLS, through lipid metabolism-associated genes (LMAGs) based prognostic model.",
        "doi": "10.3389/fimmu.2023.1209396",
        "pmid": "37483592",
        "pmcid": "10359070",
        "score": 3
    },
    {
        "title": "<ArticleTitle>A cryptic EWSR1::DDIT3 fusion in myxoid liposarcoma: Potential pitfalls with FISH and cytogenetics.</ArticleTitle>",
        "abstract": "Myxoid liposarcoma (MLS) is molecularly characterized by fusions involving the DDIT3 gene in chromosome band 12q13; the fusion partner is FUS in band 16p11 in 90-95% of the cases and EWSR1 in band 22q12 in the remaining 5-10%. Hence, molecular studies, often fluorescence in situ hybridization (FISH) for DDIT3 rearrangement, are useful for establishing a correct diagnosis. Although all MLS tumors should have DDIT3 fusions, it is important to be aware of reasons for potential false-negative results. We here present a case of MLS that was negative for FISH for DDIT3, that showed an unexpected t(11;22) at G-banding, but that displayed a characteristic EWSR1::DDIT3 fusion at RNA-sequencing. The results suggest that neoplasia-associated fusions that, due to the transcriptional orientations of the two genes involved, cannot arise through only two double-strand breaks are more likely to be associated with negative FISH-findings and unexpected karyotypes.",
        "doi": "10.1002/gcc.23103",
        "pmid": "36379683",
        "pmcid": "10100227",
        "score": 2
    },
    {
        "title": "<ArticleTitle>Expression and function of Siglec-15 in RLPS and its correlation with PD-L1: Bioinformatics Analysis and Clinicopathological Evidence.</ArticleTitle>",
        "abstract": "Purpose: Retroperitoneal liposarcoma (RLPS) is a rare malignancy without effective treatment. Since current treatment for unresectable RLPS is unsatisfactory, immunotherapy and targeted therapy are urgently needed. Siglec-15 is a transmembrane protein highly homologous to PD-L1 and is involved in tumor immune escape. The biological function of Siglec-15 in RLPS, its prognostic relevance and its relationship with PD-L1 need to be further clarified. In this study, we aimed to explore the biological function of Siglec-15 in sarcomas through bioinformatics analysis, and we also evaluated Siglec-15 and PD-L1 expression in RLPS samples. The relationship between the expression of Siglec-15 and PD-L1 and their clinicopathological relevance and prognostic value were also investigated in clinical RLPS patients. Methods: The RNA sequencing data of 259 sarcoma cases and 48 RLPS cases from TCGA were used to analyze the Siglec-15 expression and the differentially expressed genes (DEG) related with Siglec-15 expression. In addition, DEGs were subsequently analyzed through the gene ontology (GO)/ Kyoto Encyclopedia of Genes and Genomes (KEGG) and protein-protein interaction (PPI) network. Tumor specimens were obtained from 91 RLPS patients of our sarcoma center, and Siglec-15 and PD-L1 expression were evaluated using immunohistochemistry. The correlation between the expression level of these two markers as well as their correlation with clinicopathological factors and prognosis of RLPS patients was also assessed. Results: GEPIA analysis showed that the high expression of Siglec-15 was associated with poor sarcoma OS (P=0.034). A total of 682 differential genes were identified between the high and low expression groups of Siglec-15 in RLPS. Enrichment analysis of the KEGG pathway showed that Siglec-15 was related to the Hippo signaling pathway and the neuroactive ligand-receptor interaction. GO annotation analysis showed that the expression of Siglec-15 may thus be able to affect serine hydrolase activity, alongside signal receptor activator activity. The top 5 genes with the largest number of connection points are APOA1, F2, AHSG, AMBP, SERPINC1. In subsequent studies, we used 91 liposarcoma samples from our center for verification. Siglec-15 was expressed in 84.6% of RLPS cases, whereas PD-L1 was expressed in 17.6% of RLPS cases. A negative correlation was observed between Siglec-15 and PD-L1 expression (P=0.020). In this group of RLPS patients, high Siglec-15 expression was correlated with poorer disease-free survival (DFS) (P=0.021), and it was an independent predictor of DFS (hazard ratio: 2.298; 95% confidence interval: 1.154-4.576; P=0.018). However, we did not find a correlation between PD-L1 expression and overall survival or DFS in RLPS patients. Conclusion: The DEG and signaling pathways identified in the study could provide a preliminary understanding of the underlying molecular mechanisms of Siglec-15 in the development and progression of RLPS. High expression of Siglec-15 was a negative independent predictive factor for DFS of RLPS. The negative relationship between Siglec-15 and PD-L1 expression suggested that the Siglec-15 pathway might be an important supplement to PD-L1 treatment.",
        "doi": "10.7150/ijms.77193",
        "pmid": "36438917",
        "pmcid": "9682511",
        "score": 3
    },
    {
        "title": "<ArticleTitle>Promoter G-quadruplexes and transcription factors cooperate to shape the cell type-specific transcriptome.</ArticleTitle>",
        "abstract": "Cell identity is maintained by activation of cell-specific gene programs, regulated by epigenetic marks, transcription factors and chromatin organization. DNA G-quadruplex (G4)-folded regions in cells were reported to be associated with either increased or decreased transcriptional activity. By G4-ChIP-seq/RNA-seq analysis on liposarcoma cells we confirmed that G4s in promoters are invariably associated with high transcription levels in open chromatin. Comparing G4 presence, location and transcript levels in liposarcoma cells to available data on keratinocytes, we showed that the same promoter sequences of the same genes in the two cell lines had different G4-folding state: high transcript levels consistently associated with G4-folding. Transcription factors AP-1 and SP1, whose binding sites were the most significantly represented in G4-folded sequences, coimmunoprecipitated with their G4-folded promoters. Thus, G4s and their associated transcription factors cooperate to determine cell-specific transcriptional programs, making G4s to strongly emerge as new epigenetic regulators of the transcription machinery.",
        "doi": "10.1038/s41467-021-24198-2",
        "pmid": "34162892",
        "pmcid": "8222265",
        "score": 3
    },
    {
        "title": "<article-title>Integration of ubiquitination-related genes in predictive signatures for prognosis and immunotherapy response in sarcoma</article-title>",
        "abstract": "<p>Ubiquitination is one of the most prevalent and complex post-translational modifications of proteins in eukaryotes, playing a critical role in regulating various physiological and pathological processes. Targeting ubiquitination pathways, either through inhibition or activation, holds promise as a novel therapeutic approach for cancer treatment. However, the expression patterns, prognostic significance, and underlying mechanisms of ubiquitination-related genes (URGs) in sarcoma (SARC) remain unclear.</p> <p>We analyzed URG expression patterns and prognostic implications in TCGA-SARC using public databases, identifying DEGs related to ubiquitination among SARC molecular subtypes. Functional enrichment analysis elucidated their biological significance. Prognostic signatures were developed using LASSO-Cox regression, and a predictive nomogram was constructed. External validation was performed using GEO datasets and clinical tissue samples. The association between URG risk scores and various clinical parameters, immune response, drug sensitivity, and RNA modification regulators was investigated. Integration of data from multiple sources and RT-qPCR confirmed upregulated expression of prognostic URGs in SARC. Single-cell RNA sequencing data analyzed URG distribution across immune cell types. Prediction analysis identified potential target genes of microRNAs and long non-coding RNAs.</p> <p>We identified five valuable genes (CALR, CASP3, BCL10, PSMD7, PSMD10) and constructed a prognostic model, simultaneously identifying two URG-related subtypes in SARC. The UEGs between subtypes in SARC are mainly enriched in pathways such as Cell cycle, focal adhesion, and ECM-receptor interaction. Analysis of URG risk scores reveals that patients with a low-risk score have better prognoses compared to those with high-risk scores. There is a significant correlation between DRG riskscore and clinical features, immune therapy response, drug sensitivity, and genes related to pan-RNA epigenetic modifications. High-risk SARC patients were identified as potential beneficiaries of immune checkpoint inhibitor therapy. We established regulatory axes in SARC, including CALR/hsa-miR-29c-3p/LINC00943, CASP3/hsa-miR-143-3p/LINC00944, and MIR503HG. RT-qPCR data further confirmed the upregulation of prognostic URGs in SARC. Finally, we validated the prognostic model’s excellent predictive performance in predicting outcomes for SARC patients.</p> <p>We discovered a significant correlation between aberrant expression of URGs and prognosis in SARC patients, identifying a prognostic model related to ubiquitination. This model provides a basis for individualized treatment and immunotherapy decisions for SARC patients.</p>",
        "doi": "10.3389/fonc.2024.1446522",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>7310 System-level Analysis in Polycystic Ovary Syndrome on a Panel of Genetically Diverse Strains of Mice</article-title>",
        "abstract": "<p>\n<bold>Disclosure:</bold> L.M. Velez: None. C. Johnson: None. I. Tamburrini: None. M. Zhou: None. C. Viesi: None. N. Ujagar: None. D. Ashbrook: None. M. Nelson: None. A. Senior: None. D. James: None. R. Williams: None. D. Nicholas: None. M. Seldin: None.</p> <p>Polycystic ovary syndrome (PCOS) is the most common endocrinopathy in women, with a prevalence of ∼4-20% in women of reproductive age. The diagnosis of the syndrome generally occurs when the patient consults for fertility issues and is only based on a reproductive criterion, which includes (1) hyperandrogenism, (2) oligo-anovulation, and (3) polycystic ovary morphology. However, the overlap of PCOS with cardiometabolic diseases is significant. To put in numbers; up to 75% of PCOS women present some degree of insulin insensitivity, 38-88% present obesity or overweight, 20-50% develop type 2 diabetes by age 40, and PCOS women are at increased risk of cardiovascular disease. Despite these facts, shared reproductive/metabolic mechanisms are largely underexplored. Moreover, studies addressing the genetic architecture of PCOS are missing. Here, we induced a PCOS-like condition in 25 recombinant and classical inbred female strains and matched placebo controls over 6 weeks. Comprehensive in vivo and terminal reproductive/metabolic analyses were performed, as well as ovary and adipose RNA-Seq. These strains varied in PCOS response in a number of key metabolic and reproductive traits, including circulating hormone levels, glucose metabolism, and cardiac function. We applied a linear mixed-effects model to estimate heritability, and genetic (h2), PCOS, and gene-by-PCOS interactions. High h2 was observed for lean and fat mass, glucose, and AUC, whereas PCOS effects were high for the BW change, testosterone, and AUC. Substantial gene-by-PCOS interactions were found for reproductive hormones. Undirected network construction and centrality estimates showed that the reproductive hormones LH and LH/FSH ratio were the strongest central traits connecting metabolic phenotypes. We also showed select strains represent subtypes of human PCOS-metabolism interaction with varied susceptibilities to disease in a PCOS setting. Ovarian RNA-seq analysis of PCOS DEGs showed strong enrichments with human disease settings such as hyperandrogenism, inflammation, and pregnancy hypertension. Similar analyses in GWAT RNA-seq showed enrichments in weight gain, liposarcoma, inflammation, and reproductive diseases were at the top, with adipose genes connecting these diseases and potentially involved with PCOS. In conclusion, we established a PCOS model to study relevant mechanisms intersecting reproduction with metabolism in the context of genetic variation.</p> <p>\n<italic toggle=\"yes\">Presentation:</italic> 6/2/2024</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>S-p-bromobenzyl-glutathione cyclopentyl diester (BBGC) as novel therapeutic strategy to enhance trabectedin anti-tumor effect in soft tissue sarcoma preclinical models</article-title>",
        "abstract": "<p id=\"Par1\">Trabectedin, approved for the treatment of soft tissue sarcoma (STS), interferes with cell division and genetic transcription processes. Due to its strong anti-tumor activity in only certain histotypes, several studies on trabectedin combinations are currently ongoing to improve its efficacy. In this study, we aimed to investigate novel potential therapeutic strategies to enhance the anti-tumor effect of trabectedin using integrated in silico, in vitro, and in vivo approaches. For in silico analysis, we screened two public datasets, GSEA M5190 and TCGA SARC. Fibrosarcoma, leiomyosarcoma, dedifferentiated, and myxoid liposarcoma cell lines were used for in vitro studies. For in vivo experiments, fibrosarcoma orthotopic murine model was developed. In silico analysis identified Glo1 as the only druggable target upregulated after trabectedin treatment and correlated with poor prognosis. The specific Glo1 inhibitor, S-p-bromobenzylglutathione cyclopentyl diester (BBGC), increased trabectedin cytotoxicity in STS cells, and restored drug sensitivity in myxoid liposarcoma cells resistant to trabectedin. Moreover, the combined treatment with BBGC and trabectedin had a synergistic antitumor effect in vivo without any additional toxicity to mice. Based on these results, we believe that BBGC warrants further investigation to evaluate its potential clinical use in combination with trabectedin.</p>",
        "doi": "10.1038/s41388-024-03143-9",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Obtention of viable cell suspensions from breast cancer tumor biopsies for 3D chromatin conformation and single-cell transcriptome analysis</article-title>",
        "abstract": "<p>Molecular and cellular characterization of tumors is essential due to the complex and heterogeneous nature of cancer. In recent decades, many bioinformatic tools and experimental techniques have been developed to achieve personalized characterization of tumors. However, sample handling continues to be a major challenge as limitations such as prior treatments before sample acquisition, the amount of tissue obtained, transportation, or the inability to process fresh samples pose a hurdle for experimental strategies that require viable cell suspensions. Here, we present an optimized protocol that allows the recovery of highly viable cell suspensions from breast cancer primary tumor biopsies. Using these cell suspensions we have successfully characterized genome architecture through Hi-C. Also, we have evaluated single-cell gene expression and the tumor cellular microenvironment through single-cell RNAseq. Both technologies are key in the detailed and personalized molecular characterization of tumor samples. The protocol described here is a cost-effective alternative to obtain viable cell suspensions from biopsies simply and efficiently.</p>",
        "doi": "10.3389/fmolb.2024.1420308",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>A comprehensive overview of liquid biopsy applications in pediatric solid tumors</article-title>",
        "abstract": "<p id=\"Par1\">Liquid biopsies are emerging as an alternative source for pediatric cancer biomarkers with potential applications during all stages of patient care, from diagnosis to long-term follow-up. While developments within this field are reported, these mainly focus on dedicated items such as a specific liquid biopsy matrix, analyte, and/or single tumor type. To the best of our knowledge, a comprehensive overview is lacking. Here, we review the current state of liquid biopsy research for the most common non-central nervous system pediatric solid tumors. These include neuroblastoma, renal tumors, germ cell tumors, osteosarcoma, Ewing sarcoma, rhabdomyosarcoma and other soft tissue sarcomas, and liver tumors. Within this selection, we discuss the most important or recent studies involving liquid biopsy-based biomarkers, anticipated clinical applications, and the current challenges for success. Furthermore, we provide an overview of liquid biopsy-based biomarker publication output for each tumor type based on a comprehensive literature search between 1989 and 2023. Per study identified, we list the relevant liquid biopsy-based biomarkers, matrices (e.g., peripheral blood, bone marrow, or cerebrospinal fluid), analytes (e.g., circulating cell-free and tumor DNA, microRNAs, and circulating tumor cells), methods (e.g., digital droplet PCR and next-generation sequencing), the involved pediatric patient cohort, and proposed applications. As such, we identified 344 unique publications. Taken together, while the liquid biopsy field in pediatric oncology is still behind adult oncology, potentially relevant publications have increased over the last decade. Importantly, steps towards clinical implementation are rapidly gaining ground, notably through validation of liquid biopsy-based biomarkers in pediatric clinical trials.</p>",
        "doi": "10.1038/s41698-024-00657-z",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Establishment of a CD8+ T cells‐related prognostic risk model for acral melanoma based on single‐cell and bulk RNA sequencing</article-title>",
        "abstract": "<p>CD8+ T cells have been recognized as crucial factors in the prognosis of melanoma. However, there is currently a lack of gene markers that accurately describe their characteristics and functions in acral melanoma (AM), which hinders the development of personalized medicine.</p> <p>Firstly, we explored the composition differences of immune cells in AM using single‐cell RNA sequencing (scRNA‐seq) data and comprehensively characterized the immune microenvironment of AM in terms of composition, developmental differentiation, function, and cell communication. Subsequently, we constructed and validated a prognostic risk scoring model based on differentially expressed genes (DEGs) of CD8+ T cells using the TCGA‐SKCM cohort through Lasso‐Cox method. Lastly, immunofluorescence staining was performed to validate the expression of four genes (ISG20, CCL4, LPAR6, DDIT3) in AM and healthy skin tissues as included in the prognostic model.</p> <p>The scRNA‐seq data revealed that memory CD8+ T cells accounted for the highest proportion in the immune microenvironment of AM, reaching 70.5%. Cell–cell communication analysis showed extensive communication relationships among effector CD8+ T cells. Subsequently, we constructed a prognostic scoring model based on DEGs derived from CD8+ T cell sources. Four CD8+ T cell‐related genes were included in the construction and validation of the prognostic model. Additionally, immunofluorescence results demonstrated that ISG20 and CCL4 were downregulated, while LPAR6 and DDIT3 were upregulated in AM tissues compared to normal skin tissues.</p> <p>Identifying biomarkers based on the expression levels of CD8+ T cell‐related genes may be an effective approach for establishing prognostic models in AM patients. The independently prognostic risk evaluation model we constructed provides new insights and theoretical support for immunotherapy in AM.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Desmoplastic small round cell tumor: from genomics to targets, potential paths to future therapeutics</article-title>",
        "abstract": "<p>Desmoplastic Small Round Cell Tumor (DSRCT) is a highly aggressive pediatric cancer caused by a reciprocal translocation between chromosomes 11 and 22, leading to the formation of the EWSR1::WT1 oncoprotein. DSRCT presents most commonly in the abdominal and pelvic peritoneum and remains refractory to current treatment regimens which include chemotherapy, radiotherapy, and surgery. As a rare cancer, sample and model availability have been a limiting factor to DSRCT research. However, the establishment of rare tumor banks and novel cell lines have recently propelled critical advances in the understanding of DSRCT biology and the identification of potentially promising targeted therapeutics. Here we review model and dataset availability, current understanding of the EWSR1::WT1 oncogenic mechanism, and promising preclinical therapeutics, some of which are now advancing to clinical trials. We discuss efforts to inhibit critical dependencies including NTRK3, EGFR, and CDK4/6 as well as novel immunotherapy strategies targeting surface markers highly expressed in DSRCT such as B7-H3 or neopeptides either derived from or driven by the fusion oncoprotein. Finally, we discuss the prospect of combination therapies and strategies for prioritizing clinical translation.</p>",
        "doi": "10.3389/fcell.2024.1442488",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Context-dependent T-BOX transcription factor family: from biology to targeted therapy</article-title>",
        "abstract": "<p id=\"Par1\">T-BOX factors belong to an evolutionarily conserved family of transcription factors. T-BOX factors not only play key roles in growth and development but are also involved in immunity, cancer initiation, and progression. Moreover, the same T-BOX molecule exhibits different or even opposite effects in various developmental processes and tumor microenvironments. Understanding the multiple roles of context-dependent T-BOX factors in malignancies is vital for uncovering the potential of T-BOX-targeted cancer therapy. We summarize the physiological roles of T-BOX factors in different developmental processes and their pathological roles observed when their expression is dysregulated. We also discuss their regulatory roles in tumor immune microenvironment (TIME) and the newly arising questions that remain unresolved. This review will help in systematically and comprehensively understanding the vital role of the T-BOX transcription factor family in tumor physiology, pathology, and immunity. The intention is to provide valuable information to support the development of T-BOX-targeted therapy.</p>",
        "doi": "10.1186/s12964-024-01719-2",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Epigenetic determinants of fusion-driven sarcomas: paradigms and challenges</article-title>",
        "abstract": "<p>We describe exciting recent advances in fusion-driven sarcoma etiology, from an epigenetics perspective. By exploring the current state of the field, we identify and describe the central mechanisms that determine sarcomagenesis. Further, we discuss seminal studies in translational genomics, which enabled epigenetic characterization of fusion-driven sarcomas. Important context for epigenetic mechanisms include, but are not limited to, cell cycle and metabolism, core regulatory circuitry, 3-dimensional chromatin architectural dysregulation, integration with ATP-dependent chromatin remodeling, and translational animal modeling. Paradoxically, while the genetic requirements for oncogenic transformation are highly specific for the fusion partners, the epigenetic mechanisms we as a community have uncovered are categorically very broad. This dichotomy prompts the question of whether the investigation of rare disease epigenomics should prioritize studying individual cell populations, thereby examining whether the mechanisms of chromatin dysregulation are specific to a particular tumor. We review recent advances focusing on rhabdomyosarcoma, synovial sarcoma, alveolar soft part sarcoma, clear cell sarcoma, undifferentiated round cell sarcoma, Ewing sarcoma, myxoid/round liposarcoma, epithelioid hemangioendothelioma and desmoplastic round cell tumor. The growing number of groundbreaking discoveries in the field, motivated us to anticipate further exciting advances in the area of mechanistic epigenomics and direct targeting of fusion transcription factors in the years ahead.</p>",
        "doi": "10.3389/fcell.2024.1416946",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Integration of pre-treatment computational radiomics, deep radiomics, and transcriptomics enhances soft-tissue sarcoma patient prognosis</article-title>",
        "abstract": "<p id=\"Par1\">Our objective was to capture subgroups of soft-tissue sarcoma (STS) using handcraft and deep radiomics approaches to understand their relationship with histopathology, gene-expression profiles, and metastatic relapse-free survival (MFS). We included all consecutive adults with newly diagnosed locally advanced STS (<italic>N</italic> = 225, 120 men, median age: 62 years) managed at our sarcoma reference center between 2008 and 2020, with contrast-enhanced baseline MRI. After MRI postprocessing, segmentation, and reproducibility assessment, 175 handcrafted radiomics features (h-RFs) were calculated. Convolutional autoencoder neural network (CAE) and half-supervised CAE (HSCAE) were trained in repeated cross-validation on representative contrast-enhanced slices to extract 1024 deep radiomics features (d-RFs). Gene-expression levels were calculated following RNA sequencing (RNAseq) of 110 untreated samples from the same cohort. Unsupervised classifications based on h-RFs, CAE, HSCAE, and RNAseq were built. The h-RFs, CAE, and HSCAE grouping were not associated with the transcriptomics groups but with prognostic radiological features known to correlate with lower survivals and higher grade and SARCULATOR groups (a validated prognostic clinical-histological nomogram). HSCAE and h-RF groups were also associated with MFS in multivariable Cox regressions. Combining HSCAE and transcriptomics groups significantly improved the prognostic performances compared to each group alone, according to the concordance index. The combined radiomic-transcriptomic group with worse MFS was characterized by the up-regulation of 707 genes and 292 genesets related to inflammation, hypoxia, apoptosis, and cell differentiation. Overall, subgroups of STS identified on pre-treatment MRI using handcrafted and deep radiomics were associated with meaningful clinical, histological, and radiological characteristics, and could strengthen the prognostic value of transcriptomics signatures.</p>",
        "doi": "10.1038/s41698-024-00616-8",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Epigenetic control of metabolic identity across cell types</article-title>",
        "abstract": "<p id=\"P1\">Constraint-based network modelling is a powerful tool for analysing cellular metabolism at genomic scale. Here, we conducted an integrative analysis of metabolic networks reconstructed from RNA-seq data with paired epigenomic data from the EpiATLAS resource of the International Human Epigenome Consortium (IHEC). Applying a state-of-the-art contextualisation algorithm, we reconstructed metabolic networks across 1,555 samples corresponding to 58 tissues and cell types. Analysis of these networks revealed the distribution of metabolic functionalities across human cell types and provides a compendium of human metabolic activity. This integrative approach allowed us to define, across tissues and cell types, i) reactions that fulfil the basic metabolic processes (core metabolism), and ii) cell type-specific functions (unique metabolism), that shape the metabolic identity of a cell or a tissue. Integration with EpiATLAS-derived cell type-specific gene-level chromatin states and enhancer-gene interactions identified enhancers, transcription factors, and key nodes controlling core and unique metabolism. Transport and first reactions of pathways were enriched for high expression, active chromatin state, and Polycomb-mediated repression in cell types where pathways are inactive, suggesting that key nodes are targets of repression. This integrative analysis forms the basis for identifying regulation points that control metabolic identity in human cells.</p>",
        "doi": "10.1101/2024.07.24.604914",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Progress in building clinically relevant patient‐derived tumor xenograft models for cancer research</article-title>\n        ",
        "abstract": "<p>Patient‐derived tumor xenograft (PDX) models, a method involving the surgical extraction of tumor tissues from cancer patients and subsequent transplantation into immunodeficient mice, have emerged as a pivotal approach in translational research, particularly in advancing precision medicine. As the first stage of PDX development, the patient‐derived orthotopic xenograft (PDOX) models implant tumor tissue in mice in the corresponding anatomical locations of the patient. The PDOX models have several advantages, including high fidelity to the original tumor, heightened drug sensitivity, and an elevated rate of successful transplantation. However, the PDOX models present significant challenges, requiring advanced surgical techniques and resource‐intensive imaging technologies, which limit its application. And then, the humanized mouse models, as well as the zebrafish models, were developed. Humanized mouse models contain a human immune environment resembling the tumor and immune system interplay. The humanized mouse models are a hot topic in PDX model research. Regarding zebrafish patient‐derived tumor xenografts (zPDX) and patient‐derived organoids (PDO) as promising models for studying cancer and drug discovery, zPDX models are used to transplant tumors into zebrafish as novel personalized medical animal models with the advantage of reducing patient waiting time. PDO models provide a cost‐effective approach for drug testing that replicates the in vivo environment and preserves important tumor‐related information for patients. The present review highlights the functional characteristics of each new phase of PDX and provides insights into the challenges and prospective developments in this rapidly evolving field.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Adipocyte mesenchymal transition contributes to mammary tumor progression</article-title>\n      ",
        "abstract": "<p id=\"P3\">Obesity is associated with increased cancer incidence and progression. However, the relationship between adiposity and cancer remains poorly understood at the mechanistic level. Here, we report that adipocytes from tumor-invasive mammary fat undergo de-differentiation to fibroblast-like precursor cells during tumor progression and integrate into the tumor microenvironment. Single-cell sequencing reveals that these de-differentiated adipocytes lose their original identities and transform into multiple cell types, including myofibroblast- and macrophage-like cells, with their characteristic features involved in immune response, inflammation, and extracellular matrix remodeling. The de-differentiated cells are metabolically distinct from tumor-associated fibroblasts but exhibit comparable effects on tumor cell proliferation. Inducing de-differentiation by Xbp1s overexpression promotes tumor progression despite lower adiposity. In contrast, promoting lipid-storage capacity in adipocytes through MitoNEET overexpression curbs tumor growth despite greater adiposity. Collectively, the metabolic interplay between tumor cells and adipocytes induces adipocyte mesenchymal transition and contributes to reconfigure the stroma into a more tumor-friendly microenvironment.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Diagnosis Biomarkers of Cholangiocarcinoma in Human Bile: An Evidence-Based Study</article-title>\n      ",
        "abstract": "<p>A liquid biopsy has the characteristics of low trauma and easy acquisition in the diagnosis of cholangiocarcinoma. Many researchers try to find diagnostic or prognostic biomarkers of CCA through blood, urine, bile and other body fluids. Due to the close proximity of bile to the lesion and the stable nature, bile gradually comes into people’s view. The evaluation of human bile diagnostic biomarkers is not only to the benefit of screening more suitable clinical markers but also of exploring the pathological changes of the disease.</p>\n         <p>Cholangiocarcinoma (CCA) is a multifactorial malignant tumor of the biliary tract, and the incidence of CCA is increasing in recent years. At present, the diagnosis of CCA mainly depends on imaging and invasive examination, with limited specificity and sensitivity and late detection. The early diagnosis of CCA always faces the dilemma of lacking specific diagnostic biomarkers. Non-invasive methods to assess the degree of CAA have been developed throughout the last decades. Among the many specimens looking for CCA biomarkers, bile has gotten a lot of attention lately. This paper mainly summarizes the recent developments in the current research on the diagnostic biomarkers for CCA in human bile at the levels of the gene, protein, metabolite, extracellular vesicles and volatile organic compounds.</p>\n        ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Harnessing ferroptosis for enhanced sarcoma treatment: mechanisms, progress and prospects</article-title>",
        "abstract": "<p id=\"Par1\">Sarcoma is a malignant tumor that originates from mesenchymal tissue. The common treatment for sarcoma is surgery supplemented with radiotherapy and chemotherapy. However, patients have a 5-year survival rate of only approximately 60%, and sarcoma cells are highly resistant to chemotherapy. Ferroptosis is an iron-dependent nonapoptotic type of regulated programmed cell death that is closely related to the pathophysiological processes underlying tumorigenesis, neurological diseases and other conditions. Moreover, ferroptosis is mediated via multiple regulatory pathways that may be targets for disease therapy. Recent studies have shown that the induction of ferroptosis is an effective way to kill sarcoma cells and reduce their resistance to chemotherapeutic drugs. Moreover, ferroptosis-related genes are related to the immune system, and their expression can be used to predict sarcoma prognosis. In this review, we describe the molecular mechanism underlying ferroptosis in detail, systematically summarize recent research progress with respect to ferroptosis application as a sarcoma treatment in various contexts, and point out gaps in the theoretical research on ferroptosis, challenges to its clinical application, potential resolutions of these challenges to promote ferroptosis as an efficient, reliable and novel method of clinical sarcoma treatment.</p>",
        "doi": "10.1186/s40164-024-00498-3",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Integrated Molecular Analysis Reveals 2 Distinct Subtypes of Pure\nSeminoma of the Testis</article-title>\n      ",
        "abstract": "<p>Testicular germ cell tumors (TGCT) are the most common solid malignancy in\nadolescent and young men, with a rising incidence over the past 20 years.\nOverall, TGCTs are second in terms of the average life years lost per person\ndying of cancer, and clinical therapeutics without adverse long-term side\neffects are lacking. Platinum-based regimens for TGCTs have heterogeneous\noutcomes even within the same histotype that frequently leads to under- and\nover-treatment. Understanding of molecular differences that lead to diverse\noutcomes of TGCT patients may improve current treatment approaches. Seminoma\nis the most common subtype of TGCTs, which can either be pure or present in\ncombination with other histotypes.</p>\n         <p>Here we conducted a computational study of 64 pure seminoma samples from The\nCancer Genome Atlas, applied consensus clustering approach to their\ntranscriptomic data and revealed 2 clinically relevant seminoma subtypes:\nseminoma subtype 1 and 2.</p>\n         <p>Our analysis identified significant differences in pluripotency stage,\nactivity of double stranded DNA breaks repair mechanisms, rates of loss of\nheterozygosity, and expression of lncRNA responsible for cisplatin\nresistance between the subtypes. Seminoma subtype 1 is characterized by\nhigher pluripotency state, while subtype 2 showed attributes of reprograming\ninto non-seminomatous TGCT. The seminoma subtypes we identified may provide\na molecular underpinning for variable responses to chemotherapy and\nradiation.</p>\n         <p>Translating our findings into clinical care may help improve risk\nstratification of seminoma, decrease overtreatment rates, and increase\nlong-term quality of life for TGCT survivors.</p>\n        ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Stemness Subtypes and Scoring System Predict Prognosis and Efficacy of Immunotherapy in Soft Tissue Sarcoma</article-title>\n      ",
        "abstract": "<p>Tumor stemness has been reported to play important roles in cancers. However, a comprehensive analysis of tumor stemness remains to be performed to investigate the specific mechanisms and practical values of stemness in soft tissue sarcomas (STS). Here, we applied machine learning to muti-omic data of patients from TCGA-SARC and GSE21050 cohorts to reveal important roles of stemness in STS. We demonstrated limited roles of existing mRNAsi in clinical application. Therefore, based on stemness-related signatures (SRSs), we identified three stemness subtypes with distinct stemness, immune, and metabolic characteristics using consensus clustering. The low-stemness subtype had better prognosis, activated innate and adaptive immunity (e.g., infiltrating B, DC, Th1, CD8+ T, activated NK, gamma delta T cells, and M1 macrophages), more enrichment of metabolic pathways, more sites with higher methylation level, higher gene mutations, CNA burdens, and immunogenicity indicators. Furthermore, the 16 SRS-based stemness prognostic index (SPi) was developed, and we found that low-SPi patients with low stemness had better prognosis and other characteristics similar to those in the low-stemness subtype. Besides, low-stemness subtype and low-SPi patients could benefit from immunotherapy. The predictive value of SPi in immunotherapy was more accurate after the addition of MSI into SPi. MSI<sup>low</sup>SPi<sup>low</sup> patients might be more sensitive to immunotherapy. In conclusion, we highlighted mechanisms and practical values of the stemness in STS. We also recommended the combination of MSI and SPi which is a promising tool to predict prognosis and achieve precise treatments of immunotherapy in STS.</p>\n      ",
        "doi": "10.3389/fimmu.2022.796606",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Transcriptome analysis of tumor-derived mesenchymal progenitor cells shows that <italic>CHST15</italic> is a fibrosis regulator of retroperitoneal liposarcoma</article-title>\n      ",
        "abstract": "<p>Retroperitoneal liposarcoma (RPLS) is a rare, biologically heterogeneous tumor with distinct clinical characteristics, such as frequent local recurrence, repeated relapse, and rare distant metastasis. No effective targeted therapy is available for RPLS. Here, we aim to determine the pathological functions and therapeutic potential of carbohydrate sulfotransferase 15 (<italic>CHST15</italic>) in RPLS.</p>\n         <p>Tumor-derived mesenchymal progenitor cells (MPCs) and normal adipose derived mesenchymal stem cells (MSCs) were obtained from patients with RPLS. MPCs and MSCs were isolated and characterized based on surface markers, proliferation, and differentiation using flow cytometry and molecular staining. Transcriptome analysis was performed to decipher expression profile of differentiation-related genes in 3 paired MSCs and MPCs. Further confirmation of genes were performed using quantitative real-time polymerase chain reaction (qRT-PCR). Plasmids overexpressing <italic>CHST15</italic> were transfected into adipose MSCs to examine fibrosis-related gene expression at mRNA level by real-time PCR.</p>\n         <p>The tumor stromal-derived MPCs expressed CD105, CD73, and CD90, and exhibited osteogenic and adipogenic differentiation potential <italic>in vitro</italic>. The proliferation of tumor-derived MPCs was significantly lower than that of normal adipose-derived MSCs (P&lt;0.001). Transcriptome analysis revealed upregulation of <italic>IL-7R</italic>, <italic>ALPL</italic>, <italic>PKNOX2</italic>, and <italic>CHST15</italic> in tumor-derived MPCs. <italic>CHST15</italic> was highly expressed in tumor-derived MPCs (P&lt;0.001). <italic>CHST15</italic> mediated fibrosis-related <italic>FGF2</italic> gene expression in MSCs (P&lt;0.05) and MPCs (P&lt;0.001).</p>\n         <p><italic>CHST15</italic> is upregulated in tumor-derived MPCs and regulates fibrosis in RPLS. This provides clues for development of novel therapeutic strategies by targeting <italic>CHST15</italic>-induced MPC activation in RPLS.</p>\n        ",
        "doi": "10.21037/atm-22-963",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Spatial multiplexed immunofluorescence analysis reveals coordinated cellular networks associated with overall survival in metastatic osteosarcoma</article-title>",
        "abstract": "<p id=\"Par1\">Patients diagnosed with advanced osteosarcoma, often in the form of lung metastases, have abysmal five-year overall survival rates. The complexity of the osteosarcoma immune tumor microenvironment has been implicated in clinical trial failures of various immunotherapies. The purpose of this exploratory study was to spatially characterize the immune tumor microenvironment of metastatic osteosarcoma lung specimens. Knowledge of the coordinating cellular networks within these tissues could then lead to improved outcomes when utilizing immunotherapy for treatment of this disease. Importantly, various cell types, interactions, and cellular neighborhoods were associated with five-year survival status. Of note, increases in cellular interactions between T lymphocytes, positive for programmed cell death protein 1, and myeloid-derived suppressor cells were observed in the 5-year deceased cohort. Additionally, cellular neighborhood analysis identified an Immune-Cold Parenchyma cellular neighborhood, also associated with worse 5-year survival. Finally, the Osteosarcoma Spatial Score, which approximates effector immune activity in the immune tumor microenvironment through the spatial proximity of immune and tumor cells, was increased within 5-year survivors, suggesting improved effector signaling in this patient cohort. Ultimately, these data represent a robust spatial multiplexed immunofluorescence analysis of the metastatic osteosarcoma immune tumor microenvironment. Various communication networks, and their association with survival, were described. In the future, identification of these networks may suggest the use of specific, combinatory immunotherapeutic strategies for improved anti-tumor immune responses and outcomes in osteosarcoma.</p> <p xmlns:ns0=\"http://www.w3.org/1999/xlink\" id=\"Par2\">\n<graphic position=\"anchor\" ns0:href=\"41413_2024_359_Figa_HTML\" id=\"d33e294\" />\n</p>",
        "doi": "10.1038/s41413-024-00359-z",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Cancer Stem Cells in Oral Squamous Cell Carcinoma: A Narrative Review on Experimental Characteristics and Methodological Challenges</article-title>",
        "abstract": "<p>Cancer stem cells (CSCs) represent a subpopulation of cancer cells that are believed to initiate and drive cancer progression. In animal models, xenotransplanted CSCs have demonstrated the ability to produce tumors. Since their initial isolation in blood cancers, CSCs have been identified in various solid human cancers, including oral squamous cell carcinoma (OSCC). In addition to their tumorigenic properties, dysregulated stem-cell-related signaling pathways—Wnt family member (Wnt), neurogenic locus notch homolog protein (Notch), and hedgehog—have been shown to endow CSCs with characteristics like self-renewal, phenotypic plasticity, and chemoresistance, contributing to recurrence and treatment failure. Consequently, CSCs have become targets for new therapeutic agents, with some currently in different phases of clinical trials. Notably, small molecule inhibitors of the hedgehog signaling pathway, such as vismodegib and glasdegib, have been approved for the treatment of basal cell carcinoma and acute myeloid leukemia, respectively. Other strategies for eradicating CSCs include natural compounds, nano-drug delivery systems, targeting mitochondria and the CSC microenvironment, autophagy, hyperthermia, and immunotherapy. Despite the extensive documentation of CSCs in OSCC since its first demonstration in head and neck (HN) SCC in 2007, none of these novel pharmacological approaches have yet entered clinical trials for OSCC patients. This narrative review summarizes the in vivo and in vitro evidence of CSCs and CSC-related signaling pathways in OSCC, highlighting their role in promoting chemoresistance and immunotherapy resistance. Additionally, it addresses methodological challenges and discusses future research directions to improve experimental systems and advance CSC studies.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Lesson on obesity and anatomy of adipose tissue: new models of study in the era of clinical and translational research</article-title>",
        "abstract": "<p id=\"Par1\">Obesity is a serious global illness that is frequently associated with metabolic syndrome. Adipocytes are the typical cells of adipose organ, which is composed of at least two different tissues, white and brown adipose tissue. They functionally cooperate, interconverting each other under physiological conditions, but differ in their anatomy, physiology, and endocrine functions. Different cellular models have been proposed to study adipose tissue in vitro. They are also useful for elucidating the mechanisms that are responsible for a pathological condition, such as obesity, and for testing therapeutic strategies. Each cell model has its own characteristics, culture conditions, advantages and disadvantages. The choice of one model rather than another depends on the specific study the researcher is conducting. In recent decades, three-dimensional cultures, such as adipose spheroids, have become very attractive because they more closely resemble the phenotype of freshly isolated cells. The use of such models has developed in parallel with the evolution of translational research, an interdisciplinary branch of the biomedical field, which aims to learn a scientific translational approach to improve human health and longevity. The focus of the present review is on the growing body of data linking the use of new cell models and the spread of translational research. Also, we discuss the possibility, for the future, to employ new three-dimensional adipose tissue cell models to promote the transition from benchside to bedsite and vice versa, allowing translational research to become routine, with the final goal of obtaining clinical benefits in the prevention and treatment of obesity and related disorders.</p>",
        "doi": "10.1186/s12967-024-05547-3",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Establishment and characterization of 18 Sarcoma Cell Lines: Unraveling the Molecular Mechanisms of Doxorubicin Resistance in Sarcoma Cell Lines</article-title>",
        "abstract": "<p id=\"Par1\">Sarcomas, malignant tumors from mesenchymal tissues, exhibit poor prognosis despite advancements in treatment modalities such as surgery, radiotherapy, and chemotherapy, with doxorubicin being a cornerstone treatment. Resistance to doxorubicin remains a significant hurdle in therapy optimization. This study aims to dissect the molecular bases of doxorubicin resistance in sarcoma cell lines, which could guide the development of tailored therapeutic strategies. Eighteen sarcoma cell lines from 14 patients were established under ethical approvals and classified into seven subtypes. Molecular, genomic, and transcriptomic analyses included whole-exome sequencing, RNA sequencing, drug sensitivity assays, and pathway enrichment studies to elucidate the resistance mechanisms. Variability in doxorubicin sensitivity was linked to specific genetic alterations, including mutations in TP53 and variations in the copy number of genomic loci like 11q24.2. Transcriptomic profiling divided cell lines into clusters by karyotype complexity, influencing drug responses. Additionally, pathway analyses highlighted the role of signaling pathways like WNT/BETA-CATENIN and HEDGEHOG in doxorubicin-resistant lines. Comprehensive molecular profiling of sarcoma cell lines has revealed complex interplays of genetic and transcriptomic factors dictating doxorubicin resistance, underscoring the need for personalized medicine approaches in sarcoma treatment. Further investigations into these resistance mechanisms could facilitate the development of more effective, customized therapy regimens.</p> <p>The online version contains supplementary material available at 10.1186/s12967-024-05700-y.</p>",
        "doi": "10.1186/s12967-024-05700-y",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Understanding, diagnosing, and treating pancreatic cancer from the perspective of telomeres and telomerase</article-title>",
        "abstract": "<p id=\"Par1\">Telomerase is associated with cellular aging, and its presence limits cellular lifespan. Telomerase by preventing telomere shortening can extend the number of cell divisions for cancer cells. In adult pancreatic cells, telomeres gradually shorten, while in precancerous lesions of cancer, telomeres in cells are usually significantly shortened. At this time, telomerase is still in an inactive state, and it is not until before and after the onset of cancer that telomerase is reactivated, causing cancer cells to proliferate. Methylation of the telomerase reverse transcriptase (TERT) promoter and regulation of telomerase by lactate dehydrogenase B (LDHB) is the mechanism of telomerase reactivation in pancreatic cancer. Understanding the role of telomeres and telomerase in pancreatic cancer will help to diagnose and initiate targeted therapy as early as possible. This article reviews the role of telomeres and telomerase as biomarkers in the development of pancreatic cancer and the progress of research on telomeres and telomerase as targets for therapeutic intervention.</p>",
        "doi": "10.1038/s41417-024-00768-6",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Unveiling the dynamics of acetylation and phosphorylation in SGBS and 3T3-L1 adipogenesis</article-title>",
        "abstract": "<p>Obesity, characterized by enlarged and dysfunctional adipose tissue, is among today’s most pressing global public health challenges with continuously increasing prevalence. Despite the importance of post-translational protein modifications (PTMs) in cellular signaling, knowledge of their impact on adipogenesis remains limited. Here, we studied the temporal dynamics of transcriptome, proteome, central carbon metabolites, and the acetyl- and phosphoproteome during adipogenesis using LC-MS/MS combined with PTM enrichment strategies on human (SGBS) and mouse (3T3-L1) adipocyte models. Both cell lines exhibited unique PTM profiles during adipogenesis, with acetylated proteins being enriched for central energy metabolism, while phosphorylated proteins related to insulin signaling and organization of cellular structures. As candidates with strong correlation to the adipogenesis timeline we identified CD44 and the acetylation sites FASN_K673 and IDH_K272. While results generally aligned between SGBS and 3T3-L1 cells, details appeared cell line specific. Our datasets on SGBS and 3T3-L1 adipogenesis dynamics are accessible for further mining.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Novel insights into TCR-T cell therapy in solid neoplasms: optimizing adoptive immunotherapy</article-title>",
        "abstract": "<p id=\"Par1\">Adoptive immunotherapy in the T cell landscape exhibits efficacy in cancer treatment. Over the past few decades, genetically modified T cells, particularly chimeric antigen receptor T cells, have enabled remarkable strides in the treatment of hematological malignancies. Besides, extensive exploration of multiple antigens for the treatment of solid tumors has led to clinical interest in the potential of T cells expressing the engineered T cell receptor (TCR). TCR-T cells possess the capacity to recognize intracellular antigen families and maintain the intrinsic properties of TCRs in terms of affinity to target epitopes and signal transduction. Recent research has provided critical insight into their capability and therapeutic targets for multiple refractory solid tumors, but also exposes some challenges for durable efficacy. In this review, we describe the screening and identification of available tumor antigens, and the acquisition and optimization of TCRs for TCR-T cell therapy. Furthermore, we summarize the complete flow from  laboratory to clinical applications of TCR-T cells. Last, we emerge future prospects for improving therapeutic efficacy in cancer world with combination therapies or TCR-T derived products. In conclusion, this review depicts our current understanding of TCR-T cell therapy in solid neoplasms, and provides new perspectives for expanding its clinical applications and improving therapeutic efficacy.</p>",
        "doi": "10.1186/s40164-024-00504-8",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Identifying genetic susceptibility to <italic toggle=\"no\">Aspergillus fumigatus</italic> infection using collaborative cross mice and <styled-content style=\"fixed-case\" toggle=\"no\">RNA‐Seq</styled-content> approach</article-title>",
        "abstract": "<p>\n<italic toggle=\"no\">Aspergillus fumigatus</italic> (Af) is one of the most ubiquitous fungi and its infection potency is suggested to be strongly controlled by the host genetic background. The aim of this study was to search for candidate genes associated with host susceptibility to <italic toggle=\"no\">Aspergillus fumigatus</italic> (Af) using an RNAseq approach in CC lines and hepatic gene expression.</p> <p>We studied 31 male mice from 25 CC lines at 8 weeks old; the mice were infected with Af. Liver tissues were extracted from these mice 5 days post‐infection, and next‐generation RNA‐sequencing (RNAseq) was performed. The GENE‐E analysis platform was used to generate a clustered heat map matrix.</p> <p>Significant variation in body weight changes between CC lines was observed. Hepatic gene expression revealed 12 top prioritized candidate genes differentially expressed in resistant versus susceptible mice based on body weight changes. Interestingly, three candidate genes are located within genomic intervals of the previously mapped quantitative trait loci (QTL), including Gm16270 and Stox1 on chromosome 10 and Gm11033 on chromosome 8.</p> <p>Our findings emphasize the CC mouse model's power in fine mapping the genetic components underlying susceptibility towards Af. As a next step, eQTL analysis will be performed for our RNA‐Seq data. Suggested candidate genes from our study will be further assessed with a human cohort with aspergillosis.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Revisiting 'Hallmarks of Cancer' In Sarcomas</article-title>",
        "abstract": "<p>There is no doubt that anyone who has participated in cancer care or research has once read the 'Hallmarks of Cancer' papers published by Hanahan and Weinberg in 2001 and 2011. They initially defined the six qualities of cancer cells as cancer hallmarks in 2001, but expanded that to 11 as a next generation in 2011.</p> <p>In their papers, they discussed the potential treatment strategies against cancer corresponding to each of the 11 hallmarks, and to date, proposed therapies that target genes and signaling pathways associated with each of these hallmarks have guided a trail that cancer treatments should take, some of which are now used as standard in clinical practice and some of which have yet to progress that far. Along with the recent advances in cancer research such as genomic analysis with next generation sequencing, they can be reconverged to an alternative six categories defined as selective proliferative advantages, altered stress response, deregulated cellular metabolism, immune modulation and inflammation, tumor microenvironment, tissue invasion and metastasis. In this paper, we will overview the current state of these alternative hallmarks and their corresponding treatments in the current sarcoma practice, then discuss the future direction of sarcoma treatment.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Antitumor Effects of PRMT5 Inhibition in Sarcomas</article-title>\n        ",
        "abstract": "<p>Patients with advanced soft-tissue sarcomas (STS) have few therapeutic options. Protein arginine methyltransferase 5 (PRMT5), an anticancer target, has been extensively investigated in recent years in epithelial tumors. To date, no data related to the biological role of PRMT5 inhibition and its potential effect as a treatment in STS have been reported.</p>\n         <p>To investigate the therapeutic potential of PRMT5 targeting in STS, we first evaluated the prognostic value of <italic toggle=\"yes\">PRMT5</italic> expression in two different cohorts of patients with STS. We then used the potent and selective GSK3326595 (GSK595) compound to investigate the antitumor effect of the pharmacologic inhibition of PRMT5 <italic toggle=\"yes\">in vitro</italic> via MTT, apoptosis, cell cycle, clonogenicity, and proliferation assays. <italic toggle=\"yes\">In vivo</italic> studies were performed with two animal models to evaluate the effects of GSK595 on tumor growth. The mechanisms of action were investigated by RNA sequencing, metabolic pathway analysis, Western blotting, and glucose uptake/lactate production assays.</p>\n         <p>High <italic toggle=\"yes\">PRMT5</italic> gene expression levels were significantly associated with worsened metastasis-free survival of patients with STS. GSK595 decreased the global symmetric dimethylarginine level, the proliferation rate and clonogenicity of STS cell lines <italic toggle=\"yes\">in vitro</italic> and tumor growth <italic toggle=\"yes\">in vivo</italic>. Moreover, PRMT5 inhibition regulated aerobic glycolysis through downregulation of key enzymes of glycolysis as well as glucose uptake and lactate production.</p>\n         <p>The current study demonstrated that PRMT5 regulates STS cell metabolism and thus represents a potential therapeutic target for STS. Additional studies in diverse sarcoma subtypes will be essential to confirm and expand upon these findings.</p>\n         <p>STSs have limited therapeutic options. We show here the poor prognostic value of high <italic toggle=\"yes\">PRMT5</italic> expression in STS. Moreover, we demonstrate that the pharmacologic inhibition of PRMT5 has significant antitumor activity through the downregulation of glycolysis. Our findings support the clinical investigation of PRMT5 inhibition in STSs.</p>\n        ",
        "doi": "10.1158/2767-9764.CRC-23-0239",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Identifying specific TLS-associated genes as potential biomarkers for predicting prognosis and evaluating the efficacy of immunotherapy in soft tissue sarcoma</article-title>",
        "abstract": "<p>The tertiary lymphatic structure (TLS) is an important component of the tumor immune microenvironment and has important significance in patient prognosis and response to immune therapy. However, the underlying mechanism of TLS in soft tissue sarcoma remains unclear.</p> <p>A total of 256 RNAseq and 7 single-cell sequencing samples were collected from TCGA-SARC and GSE212527 cohorts. Based on published TLS-related gene sets, four TLS scores were established by GSVA algorithm. The immune cell infiltration was calculated via TIMER2.0 and “MCPcounter” algorithms. In addition, the univariate, LASSO, and multivariate-Cox analyses were used to select TLS-related and prognosis-significant hub genes. Single-cell sequencing dataset, clinical immunohistochemical, and cell experiments were utilized to validate the hub genes.</p> <p>In this study, four TLS-related scores were identified, and the total-gene TLS score more accurately reflected the infiltration level of TLS in STS. We further established two hub genes (DUSP9 and TNFSF14) prognosis markers and risk scores associated with soft tissue sarcoma prognosis and immune therapy response. Flow cytometry analysis showed that the amount of CD3, CD8, CD19, and CD11c positive immune cell infiltration in the tumor tissue dedifferentiated liposarcoma patients was significantly higher than that of liposarcoma patients. Cytological experiments showed that soft tissue sarcoma cell lines overexpressing TNFSF14 could inhibit the proliferation and migration of sarcoma cells.</p> <p>This study systematically explored the TLS and related genes from the perspectives of bioinformatics, clinical features and cytology experiments. The total-gene TLS score, risk score and TNFSF14 hub gene may be useful biomarkers for predicting the prognosis and immunotherapy efficacy of soft tissue sarcoma.</p>",
        "doi": "10.3389/fimmu.2024.1372692",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Deciphering the prognostic and therapeutic significance of BAG1 and BAG2 for predicting distinct survival outcome and effects on liposarcoma</article-title>",
        "abstract": "<p id=\"Par1\">Liposarcoma (LPS) is the second most common kind of soft tissue sarcoma, and a heterogeneous malignant tumor derived from adipose tissue. Up to now, the prognostic value of BAG1 or BAG2 in LPS has not been defined yet. Expression profiling data of LPS patients were collected from TCGA and GEO database. Survival curves were plotted to verify the outcome differences of patients based on BAG1 or BAG2 expression. Univariate and multivariate Cox regression models were used to analyze the prognostic ability of BAG1 or BAG2. Chaperone’s regulators BAG1 and BAG2 were identified as prognostic biomarkers for LPS patients, which exhibited distinct expression patterns and survival outcome prediction performances. Patients with high BAG2 expression and/or low BAG1 expression had worse prognosis. Enrichment analysis showed that BAG1 was involved in negative regulation of TGF-β signaling. Low expression of BAG1 was associated with high abundance of regulatory T cells (Tregs). The 2-gene signature model further confirmed the improved risk assessment performance of BAG1 and BAG2: high risk patients displayed poor prognosis. BAG1 and BAG2 are supposed to be potential prognostic biomarkers for LPS and have impacts on liposarcomagenesis and immune infiltration in distinctive manners, which may function as potential therapy targets (BAG1 agonists/BAG2 inhibitors) for LPS.</p>",
        "doi": "10.1038/s41598-024-67659-6",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title><italic>CDK4</italic> is co-amplified with either <italic>TP53</italic> promoter gene fusions or <italic>MDM2</italic> through distinct mechanisms in osteosarcoma</article-title>",
        "abstract": "<p id=\"Par1\">Amplification of the <italic>MDM2</italic> and <italic>CDK4</italic> genes on chromosome 12 is commonly associated with low-grade osteosarcomas. In this study, we conducted high-resolution genomic and transcriptomic analyses on 33 samples from 25 osteosarcomas, encompassing both high- and low-grade cases with <italic>MDM2</italic> and/or <italic>CDK4</italic> amplification. We discerned four major subgroups, ranging from nearly intact genomes to heavily rearranged ones, each harbouring <italic>CDK4</italic> and <italic>MDM2</italic> amplification or <italic>CDK4</italic> amplification with <italic>TP53</italic> structural alterations. While amplicons involving <italic>MDM2</italic> exhibited signs of an initial chromothripsis event, no evidence of chromothripsis was found in <italic>TP53</italic>-rearranged cases. Instead, the initial disruption of the <italic>TP53</italic> locus led to co-amplification of the <italic>CDK4</italic> locus. Additionally, we observed recurring promoter swapping events involving the regulatory regions of the <italic>FRS2</italic>, <italic>PLEKHA5</italic>, and <italic>TP53</italic> genes. These events resulted in ectopic expression of partner genes, with the <italic>ELF1</italic> gene being upregulated by the <italic>FRS2</italic> and <italic>TP53</italic> promoter regions in two distinct cases.</p>",
        "doi": "10.1038/s41525-024-00430-y",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Unlocking epigenetics for precision treatment of Ewing’s sarcoma</article-title>",
        "abstract": "<p>Ewing’s sarcoma (EWS) is a highly aggressive malignant bone tumor primarily affecting adolescents and young adults. Despite the efficacy of chemoradiotherapy in some cases, the cure rate for patients with metastatic and recurrent disease remains low. Therefore, there is an urgent need for innovative therapeutic approaches to address the challenges associated with EWS treatment. Epigenetic regulation, a crucial factor in physiological processes, plays a significant role in controlling cell proliferation, maintaining gene integrity, and regulating transcription. Recent studies highlight the importance of abnormal epigenetic regulation in the initiation and progression of EWS. A comprehensive understanding of the intricate interactions between EWS and aberrant epigenetic regulation is essential for advancing clinical drug development. This review aims to provide a comprehensive overview of both epigenetic targets implicated in EWS, integrating various therapeutic modalities to offer innovative perspectives for the clinical diagnosis and treatment of EWS.</p>",
        "doi": "10.21147/j.issn.1000-9604.2024.03.08",
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>Personalized Medicine in Pancreatic Cancer: The Promise of Biomarkers and Molecular Targeting with Dr. Michael J. Pishvaian</article-title>",
        "abstract": "<p>Pancreatic cancer, with its increasing incidence, is predicted to become the second deadliest solid tumor by 2040, urging for improved diagnostic and treatment strategies. Despite advancements, the five-year survival rate is about 14%, decreasing further with metastasis. This review examines the potential of biomarkers for early detection, personalized treatment, and disease monitoring. Molecular classification based on genetic mutations and protein markers aids treatment decisions and improves outcomes. Ongoing clinical trials investigate targeted therapies like CLAUDIN 18.2 and Claudin 18.1 inhibitors. Next-generation sequencing (NGS) enables comprehensive genomic analysis, allowing tailored therapies. However, challenges include limited awareness and uptake of biomarker-guided therapies, necessitating continued research.</p> <p>Pancreatic cancer, with its alarming rising incidence, is predicted to become the second deadliest type of solid tumor by 2040, highlighting the urgent need for improved diagnostic and treatment strategies. Despite medical advancements, the five-year survival rate for pancreatic cancer remains about 14%, dropping further when metastasized. This review explores the promise of biomarkers for early detection, personalized treatment, and disease monitoring. Molecular classification of pancreatic cancer into subtypes based on genetic mutations, gene expression, and protein markers guides treatment decisions, potentially improving outcomes. A plethora of clinical trials investigating different strategies are currently ongoing. Targeted therapies, among which those against CLAUDIN 18.2 and inhibitors of Claudin 18.1, have shown promise. Next-generation sequencing (NGS) has emerged as a powerful tool for the comprehensive genomic analysis of pancreatic tumors, revealing unique genetic alterations that drive cancer progression. This allows oncologists to tailor therapies to target specific molecular abnormalities. However, challenges remain, including limited awareness and uptake of biomarker-guided therapies. Continued research into the molecular mechanisms of pancreatic cancer is essential for developing more effective treatments and improving patient survival rates.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title><italic>MDM2</italic> amplification in rod-shaped chromosomes provides clues to early stages of circularized gene amplification in liposarcoma</article-title>",
        "abstract": "<p id=\"Par1\">Well-differentiated liposarcoma (WDLS) displays amplification of genes on chromosome 12 (Chr12) in supernumerary ring or giant marker chromosomes. These structures have been suggested to develop through chromothripsis, followed by circularization and breakage-fusion-bridge (BFB) cycles. To test this hypothesis, we compared WDLSs with Chr12 amplification in rod-shaped chromosomes with WDLSs with rings. Both types of amplicons share the same spectrum of structural variants (SVs), show higher SV frequencies in Chr12 than in co-amplified segments, have SVs that fuse the telomeric ends of co-amplified chromosomes, and lack interspersed deletions. Combined with the finding of cells with transient rod-shaped structures in tumors with ring chromosomes, this suggests a stepwise process starting with the gain of Chr12 material that, after remodeling which does not fit with classical chromothripsis, forms a dicentric structure with other chromosomes. Depending on if and when telomeres from other chromosomes are captured, circularized or linear gain of 12q sequences will predominate.</p>",
        "doi": "10.1038/s42003-024-06307-1",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Transcriptome and single-cell analysis reveal disulfidptosis-related modification patterns of tumor microenvironment and prognosis in osteosarcoma</article-title>",
        "abstract": "<p id=\"Par1\">Osteosarcoma (OS) is the most common malignant bone tumor with high pathological heterogeneity. Our study aimed to investigate disulfidptosis-related modification patterns in OS and their relationship with survival outcomes in patients with OS. We analyzed the single-cell-level expression profiles of disulfidptosis-related genes (DSRGs) in both OS microenvironment and OS subclusters, and HMGB1 was found to be crucial for intercellular regulation of OS disulfidptosis. Next, we explored the molecular clusters of OS based on DSRGs and related immune cell infiltration using transcriptome data. Subsequently, the hub genes of disulfidptosis in OS were screened by applying multiple machine models. In vitro and patient experiments validated our results. Three main disulfidptosis-related molecular clusters were defined in OS, and immune infiltration analysis suggested high immune heterogeneity between distinct clusters. The in vitro experiment confirmed decreased cell viability of OS after ACTB silencing and higher expression of ACTB in patients with lower immune scores. Our study systematically revealed the underlying relationship between disulfidptosis and OS at the single-cell level, identified disulfidptosis-related subtypes, and revealed the potential role of ACTB expression in OS disulfidptosis.</p>",
        "doi": "10.1038/s41598-024-59243-9",
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Quality Control for Single Cell Analysis of High-plex Tissue Profiles using CyLinter</article-title>",
        "abstract": "<p id=\"P3\">Tumors are complex assemblies of cellular and acellular structures patterned on spatial scales from microns to centimeters. Study of these assemblies has advanced dramatically with the introduction of high-plex spatial profiling. Image-based profiling methods reveal the intensities and spatial distributions of 20-100 proteins at subcellular resolution in 10<sup>3</sup>–10<sup>7</sup> cells per specimen. Despite extensive work on methods for extracting single-cell data from these images, all tissue images contain artefacts such as folds, debris, antibody aggregates, optical aberrations and image processing errors that arise from imperfections in specimen preparation, data acquisition, image assembly, and feature extraction. We show that these artefacts dramatically impact single-cell data analysis, obscuring meaningful biological interpretation. We describe an interactive quality control software tool, CyLinter, that identifies and removes data associated with imaging artefacts. CyLinter greatly improves single-cell analysis, especially for archival specimens sectioned many years prior to data collection, such as those from clinical trials.</p>",
        "doi": "10.1101/2023.11.01.565120",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Tertiary lymphoid structures in cancer: immune mechanisms and clinical implications</article-title>",
        "abstract": "<p>Cancer is a major cause of death globally, and traditional treatments often have limited efficacy and adverse effects. Immunotherapy has shown promise in various malignancies but is less effective in tumors with low immunogenicity or immunosuppressive microenvironment, especially sarcomas. Tertiary lymphoid structures (TLSs) have been associated with a favorable response to immunotherapy and improved survival in cancer patients. However, the immunological mechanisms and clinical significance of TLS in malignant tumors are not fully understood. In this review, we elucidate the composition, neogenesis, and immune characteristics of TLS in tumors, as well as the inflammatory response in cancer development. An in‐depth discussion of the unique immune characteristics of TLSs in lung cancer, breast cancer, melanoma, and soft tissue sarcomas will be presented. Additionally, the therapeutic implications of TLS, including its role as a marker of therapeutic response and prognosis, and strategies to promote TLS formation and maturation will be explored. Overall, we aim to provide a comprehensive understanding of the role of TLS in the tumor immune microenvironment and suggest potential interventions for cancer treatment.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Aneuploidy and complex genomic rearrangements in cancer evolution</article-title>\n      ",
        "abstract": "<p id=\"P1\">Mutational processes that alter large genomic regions occur frequently in developing tumors. They range from simple copy number gains and losses to the shattering and reassembly of entire chromosomes. These catastrophic events, such as chromothripsis, chromoplexy and the formation of extrachromosomal DNA, affect the expression of many genes and therefore have a substantial impact on the fitness of the cells in which they arise. In this Review, we cover large genomic alterations, the mechanisms that cause them, and their impact on tumor development and evolution.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Analysis of cuproptosis-related genes in prognosis and immune infiltration in grade 4 diffuse gliomas</article-title>",
        "abstract": "<p>Grade 4 diffuse gliomas are highly malignant tumours with poor prognosis. Cuproptosis is a novel form of cell death. Cuproptosis genes are associated with various tumours and affect the prognosis of patients with these tumours. However, the relationship between cuproptosis and grade 4 diffuse gliomas remains unclear.</p> <p>Differentially expressed genes associated with cuproptosis in grade 4 diffuse gliomas were identified. Second, the prognostic model was established by univariate and multivariate COX regression analyses, and the genes (p &lt; 0.05) were selected for subsequent analysis. The endpoint of the study was death. Single-gene analysis was performed in accordance with the expression levels of SLC31A1. Third, based on the expression levels of SLC31A1, gene function enrichment, drug sensitivity, and immune cell infiltration analyses were performed. Finally, the expression and biological functions of SLC31A1 in grade 4 diffuse gliomas were identified using immunohistochemical staining, qRT-PCR, and related biological experiments.</p> <p>We identified six coproptosis genes in the grade 4 diffuse gliomas dataset (SLC31A1, PDHA1, GLS, FDX1, LIPT1, and ATP7B). The six key cuproptosis genes of grade 4 diffuse gliomas were analysed using univariate COX analysis. Basic patient data, including age, race, year of diagnosis, sex, and treatment, were included in the univariate COX analysis. Then, multivariate COX analysis was performed for the factors with p &lt; 0.2 in the univariate COX analysis. Age, year of diagnosis, and SLC31A1, PDHA1, and FDX1 levels were found to be independent prognostic factors. A nomogram was constructed using these 5 factors. Through experiments, we found that SLC31A1 had a higher expression level in cancer tissue than that near cancer among the three genes, SLC31A1, PDHA1, and FDX1; therefore, we focused on SLC31A1. According on the expression level of SLC31A1, we performed gene function enrichment, drug sensitivity, and immune cell infiltration analyses. Navitoclax was the most sensitive drug. Differential gene function enrichment was observed for metalloendopeptidase activity. SLC31A1 is expressed in dendritic cells, macrophages, neutrophils, and CD8+T cells. SLC31A1 is highly expressed in grade 4 diffuse gliomas, whereas SLC31A1 knockdown significantly reduces cell proliferation and mobility.</p> <p>Age, year of diagnosis, and SLC31A1, PDHA1, and FDX1 expression were independent prognostic factors. A nomogram was constructed based on age, year of diagnosis, and SLC31A1, PDHA1, and FDX1 levels. Through analysis and experimental verification, SLC31A1 was found to affect the prognosis and progression of patients with grade 4 diffuse gliomas and was associated with immune cell infiltration.</p>",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Integrative analysis of TROAP with molecular features, carcinogenesis, and related immune and pharmacogenomic characteristics in soft tissue sarcoma</article-title>\n        ",
        "abstract": "<p>Soft tissue sarcoma (STS) is an uncommon malignancy that often carries a grim prognosis. Trophinin‐associated protein (TROAP) is augmented in a variety of tumors and can affect tumor proliferation. Nevertheless, the prognostic value and specific functions of TROAP in STS are still vague. Herein, we display that TROAP exhibits an augmented trend in STS, and its elevation correlates with a poor prognosis of STS. Furthermore, its reduction is related to increased immune cell infiltration, enhanced stroma, and elevation of immune activation. Meanwhile, the TROAP‐derived genomic signature is validated to predict patient prognosis, immunotherapy, and drug response reliably. A nomogram constructed based on age, metastatic status, and a TROAP‐derived risk score of an STS individual could be used to quantify the survival probability of STS. In addition, in vitro experiments have demonstrated that TROAP is overexpressed in STS, and the downregulation of TROAP could affect the proliferation, migration, metastasis, and cell cycle of STS cells. In summary, the TROAP expression is elevated in STS tissues and cells, which is related to the poor prognosis and malignant biological behaviors of STS. It could act as a potential prognostic biomarker for diagnosis and treatment of STS.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Exportin 1 inhibition prevents neuroendocrine transformation through SOX2 down-regulation in lung and prostate cancers</article-title>\n      ",
        "abstract": "<p id=\"P4\">In lung and prostate adenocarcinomas, neuroendocrine (NE) transformation to an aggressive derivative resembling small cell lung cancer (SCLC) is associated with poor prognosis. We previously described dependency of SCLC on the nuclear transporter exportin 1. Here, we explored the role of exportin 1 in NE transformation. We observed up-regulated exportin 1 in lung and prostate pretransformation adenocarcinomas. Exportin 1 was up-regulated after genetic inactivation of TP53 and RB1 in lung and prostate adenocarcinoma cell lines, accompanied by increased sensitivity to the exportin 1 inhibitor selinexor in vitro. Exportin 1 inhibition prevented NE transformation in different TP53/RB1-inactivated prostate adenocarcinoma xenograft models that acquire NE features upon treatment with the aromatase inhibitor enzalutamide and extended response to the EGFR inhibitor osimertinib in a lung cancer transformation patient-derived xenograft (PDX) model exhibiting combined adenocarcinoma/SCLC histology. Ectopic SOX2 expression restored the enzalutamide-promoted NE phenotype on adenocarcinoma-to-NE transformation xenograft models despite selinexor treatment. Selinexor sensitized NE-transformed lung and prostate small cell carcinoma PDXs to standard cytotoxics. Together, these data nominate exportin 1 inhibition as a potential therapeutic target to constrain lineage plasticity and prevent or treat NE transformation in lung and prostate adenocarcinoma.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 1
    },
    {
        "title": "<article-title>FAM193A is a positive regulator of p53 activity</article-title>\n      ",
        "abstract": "<p id=\"P3\">Inactivation of the p53 tumor suppressor, either by mutations or through hyperactivation of repressors such as MDM2 and MDM4, is a hallmark of cancer. Although many inhibitors of the p53-MDM2/4 interaction have been developed, such as Nutlin, their therapeutic value is limited by highly heterogeneous cellular responses. We report here a multi-omics investigation of the cellular response to MDM2/4 inhibitors, leading to identification of FAM193A as a widespread regulator of p53 function. CRISPR screening identified FAM193A as necessary for the response to Nutlin. FAM193A expression correlates with Nutlin sensitivity across hundreds of cell lines. Furthermore, genetic codependency data highlight FAM193A as a component of the p53 pathway across diverse tumor types. Mechanistically, FAM193A interacts with MDM4, and FAM193A depletion stabilizes MDM4 and inhibits the p53 transcriptional program. Last, FAM193A expression is associated with better prognosis in multiple malignancies. Altogether, these results identify FAM193A as a positive regulator of p53.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Exosome-Based Liquid Biopsy Approaches in Bone and Soft Tissue Sarcomas: Review of the Literature, Prospectives, and Hopes for Clinical Application</article-title>\n      ",
        "abstract": "<p>The knowledge of exosome impact on sarcoma development and progression has been implemented in preclinical studies thanks to technological advances in exosome isolation. Moreover, the clinical relevance of liquid biopsy is well established in early diagnosis, prognosis prediction, tumor burden assessment, therapeutic responsiveness, and recurrence monitoring of tumors. In this review, we aimed to comprehensively summarize the existing literature pointing out the clinical relevance of detecting exosomes in liquid biopsy from sarcoma patients. Presently, the clinical utility of liquid biopsy based on exosomes in patients affected by sarcoma is under debate. The present manuscript collects evidence on the clinical impact of exosome detection in circulation of sarcoma patients. The majority of these data are not conclusive and the relevance of liquid biopsy-based approaches in some types of sarcoma is still insufficient. Nevertheless, the utility of circulating exosomes in precision medicine clearly emerged and further validation in larger and homogeneous cohorts of sarcoma patients is clearly needed, requiring collaborative projects between clinicians and translational researchers for these rare cancers.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Integrated Analysis of TME and Hypoxia Identifies a Classifier to Predict Prognosis and Therapeutic Biomarkers in Soft Tissue Sarcomas</article-title>\n      ",
        "abstract": "<p>Soft tissue sarcomas are uncommon and diverse solid tumors with high risks that have a poor prognosis. Tumor microenvironment (TME) and hypoxia play critical roles in tumor development. Therefore, we aimed to determine whether linking hypoxia-related parameters to TME cells could improve prognosis and treatment outcomes. The Hypoxia-TME classifier was first proposed by us using TCGA-SARC court (<italic toggle=\"yes\">n</italic> = 258) and fusion data from GSE63157 and GSE30929 (<italic toggle=\"yes\">n</italic> = 225). This classifier is capable of correctly classifying patients based on their prognosis and immune type. In addition, immunotherapy and chemotherapy programs were provided in a more specific manner. Several key genes were identified for future research as a result of the classification results.</p>\n         <p>Soft tissue sarcoma (STS) is one of the rarest but most aggressive cancer. It is important to note that intratumoral hypoxia and tumor microenvironment (TME) infiltration play a significant role in the growth and therapeutic resistance of STS. The goal of this study was therefore to determine whether linking hypoxia-related parameters to TME cells could provide a more accurate prediction of prognosis and therapeutic response. An analysis of 109 hypoxia-related genes and 64 TME cells was conducted in STS. Hypoxia-TME classifier was constructed based on 6 hypoxia prognostic genes and 8 TME cells. As a result, we evaluated the prognosis, tumor, and immune characteristics, as well as the effectiveness of therapies in Hypoxia-TME-defined subgroups. The Lowplus group showed a better prognosis and therapeutic response than any other subgroup. It is possible to unravel these differences based on immune-related molecules and somatic mutations in tumors. Further validation of Hypoxia-TME was done in an additional cohort of 225 STS patients. Additionally, we identified five key genes through differential analysis and RT-qPCR, namely, ACSM5, WNT7B, CA9, MMP13, and RAC3, which could be targeted for therapy. As a whole, the Hypoxia-TME classifier demonstrated a pretreatment predictive value for prognosis and therapeutic outcome, providing new approaches to therapy strategizing for patients.</p>\n        ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Cross-Talk of Multiple Types of RNA Modification Regulators Uncovers the Tumor Microenvironment and Immune Infiltrates in Soft Tissue Sarcoma</article-title>\n      ",
        "abstract": "<p>Soft-tissue sarcoma (STS) represents a rare and diverse cohort of solid tumors, and encompasses over 100 various histologic and molecular subtypes. In recent years, RNA modifications including m<sup>6</sup>A, m<sup>5</sup>C, m<sup>1</sup>A, and m<sup>7</sup>G have been demonstrated to regulate immune response and tumorigenesis. Nevertheless, the cross-talk among these RNA modification regulators and related effects upon the tumor microenvironment (TME), immune infiltrates, and immunotherapy in STS remain poorly understood.</p>\n         <p>In this study, we comprehensively investigated transcriptional and genetic alterations of 32 RNA modification regulators in STS patients from The Cancer Genome Atlas (TCGA) cohort and validated them in the Gene Expression Omnibus (GEO) cohort. Single-cell transcriptomes were introduced to identify regulators within specific cell types, with own sequencing data and RT-qPCR conducted for biological validation. Distinct regulator clusters and regulator gene subtypes were identified by using unsupervised consensus clustering analysis. We further built the regulator score model based on the prognostic regulator-related differentially expressed genes (DEGs), which could be used to quantitatively assess the risk for individual STS patients. The clinical and biological characteristics of different regulator score groups were further examined.</p>\n         <p>A total of 455 patients with STS were included in this analysis. The network of 32 RNA modification regulators demonstrated significant correlations within multiple different RNA modification types. Distinct regulator clusters and regulator gene subtypes were characterized by markedly different prognoses and TME landscapes. The low regulator score group in the TCGA-SARC cohort was characterized by poor prognosis. The robustness of the scoring model was further confirmed by the external validation in GSE30929 and GSE17674. The regulator score was negatively correlated with CD4+ T cell, Th2 cell, and Treg cell recruitment and most immunotherapy-predicted pathways, and was also associated with immunotherapy efficacy.</p>\n         <p>Overall, our study is the first to demonstrate the cross-talk of RNA modification regulators and the potential roles in TME and immune infiltrates in STS. The individualized assessment based on the regulator score model could facilitate and optimize personalized treatment.</p>\n        ",
        "doi": "10.3389/fimmu.2022.921223",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Immunologic constant of rejection signature is prognostic in soft-tissue sarcoma and refines the CINSARC signature</article-title>\n      ",
        "abstract": "<p>Soft-tissue sarcomas (STSs) are heterogeneous and aggressive tumors, with high metastatic risk. The immunologic constant of rejection (ICR) 20-gene signature is a signature of cytotoxic immune response. We hypothesized that ICR might improve the prognostic assessment of early-stage STS.</p>\n         <p>We retrospectively applied ICR to 1455 non-metastatic STS and searched for correlations between ICR classes and clinicopathological and biological variables, including metastasis-free survival (MFS).</p>\n         <p>Thirty-four per cent of tumors were classified as ICR1, 27% ICR2, 24% ICR3, and 15% ICR4. These classes were associated with patients’ age, pathological type, and tumor depth, and an enrichment from ICR1 to ICR4 of quantitative/qualitative scores of immune response. ICR1 class was associated with a 59% increased risk of metastatic relapse when compared with ICR2-4 class. In multivariate analysis, ICR classification remained associated with MFS, as well as pathological type and Complexity Index in Sarcomas (CINSARC) classification, suggesting independent prognostic value. A prognostic clinicogenomic model, including the three variables, was built in a learning set (n=339) and validated in an independent set (n=339), showing greater prognostic precision than each variable alone or in doublet. Finally, connectivity mapping analysis identified drug classes potentially able to reverse the expression profile of poor-prognosis tumors, such as chemotherapy and targeted therapies.</p>\n         <p>ICR signature is independently associated with postoperative MFS in early-stage STS, independently from other prognostic features, including CINSARC. We built a robust prognostic clinicogenomic model integrating ICR, CINSARC, and pathological type, and suggested differential vulnerability of each prognostic group to different systemic therapies.</p>\n        ",
        "doi": "10.1136/jitc-2021-003687",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Applications of High-Resolution Magic Angle Spinning MRS in Biomedical Studies II -- Human Diseases</article-title>\n      ",
        "abstract": "<p id=\"P1\">High-resolution magic angle spinning (HRMAS) magnetic resonance spectroscopy (MRS) is a powerful method for gaining insight into the physiological and pathological processes of cellular metabolism. Given its ability to obtain high resolution spectra of non-liquid biological samples, while preserving tissue architecture for subsequent histopathological analysis, the technique has become invaluable for biochemical and biomedical studies. Using HRMAS MRS, alterations in measured metabolites, metabolic ratios, and metabolomic profiles present the possibility to improve identification and prognostication of various diseases and decipher the metabolomic impact of drug therapies. In this review, we evaluate HRMAS MRS results on human tissue specimens from malignancies and non-localized diseases reported in the literature since the inception of the technique in 1996. We present the diverse applications of the technique in understanding pathological processes of different anatomical origins, correlations with <italic>in vivo</italic> imaging, effectiveness of therapies, and progress in the HRMAS methodology.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Advances in mass spectrometry imaging for spatial cancer metabolomics</article-title>\n      ",
        "abstract": "<p id=\"P1\">Mass spectrometry (MS) has become a central technique in cancer research. The ability to analyze various types of biomolecules in complex biological matrices makes it well suited for understanding biochemical alterations associated with disease progression. Different biological samples, including serum, urine, saliva, and tissues have been successfully analyzed using mass spectrometry. In particular, spatial metabolomics using MS imaging (MSI) allows the direct visualization of metabolite distributions in tissues, thus enabling in-depth understanding of cancer-associated biochemical changes within specific structures. In recent years, MSI studies have been increasingly used to uncover metabolic reprogramming associated with cancer development, enabling the discovery of key biomarkers with potential for cancer diagnostics. In this review, we aim to cover the basic principles of MSI experiments for the nonspecialists, including fundamentals, the sample preparation process, the evolution of the mass spectrometry techniques used, and data analysis strategies. We also review MSI advances associated with cancer research in the last 5 years, including spatial lipidomics and glycomics, the adoption of three-dimensional and multimodal imaging MSI approaches, and the implementation of artificial intelligence/machine learning in MSI-based cancer studies. The adoption of MSI in clinical research and for single-cell metabolomics is also discussed. Spatially resolved studies on other small molecule metabolites such as amino acids, polyamines, and nucleotides/nucleosides will not be discussed in the context.</p>\n      ",
        "doi": null,
        "pmid": null,
        "pmcid": null,
        "score": 2
    },
    {
        "title": "<article-title>Reduced lipolysis in lipoma phenocopies lipid accumulation in obesity</article-title>\n      ",
        "abstract": "<p id=\"Par1\">Elucidation of lipid metabolism and accumulation mechanisms is of paramount importance to understanding obesity and unveiling therapeutic targets. In vitro cell models have been extensively used for these purposes, yet, they do not entirely reflect the in vivo setup. Conventional lipomas, characterized by the presence of mature adipocytes and increased adipogenesis, could overcome the drawbacks of cell cultures. Also, they have the unique advantage of easily accessible matched controls in the form of subcutaneous adipose tissue (SAT) from the same individual. We aimed to determine whether lipomas are a good model to understand lipid accumulation.</p>\n         <p id=\"Par2\">We histologically compared lipomas and control SAT, followed by assessment of the lipidome using high-resolution <sup>1</sup>H NMR spectroscopy and ESI-IT mass spectrometry. RNA-sequencing was used to obtain the transcriptome of lipomas and the matched SAT.</p>\n         <p id=\"Par3\">We found a significant increase of small-size (maximal axis &lt; 70 µm) and very big (maximal axis &gt; 150 µm) adipocytes within lipomas. This suggests both enhanced adipocyte proliferation and increased lipid accumulation. We further show that there is no significant change in the lipid composition compared to matched SAT. To better delineate the pathophysiology of lipid accumulation, we considered two groups with different genetic backgrounds: (1) lipomas with <italic>HMGA2</italic> fusions and (2) without gene fusions. To reduce the search space for genes that are relevant for lipid pathophysiology, we focused on the overlapping differentially expressed (DE) genes between the two groups. Gene Ontology analysis revealed that DE genes are enriched in pathways related to lipid accumulation.</p>\n         <p id=\"Par4\">We show that the common shared lipid accumulation mechanism in lipoma is a reduction in lipolysis, with most gene dysregulations leading to a reduced cAMP in the adipocyte. Superficial lipomas could thus be used as a model for lipid accumulation through altered lipolysis as found in obese patients.</p>\n        ",
        "doi": "10.1038/s41366-020-00716-y",
        "pmid": null,
        "pmcid": null,
        "score": 3
    },
    {
        "title": "<article-title>Use of deep neural network ensembles to identify embryonic-fetal transition markers: repression of <italic>COX7A1</italic> in embryonic and cancer cells</article-title>\n      ",
        "abstract": "<p>Here we present the application of deep neural network (DNN) ensembles trained on transcriptomic data to identify the novel markers associated with the mammalian embryonic-fetal transition (EFT). Molecular markers of this process could provide important insights into regulatory mechanisms of normal development, epimorphic tissue regeneration and cancer. Subsequent analysis of the most significant genes behind the DNNs classifier on an independent dataset of adult-derived and human embryonic stem cell (hESC)-derived progenitor cell lines led to the identification of <italic>COX7A1</italic> gene as a potential EFT marker. <italic>COX7A1</italic>, encoding a cytochrome C oxidase subunit, was up-regulated in post-EFT murine and human cells including adult stem cells, but was not expressed in pre-EFT pluripotent embryonic stem cells or their <italic>in vitro</italic>-derived progeny. <italic>COX7A1</italic> expression level was observed to be undetectable or low in multiple sarcoma and carcinoma cell lines as compared to normal controls. The knockout of the gene in mice led to a marked glycolytic shift reminiscent of the Warburg effect that occurs in cancer cells. The DNN approach facilitated the elucidation of a potentially new biomarker of cancer and pre-EFT cells, the embryo-onco phenotype, which may potentially be used as a target for controlling the embryonic-fetal transition.</p>\n      ",
        "doi": "10.18632/oncotarget.23748",
        "pmid": null,
        "pmcid": null,
        "score": 3
    }
]