{
    "Part 1": [
        {
            "task_id": "Part 1-dry-experiment-1",
            "task_description": "Compile and log the selection criteria and clinical parameters for the liposarcoma samples.",
            "input": "Clinical data including patient age, sex, treatment history, tumor characteristics (tumor grade and immune cell infiltration status), and histological evaluation results. This data will be stored in a database or spreadsheet format.",
            "output": "A detailed summary table with columns for sample ID, type (frozen, paraffin, cell line), tumor grade, immune infiltration status, and source. This table will be utilized for reference in subsequent analyses and for the selection of samples for wet-lab experiments."
        },
        {
            "task_id": "Part 1-dry-experiment-2",
            "task_description": "Perform computational analysis of the immunohistochemical staining results to categorize immune infiltration status.",
            "input": "Immunohistochemical staining results data, including percentages of CD3, CD20, and CD68 positive cells from tissue samples. This data will be formatted in a CSV or Excel file for analysis.",
            "output": "A categorization report summarizing the immune infiltration status for each sample, indicating whether it meets the threshold of 30% positive cells. This report will provide insights into the immune microenvironment of the selected liposarcoma samples and will be used to guide further experimental design."
        }
    ],
    "Part 2": [
        {
            "task_id": "Part 2-dry-experiment-1",
            "task_description": "Download RNA sequencing data from specified public datasets.",
            "input": "List of dataset accession numbers (e.g., GSE202361, GSE205492, etc.) and their descriptions. Expected file formats include FASTQ files and count matrices.",
            "output": "Downloaded RNA sequencing data files in appropriate formats (e.g., FASTQ, count matrices) for each dataset, along with any relevant metadata files."
        },
        {
            "task_id": "Part 2-dry-experiment-2",
            "task_description": "Conduct quality control analysis on the downloaded RNA sequencing data using the FastQC tool.",
            "input": "Raw RNA sequencing data files in FASTQ format.",
            "output": "Quality control reports generated by FastQC, including metrics such as overall quality scores, presence of adapter sequences, GC content, number of reads, and percentage of duplicates. Any low-quality reads identified will also be documented."
        },
        {
            "task_id": "Part 2-dry-experiment-3",
            "task_description": "Normalize the RNA sequencing data using the TMM normalization method.",
            "input": "Raw counts of RNA sequencing data from all samples in a count matrix format.",
            "output": "Normalized count data and log-transformed data (log2 counts per million) suitable for downstream analysis, generated using the 'calcNormFactors' function from the edgeR package and the 'voom' function from the Limma package. The normalization factors will also be provided."
        },
        {
            "task_id": "Part 2-dry-experiment-4",
            "task_description": "Identify differentially expressed genes (DEGs) using the Limma package.",
            "input": "Normalized RNA sequencing count data and a design matrix for the experimental conditions, specifying the groups being compared.",
            "output": "List of differentially expressed genes in a CSV format, including associated statistics such as p-values and log2 fold changes. Visual representations (volcano plots and heatmaps) will be provided in PNG or PDF formats, summarizing the number of upregulated and downregulated genes."
        }
    ],
    "Part 3": [
        {
            "task_id": "Part 3-dry-experiment-1",
            "task_description": "Conduct Gene Ontology (GO) enrichment analysis using the identified differentially expressed genes (DEGs).",
            "input": "A named vector of differentially expressed genes (DEGs) derived from datasets GSE202361, GSE205492, and GSE161616, formatted as an R object with gene symbols as names.",
            "output": "Results of the GO enrichment analysis saved in a tab-delimited format. The output includes columns for enriched GO terms, p-values, adjusted p-values, and gene counts."
        },
        {
            "task_id": "Part 3-dry-experiment-2",
            "task_description": "Perform Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway analysis to identify key pathways involved in liposarcoma.",
            "input": "The same named vector of differentially expressed genes (DEGs) used in the GO analysis, formatted as an R object with gene symbols as names.",
            "output": "Results of the KEGG pathway analysis saved in a separate tab-delimited format. The output focuses on significant pathways and includes columns for pathway names, p-values, adjusted p-values, and gene counts. Citations for the KEGG database should be referenced."
        },
        {
            "task_id": "Part 3-dry-experiment-3",
            "task_description": "Generate visual representations of the GO analysis results.",
            "input": "Results from the GO enrichment analysis, specifically the top 10 enriched GO terms based on p-values, formatted as a data frame.",
            "output": "Bar plots showing the top 10 enriched GO terms with appropriate labels, legends, and color schemes. The plots will be saved in PNG format for visualization."
        },
        {
            "task_id": "Part 3-dry-experiment-4",
            "task_description": "Generate visual representations of the KEGG analysis results.",
            "input": "Results from the KEGG pathway analysis, specifically the top 10 enriched pathways with corresponding p-values and gene counts, formatted as a data frame.",
            "output": "Dot plots depicting the top 10 enriched pathways with appropriate labels, legends, and color schemes. The plots will be saved in PNG format for visualization."
        }
    ],
    "Part 4": [
        {
            "task_id": "Part 4-dry-experiment-1",
            "task_description": "Download single-cell sequencing data from publicly available datasets GSE191132 and GSE230773.",
            "input": "GSE191132 and GSE230773 dataset identifiers, with GSE191132 requiring raw data files containing cell barcodes, features, and expression matrix (in formats such as .csv or .txt), and GSE230773 needing the Read_counts.xlsx file (in Excel format).",
            "output": "Downloaded data files including cell barcodes, features, and expression matrix from GSE191132 (format: .csv/.txt) and gene expression data in Read_counts.xlsx format from GSE230773."
        },
        {
            "task_id": "Part 4-dry-experiment-2",
            "task_description": "Preprocess single-cell RNA sequencing data to ensure compatibility and quality.",
            "input": "Raw data from GSE191132 (cell barcodes, features, expression matrix) and Read_counts.xlsx from GSE230773, with parameters for filtering low-quality cells (threshold of < 200 detected genes and mitochondrial gene expression ratio > 10%).",
            "output": "Preprocessed single-cell RNA sequencing data (formatted as a standardized expression matrix) that is filtered for quality and compatible for further analysis."
        },
        {
            "task_id": "Part 4-dry-experiment-3",
            "task_description": "Normalize the preprocessed data using the SCTransform method or similar approaches.",
            "input": "Preprocessed single-cell RNA sequencing data (standardized expression matrix).",
            "output": "Normalized single-cell RNA sequencing data (output as a normalized expression matrix) that ensures comparability across samples, suitable for downstream analysis."
        },
        {
            "task_id": "Part 4-dry-experiment-4",
            "task_description": "Perform analysis of cell-type specific gene expression profiles using clustering algorithms.",
            "input": "Normalized single-cell RNA sequencing data (normalized expression matrix) and established marker gene lists for immune cell types (e.g., CD3 for T cells, CD19 for B cells, CD68 for macrophages).",
            "output": "Identified distinct cell populations within the immune microenvironment through clustering (using algorithms such as Louvain or K-means), along with annotated cell types based on marker gene expression profiles."
        },
        {
            "task_id": "Part 4-dry-experiment-5",
            "task_description": "Correlate findings from the single-cell analysis with bulk RNA sequencing data from GSE202361.",
            "input": "Single-cell RNA sequencing gene expression profiles (normalized expression matrix) and bulk RNA sequencing data from GSE202361 (bulk expression matrix).",
            "output": "Statistical correlation results (Pearson or Spearman coefficients) comparing gene expression profiles, along with identified shared genes and analyzed expression patterns indicative of immune cell presence or activity in the tumor microenvironment."
        },
        {
            "task_id": "Part 4-dry-experiment-6",
            "task_description": "Utilize integration methods to align single-cell and bulk RNA sequencing datasets.",
            "input": "Single-cell RNA sequencing data (normalized expression matrix) and bulk RNA sequencing data (bulk expression matrix), with integration methods like Seurat's integration workflow or Harmony.",
            "output": "Integrated dataset (output as a combined expression matrix) providing a comprehensive understanding of immune interactions in liposarcoma, ready for comparative analysis."
        },
        {
            "task_id": "Part 4-dry-experiment-7",
            "task_description": "Document the findings in a comparative analysis report.",
            "input": "Results from the previous analyses, including identified correlations, expression patterns, and integrated dataset.",
            "output": "A comparative analysis report (format: written document or presentation slides) highlighting significant correlations, potential therapeutic implications, and key findings from the data analysis."
        }
    ],
    "Part 5": [
        {
            "task_id": "Part 5-dry-experiment-1",
            "task_description": "Review transcriptomic analyses from datasets GSE202361, GSE205492, and GSE161616 to identify differentially expressed genes (DEGs) using bioinformatics tools.",
            "input": "Transcriptomic datasets GSE202361, GSE205492, and GSE161616; includes raw and processed gene expression data in formats such as CSV, TXT, or ExpressionSet objects. Additional input includes R scripts or software tools (e.g., DESeq2 or EdgeR) for differential expression analysis.",
            "output": "A structured table or chart listing identified key differentially expressed genes (DEGs), including PD-L1, CTLA4, and immune checkpoint-related long noncoding RNAs, along with their expression levels and statistical significance metrics (e.g., p-values, fold change)."
        },
        {
            "task_id": "Part 5-dry-experiment-2",
            "task_description": "Evaluate existing clinical trials related to identified DEGs using clinical trial registry data, focusing on PD-L1 and CTLA4.",
            "input": "Clinical trial registry data from platforms such as ClinicalTrials.gov; requires search filters for keywords related to PD-L1, CTLA4, and specific treatment protocols for sarcomas. Data should include trial phase, intervention details, and outcomes.",
            "output": "A comprehensive report summarizing clinical trials with metrics such as overall survival rates, progression-free survival, response rates, and treatment protocols, formatted in a structured document (e.g., Word or PDF)."
        },
        {
            "task_id": "Part 5-dry-experiment-3",
            "task_description": "Compile information on therapeutic implications based on transcriptomic findings and clinical trial evaluations, including proposed strategies.",
            "input": "Data collected from transcriptomic analyses and clinical trial evaluations, detailed descriptions of DEGs, and relevant literature on immune checkpoints and therapeutic strategies.",
            "output": "A comprehensive report outlining potential therapeutic implications and recommended strategies, including proposed combinations of immune checkpoint inhibitors and targeted therapies, supported by evidence from specific clinical trials."
        },
        {
            "task_id": "Part 5-dry-experiment-4",
            "task_description": "Propose hypotheses regarding the role of identified genes in immune evasion and therapy resistance, based on transcriptomic data.",
            "input": "Transcriptomic data from GSE202361 and GSE205492; relevant literature discussing the function of PD-L1, CTLA4, and associated pathways in immune modulation and signaling.",
            "output": "A document listing testable hypotheses regarding the contribution of identified genes to immune evasion and therapy resistance, with rationales supported by literature and transcriptomic evidence, formatted for clarity."
        },
        {
            "task_id": "Part 5-dry-experiment-5",
            "task_description": "Analyze data from clinical trials to identify gaps in current treatment strategies for liposarcoma, focusing on the role of immune checkpoints.",
            "input": "Clinical trial data from GSE202361 and GSE213065, including treatment protocols, outcomes, and patient demographics. Analysis may utilize statistical software for survival analysis (e.g., Kaplan-Meier curves).",
            "output": "An analytical report detailing identified gaps in treatment strategies, potential reasons for insufficient outcomes, and recommendations for future research directions, including hypotheses for new clinical studies targeting the identified pathways."
        }
    ]
}