{
    "Part 1": {
        "Part 1": "Patients and Samples",
        "step 1": {
            "implementation details": "Collect tumor and blood samples from patients diagnosed with well-differentiated or dedifferentiated liposarcoma. Ensure that samples are obtained with informed consent. Use aseptic techniques during sample collection to prevent contamination. Tumor samples should be obtained from surgical resections or biopsies, while blood samples should be collected in 10 mL EDTA tubes for plasma extraction. All samples must be stored at -80°C until further processing. Document the date and time of sample collection using a standardized form that records the patient's ID, the type of sample, and the collection date and time.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        1,
                        2
                    ]
                },
                "id2": {
                    "11626829": [
                        1,
                        2
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "Define inclusion and exclusion criteria for patient selection. Inclusion criteria: a) Confirmed diagnosis of well-differentiated or dedifferentiated liposarcoma via histopathological examination, b) Age ≥ 18 years, c) Patients who have not received prior systemic therapy or radiation treatment for the current tumor. Exclusion criteria: a) Active malignancies other than liposarcoma, b) Patients with severe comorbidities that may interfere with study participation. Record the reasons for exclusion for each patient using a tracking sheet.",
            "Reference Source": "Reference source for Step 2: 11657886, 11626829"
        },
        "step 3": {
            "implementation details": "Confirm the pathology of liposarcoma diagnosis. This will involve reviewing histology slides to confirm the subtype and staging of the tumor samples. Engage a board-certified pathologist to provide a definitive diagnosis. Document the tumor subtype (well-differentiated vs. dedifferentiated) and the staging according to the American Joint Committee on Cancer (AJCC) criteria. Utilize pathology reports to ensure accurate data collection and maintain a database for easy access to patient pathology information.",
            "Reference Source": "Reference source for Step 3: 11657886, 11626829"
        },
        "step 4": {
            "implementation details": "Collect clinical data from patient records. This includes: a) Demographics: age, sex, and ethnicity, b) Treatment history: previous surgical interventions, chemotherapy, and radiation, c) Clinical outcomes: overall survival (OS), disease-free survival (DFS), recurrence rates, and any adverse events during treatment. Use a standardized clinical data collection form to ensure data is collected uniformly and accurately.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        1,
                        2
                    ]
                },
                "id2": {
                    "11626829": [
                        1,
                        2
                    ]
                }
            }
        }
    },
    "Part 2": {
        "Part 2": "RNA Extraction and Library Preparation",
        "step 1": {
            "implementation details": "1. Collect tumor samples from patients diagnosed with well-differentiated or dedifferentiated liposarcoma. Ensure samples are flash-frozen immediately after resection and stored at -80°C until processing. 2. Thaw samples on ice and weigh approximately 30 mg of tumor tissue. 3. Add 1 ml of RLT buffer (from Qiagen RNeasy kit) to the tissue sample. 4. Homogenize the tissue using a tissue homogenizer or a rotor-stator system for 1-2 minutes until the sample is fully lysed. 5. Centrifuge the lysate at 12,000 x g for 3 minutes at room temperature to clear debris. 6. Transfer the supernatant to a new tube, discarding the pellet, and proceed to the RNA purification protocol as per the manufacturer's instructions. The expected yield of RNA should be assessed prior to library preparation, aiming for at least 100 ng of RNA for successful library construction. If yield is insufficient, repeat the extraction with fresh samples.",
            "Reference Source": {
                "id1": {
                    "8493074": [
                        1,
                        2,
                        3
                    ],
                    "11626829": [
                        1,
                        2,
                        3
                    ]
                },
                "id2": {
                    "11626829": [
                        1,
                        2,
                        3
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "1. Measure the RNA concentration using a spectrophotometer (e.g., NanoDrop) at 260 nm and assess purity using the A260/A280 ratio; a ratio between 1.8 and 2.1 indicates high-quality RNA. 2. Perform an integrity check of the RNA using a Bioanalyzer or similar device to ensure RNA quality with an RNA Integrity Number (RIN) of 7 or higher. 3. If RNA quality is insufficient, repeat the extraction process with fresh samples, optimizing the homogenization step if needed. 4. Document the quality and quantity results for each RNA sample for reference in downstream analysis, including the exact values obtained from the spectrophotometer and Bioanalyzer.",
            "Reference Source": "Qiagen RNeasy kit manual and Bioanalyzer user guide."
        },
        "step 3": {
            "implementation details": "1. Prepare the RNA library by first fragmenting the RNA using a fragmentation buffer at 94°C for 5-10 minutes. 2. Synthesize cDNA using a reverse transcription reaction with random hexamers and reverse transcriptase, using the following parameters: 0.5 µg of RNA, 200 U of reverse transcriptase, and appropriate buffer, incubating at 42°C for 60 minutes. 3. Clean the cDNA using a purification kit (e.g., Qiagen PCR Purification Kit) to remove excess primers and nucleotides. 4. Perform adapter ligation by adding specific adapters designed for sequencing (Illumina adapters) in a reaction volume of 20 µl at 20°C for 30 minutes. 5. Amplify the library using PCR with specific primers for 10-15 cycles, monitoring the amplification using qPCR. 6. Purify the amplified library using AMPure beads (1:1 ratio) to remove short fragments, ensuring the final library size is around 300-500 bp. 7. Document the yield and quality of the library post-amplification for reference in sequencing.",
            "Reference Source": {
                "id1": {
                    "8493074": [
                        4,
                        5,
                        6
                    ],
                    "11626829": [
                        4,
                        5,
                        6
                    ]
                },
                "id2": {
                    "11626829": [
                        4,
                        5,
                        6
                    ]
                }
            }
        },
        "step 4": {
            "implementation details": "1. Assess the quality and quantity of the final library using a Bioanalyzer to ensure size distribution is appropriate for sequencing (e.g., around 300-500 bp for Illumina sequencing). 2. Measure the concentration of the library using a Qubit fluorometer to ensure it meets the required concentration for sequencing (typically 2 nM). 3. Document the quality metrics, including size distribution and concentration values, and store the library at -20°C until ready for sequencing, ensuring it is protected from light and freeze-thaw cycles. 4. Prepare a summary of the expected outcomes at each step to guide researchers in assessing their progress.",
            "Reference Source": "Bioanalyzer user guide and Qubit fluorometer manual."
        }
    },
    "Part 3": {
        "Part 3": "RNA Sequencing Analysis",
        "step 1": {
            "implementation details": "I. Sequencing of prepared RNA libraries will be conducted using the Illumina NovaSeq 6000 platform. Each library will be loaded onto a flow cell, with a target concentration of 1.8 pM. Paired-end sequencing will be performed with a read length of 150 bp. The sequencing run should be monitored to ensure that the quality metrics (Q30) remain above 80% throughout the run. The sequencing depth should aim to achieve a minimum of 30 million reads per sample to ensure sufficient coverage for downstream analyses. Expected output format is FASTQ files, which will be generated for each sample.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        1,
                        2,
                        3
                    ]
                },
                "id2": {
                    "11626829": [
                        1,
                        2,
                        3
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "II. Quality control of raw sequencing data will be performed using FastQC version 0.11.9. Each sequencing output file (in FASTQ format) will be analyzed to assess the quality of reads, including metrics for per base sequence quality, per sequence quality scores, and GC content. A threshold of 20% of reads below Q20 will be set for further investigation. Any samples failing to meet this quality threshold will be flagged for re-evaluation. Expected output format is HTML reports generated by FastQC.",
            "Reference Source": "Reference source for Step 2: 11657886, 11626829"
        },
        "step 3": {
            "implementation details": "III. Alignment of the high-quality reads will be conducted using STAR aligner version 2.7.9a against the human reference genome (GRCh38.p13). The parameters for STAR alignment will include: --runThreadN 8 for parallel processing, --outFilterType BySJout to filter junction reads, and --outSAMtype BAM SortedByCoordinate for output format. The aligned BAM files will be sorted and indexed using SAMtools version 1.10. Gene expression levels will be quantified using featureCounts version 2.0.1, with parameters set for counting reads assigned to genes using the reference annotation file GTF (specific annotation file to be determined based on the dataset), specifying -p for paired-end reads. Expected output format is a count matrix in tab-delimited text format.",
            "Reference Source": "Reference source for Step 3: 11657886, 11626829"
        }
    },
    "Part 4": {
        "Part 4": "Differential Expression Analysis",
        "step 1": {
            "implementation details": "Identification of differentially expressed genes (DEGs) between well-differentiated liposarcoma (WDL) and dedifferentiated liposarcoma (DDL) using the DESeq2 package. Load the normalized count data from RNA sequencing datasets GSE247026 (SAR-096) and GSE184199. Ensure that the count data is formatted as a matrix with genes as rows and samples as columns. Designate the sample groups as 'WDL' for well-differentiated and 'DDL' for dedifferentiated based on the available metadata. Use the following parameters in DESeq2: 'design = ~ group', where 'group' is a factor indicating WDL or DDL status. Run the DESeq function with default parameters to estimate size factors and dispersion, setting a threshold for log2 fold change at |log2FC| > 1 for significant DEGs.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        1,
                        2
                    ],
                    "11626829": [
                        1,
                        2
                    ]
                },
                "id2": {
                    "11657886": [
                        1,
                        2
                    ],
                    "11452671": [
                        1,
                        2
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "Perform multiple comparisons adjustment using the Benjamini-Hochberg method on the results obtained from DESeq2. Extract the p-values from the DESeq2 results object and apply the 'p.adjust' function with method set to 'BH'. Set a significance threshold of adjusted p-values < 0.05 for identifying DEGs. Create a final list of DEGs that includes log2 fold changes, adjusted p-values, and base mean expression values for each gene, documenting any gene that meets the significance criteria.",
            "Reference Source": "Love, M.I., Huber, W., & Anders, S. (2014). Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biology, 15(12), 550."
        },
        "step 3": {
            "implementation details": "Correlate identified DEGs with clinical outcomes. Collect clinical data from study participants, including overall survival (OS), disease-free survival (DFS), and recurrence rates. Use survival analysis techniques, including Kaplan-Meier plots and log-rank tests, to assess the impact of DEGs on clinical outcomes. Create a survival object using the 'survival' package and fit a Cox proportional hazards model to identify DEGs that significantly affect OS and DFS. Summarize findings to document associations between specific DEGs and clinical outcomes, including hazard ratios and confidence intervals.",
            "Reference Source": "Therneau, T.M. & Grambsch, P.M. (2000). Modeling Survival Data: Extending the Cox Model. Springer."
        }
    },
    "Part 5": {
        "Part 5": "Functional Enrichment Analysis",
        "step 1": {
            "implementation details": "Perform Gene Ontology (GO) enrichment analysis on the list of differentially expressed genes (DEGs) identified in Part 4, specifically using the IDs of DEGs obtained from the analysis (e.g., DEG001, DEG002, etc.). Use the DAVID Bioinformatics Resources for this analysis. Input the DEGs as a gene list in DAVID, ensuring to select the correct species (Homo sapiens) and the background gene list to be the total number of genes in the genome. Set the significance threshold for GO terms at a p-value < 0.05. Collect and save the results, which typically include enriched GO terms under categories such as Biological Process, Cellular Component, and Molecular Function. Consider using additional sources like QuickGO or UniProt for cross-referencing GO terms.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        1,
                        2
                    ],
                    "11452671": [
                        1
                    ]
                },
                "id2": {
                    "11657886": [
                        1
                    ],
                    "11452671": [
                        1,
                        2
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "Conduct KEGG pathway enrichment analysis using the same set of DEGs, specifically utilizing the IDs from the DEG list. Utilize the KEGG database for this purpose. Input the DEGs and select the appropriate organism (Homo sapiens). Set the p-value threshold for significance at < 0.05. Download and save the enriched KEGG pathway results, which will indicate which biological pathways are significantly represented within the DEGs. If results are not satisfactory, consider using alternative databases like Reactome for additional insights.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        2,
                        3
                    ],
                    "11452671": [
                        2
                    ]
                },
                "id2": {
                    "11657886": [
                        2
                    ],
                    "11452671": [
                        2,
                        3
                    ]
                }
            }
        },
        "step 3": {
            "implementation details": "Perform Gene Set Enrichment Analysis (GSEA) on the DEGs to explore the enrichment of predefined gene sets relevant to liposarcoma. Utilize the GSEA software from the Broad Institute. Load the ranked list of genes based on their expression differences between well-differentiated and dedifferentiated liposarcoma, specifically referring to the expression values obtained in Part 4. Choose a gene set database appropriate for sarcoma research, such as MSigDB for cancer-related gene sets. Set the significance threshold at FDR < 0.25 and collect the results detailing which gene sets are significantly enriched and their associated statistics. Consider using additional statistical tools like Enrichr for further validation of GSEA results.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        3
                    ],
                    "11452671": [
                        3
                    ]
                },
                "id2": {
                    "11657886": [
                        3
                    ],
                    "11452671": [
                        3
                    ]
                }
            }
        },
        "step 4": {
            "implementation details": "Integrate the functional enrichment results (from GO, KEGG, and GSEA) with the clinical data collected in Part 1. Analyze correlations between enriched biological processes and pathways with clinical outcomes such as overall survival and disease-free survival using Cox regression models. Document the integration findings, highlighting any potential prognostic markers identified through this analysis. Ensure the clinical data is sufficiently detailed, including variables such as age, tumor stage, and treatment history, to enhance the robustness of the correlations.",
            "Reference Source": {
                "id1": {
                    "11657886": [
                        4
                    ],
                    "11452671": [
                        4
                    ]
                },
                "id2": {
                    "11657886": [
                        4
                    ],
                    "11452671": [
                        4
                    ]
                }
            }
        }
    },
    "Part 6": {
        "Part 6": "Statistical Analysis",
        "step 1": {
            "implementation details": "Conduct descriptive statistics on the clinical and gene expression data collected. For clinical data, calculate mean, median, standard deviation, and range for continuous variables such as age, tumor size, and survival times. For categorical variables such as tumor subtype (well-differentiated or dedifferentiated), report frequencies and percentages. For gene expression data, assess the distribution of expression levels for each gene using summary statistics (mean, median) and generate box plots to visually inspect for outliers and distributions. Input data will be sourced from 'GSE247026' for gene expression profiling and 'Clinical Data' for patient demographics and outcomes. Use R software for statistical analysis, particularly the 'dplyr' and 'ggplot2' packages for data manipulation and visualization, respectively.",
            "Reference Source": {
                "id1": {
                    "11626829": [
                        "step_1.1",
                        "step_1.2"
                    ],
                    "8493074": [
                        "step_1.3",
                        "step_1.4"
                    ]
                },
                "id2": {
                    "11626829": [
                        "step_1.5"
                    ],
                    "8493074": [
                        "step_1.6"
                    ]
                }
            }
        },
        "step 2": {
            "implementation details": "Perform inferential statistical tests to compare groups. For continuous variables, use unpaired t-tests to compare gene expression levels between well-differentiated and dedifferentiated liposarcoma samples. Verify assumptions of normality using the Shapiro-Wilk test (p < 0.05 indicates a violation of normality) and check for equal variances with Levene's test (p < 0.05 indicates unequal variances) before conducting the t-tests. For categorical variables, use chi-square tests to analyze the association between tumor subtype and clinical outcomes. Input data will be sourced from 'RNA-Seq Data from GSE247026' and 'Clinical Data'. Conduct these analyses using the 'stats' package in R, ensuring a significance threshold of p < 0.05.",
            "Reference Source": "Reference source for Step 2: 11626829, 8493074"
        },
        "step 3": {
            "implementation details": "Utilize Cox proportional hazards regression models to evaluate the effect of gene expression levels and clinical variables on overall survival and disease-free survival. Include relevant covariates such as age, tumor subtype, and treatment history. Assess the proportional hazards assumption using Schoenfeld residuals (p < 0.05 indicates a violation of the assumption). Report hazard ratios with 95% confidence intervals and p-values for each covariate. Use datasets 'GSE247026' for gene expression and 'Clinical Data' for survival outcomes. Perform these analyses using the 'survival' package in R, with a significance level set at p < 0.05.",
            "Reference Source": "Reference source for Step 3: 11626829, 8493074"
        }
    }
}