{
    "GEO": {
        "GSE247026": {
            "Status": "Public on Nov 09, 2023",
            "Title": "SAR-096: Phase II clinical trial of ribociclib in combination with everolimus in advanced dedifferentiated liposarcoma (DDL), and leiomyosarcoma (LMS)",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Purpose: DDL and LMS are two common subtypes of soft tissue sarcoma, a rare group of diseases for which new treatments are needed. Chemotherapy remains the standard option for advanced disease. Targeting CDK4/6 in DDL and mTOR in LMS is of biologic interest. When combined, the CDK4 inhibitor ribociclib and the mTOR inhibitor everolimus, have shown synergistic growth inhibition in multiple tumor models, suggesting that this combination could be beneficial in patients.Methods: This was a single arm, open label, multi-center phase II study of the combination of ribociclib and everolimus. Patients were enrolled into one of two cohorts: DDL or LMS with intact Rb. The primary endpoint was progression free rate (PFR) at 16 weeks. Secondary endpoints included progression free (PFS) and overall survival, safety and biomarker analyses. Results: In the DDL cohort, 33.3% (95% CI 15.6%-55.3%) of patients were progression free at 16 weeks. Median PFS in this cohort was 15.4 weeks (95% CI, 8-36 weeks) with 2 partial responses. In the LMS cohort the PFR at 16 weeks was 29.2% (95% CI 12.6%-51.1%). Median PFS in this cohort was 15.7 weeks (95% CI 7.7-NA). Most common toxicities included fatigue (66.7%), anorexia (43.8%) and hyperglycemia (43.8%). Concordance between Rb testing methodologies was poor.Conclusions: The combination of ribociclib and everolimus demonstrates activity in DDL with prolonged stable disease (≥16 weeks) meeting the primary endpoint. Notably partial responses were observed. The primary endpoint was not reached in the LMS cohort. The combination was well tolerated with expected side effects.",
            "Overall design": "We have collected total RNAs of sarcoma patient samples which are either responders or non-responders. We want to study the gene expression changes between the two groups.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM7882289": {
                    "link": "/geo/query/acc.cgi?acc=GSM7882289",
                    "name": "LMS_responder.0",
                    "Status": "Public on Nov 09, 2023",
                    "Title": "LMS_responder.0",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: leiomyosarcoma (LMS)cell type: sarcoma",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was extracted from FFPE tissue samples and RNA-seq was performed by Novogene (https://en.novogene.com) using the Illumina TrueSeq RNA exome pipeline.RNA sequence library was contructed using NEBNext Ultra II Directional RNA library prep kit.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "LMS_responder.0(S1.A_H_039)",
                    "Data processing": "Raw reads were aligned to hg38 genome using tophatCufflinks algorithm was implemented to assemble transcripts and estimate their abundance. Cuffdiff was used to statistically assess expression changes in quantified genes across different conditions.Supplementary files format and content: fpkm value in tab-delimited format",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE247026_Sample_genes_fpkm.xlsx",
                    "file_size": "5.3 Mb",
                    "file_type": "XLSX",
                    "download_link": "/geo/download/?acc=GSE247026&format=file&file=GSE247026%5FSample%5Fgenes%5Ffpkm%2Exlsx"
                }
            ],
            "search_query": "gene expression AND dedifferentiated liposarcoma"
        },
        "GSE243759": {
            "Status": "Public on Sep 25, 2023",
            "Title": "Antitumor effects of PRMT5 inhibition in sarcomas",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "Patients with advanced soft-tissue sarcomas (STSs) have few therapeutic options. Protein arginine methyltransferase 5 (PRMT5), an anticancer target, has been extensively investigated in recent years in epithelial tumors. To date, no data related to the biological role of PRMT5 inhibition and its potential effect as a treatment in STS have been reported.  To investigate the therapeutic potential of PRMT5 targeting in STS, we first evaluated the prognostic value of PRMT5 expression in 2 different cohorts of patients with STS. We then used the potent and selective GSK3326595 (GSK595) compound to investigate the antitumor effect of the pharmacological inhibition of PRMT5 in vitro via MTT, apoptosis, cell cycle, clonogenicity and proliferation assays. In vivo studies were performed with two animal models to evaluate the effects of GSK595 on tumor growth. The mechanisms of action were investigated by RNA sequencing, metabolic pathway analysis, Western blotting and glucose uptake/lactate production assays.  High PRMT5 gene expression levels were significantly associated with worsened metastasis-free survival of STS patients. GSK595 decreased the global symmetric dimethylarginine level, the proliferation rate and clonogenicity of STS cell lines in vitro and tumor growth in vivo. Moreover, PRMT5 inhibition regulated aerobic glycolysis through downregulation of key enzymes of glycolysis as well as glucose uptake and lactate production.  The present study demonstrated that PRMT5 regulates STS cell metabolism and thus represents a potential therapeutic target for STS. Additional studies in diverse sarcoma subtypes will be essential to confirm and expand upon these findings.",
            "Overall design": "To decipher the mechanism of action of PRMT5 inhibition in STS cell lines, four sarcoma cell lines (the IB111, IB114, IB115, and IB128 cells) were untreated or treated with GSK595 at IC80 every 3 days for 10 days and RNA were analyzed by Nanostring assay using an nCounter Metabolic Pathways Panel in the nCounter Max Analyzer.",
            "Platforms": "Platforms (1), GPL31904, NanoString  nCounter Human  Metabolic Pathways Panel [Gene Symbol version]",
            "Samples": {
                "GSM7795419": {
                    "link": "/geo/query/acc.cgi?acc=GSM7795419",
                    "name": "IB111 cell line, Control, rep1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM7795419_20211109_31020962105_run2_IB111_n1_ctl_07.RCC.gz",
                            "file_size": "8.7 Kb",
                            "file_type": "RCC",
                            "download_link": "/geo/download/?acc=GSM7795419&format=file&file=GSM7795419%5F20211109%5F31020962105%5Frun2%5FIB111%5Fn1%5Fctl%5F07%2ERCC%2Egz"
                        }
                    ],
                    "Status": "Public on Sep 25, 2023",
                    "Title": "IB111 cell line, Control, rep1",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell type: dedifferentiated liposarcoma",
                    "Treatment protocol": "Cells were untreated or treated with GSK595 at their respective IC80 every 3 days for 10 days",
                    "Growth protocol": "Cells were maintained in RPMI medium 1640 GlutaMAX Supplement in the presence of 10% fetal bovine serum and 1% penicillin/streptomycin at 37°C in a humidified atmosphere containing 5% CO2",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "RNA was extracted using an RNeasy Plus Mini Kit (Qiagen). The purity and concentration of the isolated RNA were determined with a NanoDrop spectrophotometer, and capillary electrophoresis using a Bioanalyzer 2100 was carried out to determine the RNA integrity number (RIN).",
                    "Data processing": "Raw gene expression was normalized using the RUVseq pipeline, and differential gene expression was analyzed using Deseq2 (v1.28). Pathway scoring was performed on normalized data using the single-sample GSEA method (ConsensusTME 0.0.1.9), and differences between vehicle and treated samples were evaluated for significance using Wilcoxon tests",
                    "Platform ID": "GPL31904"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE243759_RAW.tar",
                    "file_size": "230.0 Kb",
                    "file_type": "TAR (of RCC)",
                    "download_link": "/geo/download/?acc=GSE243759&format=file"
                }
            ],
            "search_query": "gene expression AND dedifferentiated liposarcoma"
        },
        "GSE241225": {
            "Status": "Public on Aug 23, 2023",
            "Title": "Gene expression at single cell level of untreated and 10 day palbociclib treated LS8817 cells",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Orthoganally complementing our RNA-seq (GSE241031) efforts to define transcriptional changes over time in LS8817(TetOnFMDM2) cells as they progressed from quiesence to senescence, we chose to look at gene expression in unperturbed parental and 10 day palbociclib treated LS8817 parental cells",
            "Overall design": "Asynchronously growing LS8817 cells were treated with 1 uM palbociclib and cultured for 10 days with media changes every three days.  Treated cells and untreated asynchronouysly growing cells were collected at that time and subjected to single cell RNA seq",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM7719735": {
                    "link": "/geo/query/acc.cgi?acc=GSM7719735",
                    "name": "LS8817 cycling replicate 1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM7719735_8817_CTRL_01_filtered_feature_bc_matrix.h5",
                            "file_size": "27.7 Mb",
                            "file_type": "H5",
                            "download_link": "/geo/download/?acc=GSM7719735&format=file&file=GSM7719735%5F8817%5FCTRL%5F01%5Ffiltered%5Ffeature%5Fbc%5Fmatrix%2Eh5"
                        }
                    ],
                    "Status": "Public on Aug 23, 2023",
                    "Title": "LS8817 cycling replicate 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: cell linecell line: LS8817cell type: dedifferentiated liposarcomagenotype: wild typetreatment: none",
                    "Treatment protocol": "asynchronously growing cells were treated with 1 uM palbociclib and media replaced every three days",
                    "Growth protocol": "cells were grown in DME supplemented with 10% fetal bovine serum, 2 mM glutamine, and penicillin and streptomycin at 37C in 5% CO2",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Cells were collected by trypsinization and suspensions prepared according to guidelines from 10X genomics.  Suspensions were adjusted to a concentration of 1000 cells per microliter and loaded to one capture well to obtain 10,000 cells.Construction of the library was perfomed according to manufacturers instructions.  10X genomics libfraries were prepared using v3 chemistryLibraries were sequenced to an average of 23000 reads per cell quantifying expression for a median of 1509 and 2733 transcripts per cell for palbociclib treated and control, respectively",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "10X genomics",
                    "Data processing": "The demultiplexing, barcoded processing, gene counting, and aggregation were made using Cellranger v3.0.2Sequence reads were aligned to GRCH37/hg19 human genome reference using STAR as implemented in the Cellranger v3.0.2 pipelineThe resulting BAM file was analyzed with velocyto to obtain read counts.  Merged treatment and control spliced read counts were used for clustering with Seurat implementing the SCTransform pipeline with 20 dimensions.Differential expression analysis between cell samples, trated and control, were carried out with Monocle3, excluding high mitochondrial clusters.Assembly: alignment was made to GRCh37/hg19 human genome reference using STARSupplementary files format and content: HDF format values containing gene read-count matrices for treatment and controlSupplementary files format and content: .RDA file containing final seurat object",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE241225_RAW.tar",
                    "file_size": "45.4 Mb",
                    "file_type": "TAR (of H5)",
                    "download_link": "/geo/download/?acc=GSE241225&format=file"
                },
                {
                    "file_name": "GSE241225_vc8817.rda.gz",
                    "file_size": "1.3 Gb",
                    "file_type": "RDA",
                    "download_link": "/geo/download/?acc=GSE241225&format=file&file=GSE241225%5Fvc8817%2Erda%2Egz"
                }
            ],
            "search_query": "gene expression AND dedifferentiated liposarcoma"
        },
        "GSE221494": {
            "Status": "Public on Jul 22, 2024",
            "Title": "Cellular origin and clonal evolution of human dedifferentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "This SuperSeries is composed of the SubSeries listed below.",
            "Overall design": "Refer to individual Series",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6876457": {
                    "link": "/geo/query/acc.cgi?acc=GSM6876457",
                    "name": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Status": "Public on Jul 22, 2024",
                    "Title": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: DDLPS_DDage at_diagnosis: 42Sex: Flocation: retroperitoneumtumour size_(mm): 380tumour grade: 2",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Total RNAs were extracted using the Trizol reagent and dosed. 1 ug of total RNA was used for the construction of sequencing libraries.RNA libraries for RNA-seq were prepared using SMARTER mRNA-Seq Library Prep Kit following manufacturer's protocols.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "FastQC (v0.11.8 or v0.11.9 according to sample) and trimming with TrimGalore (v0.6.2) or Altropos according to sample, default optionsSTAR (v2.6.1a_08-27), Picard MarkDuplicates (v2.18.14) and Cufflinks (v2.2.1), default optionsTPM-normalization of raw read counts generated by STAR (1)log2-transformation of FPKM from Cufflinks with pseudo-count +2 and normalization between samples with limma in quantil mode (2)Assembly: GRCh38Supplementary files format and content: Tab-delimited text files containing raw counts generated by STAR and corresponding TPM-normalized or FPKM-normalized counts",
                    "Platform ID": "GPL24676"
                }
            },
            "search_query": "dedifferentiated AND liposarcoma"
        },
        "GSE221493": {
            "Status": "Public on Jul 22, 2024",
            "Title": "Cellular origin and clonal evolution of human dedifferentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Dedifferentiated liposarcoma (DDLPS) is the most frequent high-grade soft tissue sarcoma subtype. It is characterized by a component of undifferentiated tumor cells coexisting with a component of well-differentiated adipocytic tumor cells. Both dedifferentiated (DD) and well-differentiated (WD) components exhibit MDM2 amplification, however their cellular origin remains elusive. Using single-cell RNA sequencing and functional assays in paired WD and DD components from primary DDLPS tumors, we characterized the cellular heterogeneity of DDLPS tumor and micro-environment. We identified a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue. We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution. Last, we show that DD tumor cells keep important biological properties of ASC including pluripotency and that their adipogenic properties are inhibited by a TGF-β high immunosuppressive tumor micro-environment.",
            "Overall design": "Primary DDLPS, WDLPS, liposarcoma and peritumoral fat tissue of untreated patients were isolated and analyzed using scRNAseq.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6876510": {
                    "link": "/geo/query/acc.cgi?acc=GSM6876510",
                    "name": "Tumor patient 1 (DDLPS_WD), scRNAseq",
                    "Status": "Public on Jul 22, 2024",
                    "Title": "Tumor patient 1 (DDLPS_WD), scRNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: DDLPS_WDage at_diagnosis: 42Sex: Flocation: retroperitoneumtumour size_(mm): 380tumour grade: 2",
                    "Treatment protocol": "NANA",
                    "Growth protocol": "NA",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Fresh tumor samples were cut in small pieces then dissociated 30 min at 37C in CO2-independent medium (Gibco) containing 150 mg/ml of Liberase TL (Roche) and DNase 1 (Sigma Aldrich). Dissociated cells were then filtered with a cell strainer and washed in PBS. Debris were removed by centrifugation (3,000 xg for 10 min at 4C), using the debris removal solution (Miltenyi Biotech). Cells were then resuspended in PBS, counted and adjusted at 10⁶ cells/ml. 6,000 cells were loaded on a 10X Chromium (10X Genomics) and libraries were prepared using a Single Cell 30 Reagent Kit (NextGem kit, 10X Genomics), according to the manufacturer’s protocol, targeting 3,000 recovered cells per cell type and sample. Libraries were sequenced on an Illumina NovaSeq 6000 sequencing platform.Library was performed according to the manufacter’s instructions (single cell 3’ v2 protocol, 10x Genomics). Briefly, GCs were resuspended in the master mix and loaded together with partitioning oil and gel beads into the chip to generate the gel bead-in-emulsion (GEM). The poly-A RNA from the cell lysate contained in every single GEM was retrotranscripted to cDNA, which contains an Ilumina R1 primer sequence, Unique Molecular Identifier (UMI) and the 10x Barcode. The pooled barcoded cDNA was then cleaned up with Silane DynaBeads, amplified by PCR and the apropiated sized fragments were selected with SPRIselect reagent for subsequent library construction. During the library construction Ilumina R2 primer sequence, paired-end constructs with P5 and P7 sequences and a sample index were added.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic single cell",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "10x Genomics",
                    "Data processing": "Alignment with cellranger (v3.0.0 to v6.0.0 according to sample), default optionsAmbient RNA correction with SoupX v1.5.2Doublet removal with DoubletFinder (v2.0.3), scDblFinder (v1.4.0) and scds (v1.6.0) in hybrid mode, default options, union of the three methodsRemove cells with more than 20% of reads mapping mitochondrial genesApply additional coverage based filters to remove low quality cellsNormalization and downstream analysis with Seurat v4.0.1Assembly: GRCh38Supplementary files format and content: Tab-delimited text and MatrixMarket files containing raw counts generated by CellRanger and corresponding normalized counts generated by Seurat v3",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_barcodes.tsv.gz",
                    "file_size": "2.6 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Fbarcodes%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_barcodes_only.tsv.gz",
                    "file_size": "513.4 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Fbarcodes%5Fonly%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_features.tsv.gz",
                    "file_size": "274.9 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Ffeatures%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_normalized_counts_matrix.mtx.gz",
                    "file_size": "527.2 Mb",
                    "file_type": "MTX",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fnormalized%5Fcounts%5Fmatrix%2Emtx%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_raw_counts_barcodes.tsv.gz",
                    "file_size": "513.4 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fraw%5Fcounts%5Fbarcodes%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_raw_counts_features.tsv.gz",
                    "file_size": "231.4 Kb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fraw%5Fcounts%5Ffeatures%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221493_sc_LPS_atlas_raw_counts_matrix.mtx.gz",
                    "file_size": "551.3 Mb",
                    "file_type": "MTX",
                    "download_link": "/geo/download/?acc=GSE221493&format=file&file=GSE221493%5Fsc%5FLPS%5Fatlas%5Fraw%5Fcounts%5Fmatrix%2Emtx%2Egz"
                }
            ],
            "search_query": "well-differentiated AND liposarcoma"
        },
        "GSE221492": {
            "Status": "Public on Jul 22, 2024",
            "Title": "Cellular origin and clonal evolution of human dedifferentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Dedifferentiated liposarcoma (DDLPS) is the most frequent high-grade soft tissue sarcoma subtype. It is characterized by a component of undifferentiated tumor cells coexisting with a component of well-differentiated adipocytic tumor cells. Both dedifferentiated (DD) and well-differentiated (WD) components exhibit MDM2 amplification, however their cellular origin remains elusive. Using single-cell RNA sequencing and functional assays in paired WD and DD components from primary DDLPS tumors, we characterized the cellular heterogeneity of DDLPS tumor and micro-environment. We identified a population of tumor adipocyte stem cells (ASC) showing striking similarities with adipocyte stromal progenitors found in white adipose tissue. We show that tumor ASC harbor the ancestral genomic alterations of WD and DD components, suggesting that both derive from these progenitors following clonal evolution. Last, we show that DD tumor cells keep important biological properties of ASC including pluripotency and that their adipogenic properties are inhibited by a TGF-β high immunosuppressive tumor micro-environment.",
            "Overall design": "Primary DDLPS, WDLPS, liposarcoma and peritumoral fat tissue of untreated patients were isolated and analyzed using RNAseq.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6876457": {
                    "link": "/geo/query/acc.cgi?acc=GSM6876457",
                    "name": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Status": "Public on Jul 22, 2024",
                    "Title": "Tumor patient 1 (DDLPS_DD), RNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: DDLPS_DDage at_diagnosis: 42Sex: Flocation: retroperitoneumtumour size_(mm): 380tumour grade: 2",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Total RNAs were extracted using the Trizol reagent and dosed. 1 ug of total RNA was used for the construction of sequencing libraries.RNA libraries for RNA-seq were prepared using SMARTER mRNA-Seq Library Prep Kit following manufacturer's protocols.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "FastQC (v0.11.8 or v0.11.9 according to sample) and trimming with TrimGalore (v0.6.2) or Altropos according to sample, default optionsSTAR (v2.6.1a_08-27), Picard MarkDuplicates (v2.18.14) and Cufflinks (v2.2.1), default optionsTPM-normalization of raw read counts generated by STAR (1)log2-transformation of FPKM from Cufflinks with pseudo-count +2 and normalization between samples with limma in quantil mode (2)Assembly: GRCh38Supplementary files format and content: Tab-delimited text files containing raw counts generated by STAR and corresponding TPM-normalized or FPKM-normalized counts",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE221492_bulk_LPS_atlas_TPM_counts_matrix.tsv.gz",
                    "file_size": "11.8 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221492&format=file&file=GSE221492%5Fbulk%5FLPS%5Fatlas%5FTPM%5Fcounts%5Fmatrix%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221492_bulk_LPS_atlas_log2_FPKM_counts_matrix.tsv.gz",
                    "file_size": "2.6 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221492&format=file&file=GSE221492%5Fbulk%5FLPS%5Fatlas%5Flog2%5FFPKM%5Fcounts%5Fmatrix%2Etsv%2Egz"
                },
                {
                    "file_name": "GSE221492_bulk_LPS_atlas_raw_counts_matrix.tsv.gz",
                    "file_size": "2.4 Mb",
                    "file_type": "TSV",
                    "download_link": "/geo/download/?acc=GSE221492&format=file&file=GSE221492%5Fbulk%5FLPS%5Fatlas%5Fraw%5Fcounts%5Fmatrix%2Etsv%2Egz"
                }
            ],
            "search_query": "well-differentiated AND liposarcoma"
        },
        "GSE202361": {
            "Status": "Public on Jan 01, 2024",
            "Title": "Neoadjuvant immune checkpoint blockade in retroperitoneal dedifferentiated liposarcoma and extremity/trunk undifferentiated pleomorphic sarcoma (NCT03307616)",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Recent evidence suggests that immune checkpoint blockade (ICB) has some activity in metastatic dedifferentiated liposarcoma (DDLPS) and undifferentiated pleomorphic sarcoma (UPS). We conducted a randomized, non-comparative phase 2 trial (NCT03307616) of nivolumab or nivolumab/ipilimumab in patients with resectable retroperitoneal DDLPS (n=17) and extremity/truncal UPS (n=10), with UPS patients receiving concurrent radiation therapy. The primary endpoint of pathologic response as assessed by percent hyalinization was observed to be a median of 8.8% in DDLPS patients and 89% in UPS patients and similar in nivolumab and ipilimumab/nivolumab arms in both cohorts . Higher intratumoral densities of T-regulatory cells were associated with absence of pathologic response (hyalinization<30%). Tumor infiltration by B-cells was associated with higher densities of T-regulatory cells before treatment;  this association was lost upon ICB treatment. Our data demonstrate that neoadjuvant ICB with concurrent radiation may have significant efficacy in UPS and is associated complex immune changes in the tumor microenvironment in DDLPS and UPS.",
            "Overall design": "Tumor samples were collected at baseline, on treatment and at surgery for all patients, and analyzed using bulk RNA sequencing.",
            "Platforms": "Platforms (1), GPL24676, Illumina NovaSeq 6000 (Homo sapiens)",
            "Samples": {
                "GSM6111908": {
                    "link": "/geo/query/acc.cgi?acc=GSM6111908",
                    "name": "Sarcoma tumor tissue, Sample 1",
                    "Status": "Public on Jan 01, 2024",
                    "Title": "Sarcoma tumor tissue, Sample 1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: Sarcoma tumor tissuedisease state: Soft-Tissue Sarcomatreatment: Immune checkpoint blockadecollected date: 12-05-2017collected: baselineage: 49Sex: Moutcome: PDgrade: High Grade",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "RNA was extracted by NORGEN Total RNA Purification Kit (Cat. 37500) (NORGEN BIOTEK CORP). The extracted RNA was treated with DNase I. The treated RNA then was cleaned-up using the AMPure XP beads (Beckman Coulter Life Sciences) and eluted into 1x TE buffer. The purified RNA was quantified using Quant-iT™ RiboGreen™ RNA Assay Kit (ThermoFisher SCIENTIFIC) and the RNA quality was accessed using Agilent RNA 6000 Nano Kit and the 2100 Bioanalyzer Instrument (Agilent Technologies).Up to 200 ng of each cDNA sample based on the PicoGreen quantification was sheared (mechanically fragmented) using the E220 Focused-ultrasonicator Covaris (Covaris). The sonication was performed under the following conditions: Peak Incident Power 200, Duty Cycle 25%, Cycles per Burst 50, and duration 10 seconds for 120 iterations. To ensure the proper fragment size, samples were examined on TapeStation 4200 using the DNA High Sensitivity kit (Agilent Technologies). The sheared cDNA was proceeded to library preparation using SureSelect XT Low Input Reagent Kit with indexes 1-96 (Agilent Technologies) as automated method on the Sciclone G3 NGSx Workstation (PerkinElmer, Inc.).This protocol consists of 3 enzymatic reactions for end repair, A-tailing and Adaptor ligation, followed by barcode insertion by PCR using Herculase II Fusion DNA Polymerase (8 to 14 cycles, based on input DNA quality and quantity). PCR primers were removed by using 1x volume of Agencourt AMPure PCR Purification kit (Agencourt Bioscience Corporation). The quality and quantity of the prepared libraries were evaluated using TapeStation 4200 and the DNA High Sensitivity kit (Agilent Technologies) to verify correct fragment size and to ensure complete removal of primer dimers.",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Data processing": "Raw RNA sequencing reads of the samples were mapped to the hg19 reference genome using the STAR aligner.RSEM was used to quantify aligned reads and produce raw counts of known transcriptsThe raw count of transcripts in the samples were then converted to transcripts per million that normalize counts for library size and gene length.Assembly: hg19Supplementary files format and content: rawcounts and TPMs",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE202361_AllSamples_TPM.txt.gz",
                    "file_size": "3.5 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE202361&format=file&file=GSE202361%5FAllSamples%5FTPM%2Etxt%2Egz"
                },
                {
                    "file_name": "GSE202361_AllSamples_rawcount.txt.gz",
                    "file_size": "2.9 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE202361&format=file&file=GSE202361%5FAllSamples%5Frawcount%2Etxt%2Egz"
                }
            ],
            "search_query": "dedifferentiated AND liposarcoma"
        },
        "GSE201056": {
            "Status": "Public on Mar 03, 2023",
            "Title": "Integrated epigenomic analysis identifies structural alterations associated with oncogenic gene expression in liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencingGenome binding/occupancy profiling by high throughput sequencingOther",
            "Summary": "Liposarcoma (LPS) is the most common soft-tissue sarcoma in adults. The two most frequent subtypes well differentiated (WD) and dedifferentiated (DD) LPS are often marked with the giant chromosome and the amplifications of chromosome 12q13-15. However, it remains unknown how this genomic aberrancy contributes to the dysregulation of the oncogenes. Here, we reported a comprehensive molecular characterization of both tumor and normal tissues from the same batch of LPS patients, including Hi-C, H3K27ac ChIP-seq, RNA-seq and WGS datasets. We identified a library of tumor-specific enhancers that may play a critical role in oncogenesis. We also demonstrated the enhancer co-amplification and hijacking events involved with proto-oncogenes such as MDM2, CDK4 and HMGA2, which have not been previously reported and as a novel mechanism to upregulate these genes. By combining Hi-C, optical mapping, Nanopore long reads and WGS data, we partially resolved complex structure variations (SVs) and reconstructed the local genome and the giant chromosome. We further validated the presence of multiple copies of  MDM2 and CDK4 are located on the giant chromosome by fluorescent in situ hybridization (FISH). Consequently, this study provides a comprehensive resource for further research in LPS.",
            "Overall design": "We started with 5 pairs of WD-LPS, 14 pairs of DD-LPS patient samples, and 1 DD-LPS cell line. Each pair of patient samples contains one tumor tissue and one matched peritumoral tissue as control. To profile the transcribed regions and to reveal the differential transcriptomes between tumors and peritumoral tissues, we performed mRNA sequencing (mRNA-seq) in all patient samples and cell lines. In 4 pairs of DD-LPS patient samples (P241, P298, P69 and P209) and 1 DD-LPS cell line (Lipo863B), we performed 1) chromatin immunoprecipitation followed by DNA-seq (ChIP-seq) for histone modifications H3 lysine 27 acetylation (H3K27ac), to chart the open chromatin regions and DD-LPS-specific regulatory elements, such as enhancers; 2) Hi-C experiments to study high-order chromatin structure and link distal enhancers to their target genes; 3) whole genome sequencing (WGS) to profile CNVs and dissect genome rearrangements. To better reveal the sequence details of genome rearrangements, we performed Nanopore long-read sequencing and BioNano optical mapping in Lipo863B cells to help assemble the rearranged regions. In total, we generated 71 genomic datasets, including 62 for the patient tissue samples and 9 for the cell line Lipo863B.Raw data not provided for patient samples due to patient privacy concerns.",
            "Platforms": "Platforms (2), GPL24676, Illumina NovaSeq 6000 (Homo sapiens), , GPL28975, GridION (Homo sapiens)",
            "Samples": {
                "GSM6049696": {
                    "link": "/geo/query/acc.cgi?acc=GSM6049696",
                    "name": "Lipo863B-rep1-RNAseq",
                    "Supplementary file": [
                        {
                            "file_name": "GSM6049696_Lipo863B-rep1.tpm.txt.gz",
                            "file_size": "249.2 Kb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM6049696&format=file&file=GSM6049696%5FLipo863B%2Drep1%2Etpm%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Mar 03, 2023",
                    "Title": "Lipo863B-rep1-RNAseq",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "disease state: Liposarcomacell line: Lipo863B",
                    "Growth protocol": "Liposarcoma cell lines were cultured in Dulbecco's Modified Eagle's Medium supplemented with 15% FBS and additional 1 mM GlutaMax supplement (ThermoFisher, 35050061).",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "20 mg of ground patient samples or 1.5 million liposarcoma cells were used for RNA-seq. The total RNA was extracted from Trizol according to the manufacturer’s protocol (Invitrogen). PolyA RNA was purified from 1,000 ng of total RNA using oligo (dT) beads (Invitrogen).Extracted RNA was first fragmented, then followed by reverse transcription, end-repair, adenylation, adaptor ligation, and subsequent PCR amplification. The final product was checked by size distribution and concentration using a BioAnalyzer High Sensitivity DNA Kit (Agilent) and Kapa Library Quantification Kit (Kapa Biosystems).",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina NovaSeq 6000",
                    "Description": "Cell Line",
                    "Data processing": "RNA-seq reads were aligned to hg38 genome assembly using STAR; The TPM value of gene expression was caculated using RSEM.ChIP-seq and ATAC-seq reads were aligned to hg38 genome assembly using Bowtie2;H3K27ac ChIP-Seq peaks were called using MACS2.Hi-C raw FASTQ files and then mapped the trimmed files against hg38 human reference genome using runHiC pipeline. Hi-C matrix was generated using cooler.WGS raw FASTQ files were first trimmed for adapter and then mapped against hg38 human reference genome using BWA-MEM algorithm (0.7.17-r1188). Duplicate reads were removed using Picard Tools.Nanopore raw FASTQ files were mapped against the hg38 reference genome using the minimap2. The structure variations were identified using Sniffles.Assembly: hg38 (GRCh38)Supplementary files format and content: tab-delimited text files include TPM values for each Sample; the bigwig files included sequencing reads enrichment signal for each Sample; The .cool file were the multi-resolution matrix of Hi-C for each Sample; the .vcf files included the structure variation information.",
                    "Platform ID": "GPL24676"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE201056_RAW.tar",
                    "file_size": "14.7 Gb",
                    "file_type": "TAR (of BIGWIG, BW, COOL, TXT, VCF)",
                    "download_link": "/geo/download/?acc=GSE201056&format=file"
                }
            ],
            "search_query": "well-differentiated AND liposarcoma"
        },
        "GSE184199": {
            "Status": "Public on Sep 17, 2021",
            "Title": "RNA-seq of four tissue samples of dedifferentiated liposarcoma and corresponding matched well-differentiated liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "Dedifferentiated liposarcoma (DDL) has the same cellular and molecular genetics features as well-differentiated liposarcoma (WDL), and there is still no ideal biomarker for the prediction of DDL patient prognosis in clinical practice. In order to explore the genes that cause WDL to obtain local invasion and distant metastasis capacities and transform it into DDL, The four DDL tissue specimens in this study were matched with four WDL tissue specimens according to baseline characteristics, such as gender, age, and recurrence, before high-throughput sequencing was conducted. Then total RNAs were subjected to RNA isolation and RNA-seq analyses were generated by deep sequencing using Illumina Hiseq.",
            "Overall design": "Four tissue samples of dedifferentiated liposarcoma and corresponding matched well-differentiated liposarcoma were selected for high-throughput RNA sequencing",
            "Platforms": "Platforms (1), GPL20301, Illumina HiSeq 4000 (Homo sapiens)",
            "Samples": {
                "GSM5580164": {
                    "link": "/geo/query/acc.cgi?acc=GSM5580164",
                    "name": "R1",
                    "Status": "Public on Sep 17, 2021",
                    "Title": "R1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "pathological types: Well-differentiated liposarcomaage: 79gender: Maleprimary/recurrence: Recurrencetumor size (mm): 128",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Tissue RNA was isolated using Trizol reagent.RNA libraries were prepared for sequencing using ribosomal RNA depletion RNA-seq protocols",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina HiSeq 4000",
                    "Data processing": "Illumina Casava1.7 software used for basecalling.Sequenced reads were trimmed for adaptor sequence, and masked for low-complexity or low-quality sequence, then mapped to hg38 whole genome using Hisat2Gene annotated in GencodeV25 were quantified using featureCountsGenome_build: hg38Supplementary_files_format_and_content: tab-delimited text files include FPKM values for each Sample",
                    "Platform ID": "GPL20301"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE184199_ALL_exp_FPKM.txt.gz",
                    "file_size": "1.9 Mb",
                    "file_type": "TXT",
                    "download_link": "/geo/download/?acc=GSE184199&format=file&file=GSE184199%5FALL%5Fexp%5FFPKM%2Etxt%2Egz"
                }
            ],
            "search_query": "liposarcoma AND prognostic factors"
        },
        "GSE145537": {
            "Status": "Public on Apr 26, 2021",
            "Title": "DNA G-quadruplexes modulate highly transcribed genes in human chromatin [RNA-seq]",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by high throughput sequencing",
            "Summary": "G4s are nucleic acids secondary structures that form in the presence of four or more runs of gunanine. In vitro results suggested that G4s are involved in the regulation of both transcription and replication processes. In vitro results suggested that G4s are involved in the regulation of both transcription 6–10 and replication 11–13 processes allowed to demonstrate the actual folding of G4s in live cells, but also inserted them in a more biologically relevant context. . In the present work we mapped G4s in the chromatin of a WD-LPS cell line (93T449), we integrated the information of G4 folding with their chromatin context, the transcriptional level of the associated genes and compared the results with data obtained in a cell line of different origin (HaCaT).",
            "Overall design": "Transcriptional analysis in untreated and c-exNDI treated 93T449 cells.",
            "Platforms": "Platforms (1), GPL18460, Illumina HiSeq 1500 (Homo sapiens)",
            "Samples": {
                "GSM4320558": {
                    "link": "/geo/query/acc.cgi?acc=GSM4320558",
                    "name": "RNAseq of 93T449 liposarcoma cell line rep1",
                    "Supplementary file": [
                        {
                            "file_name": "GSM4320558_NT_93T449_RNAseq_rep1_rsem.genes.results.txt.gz",
                            "file_size": "556.3 Kb",
                            "file_type": "TXT",
                            "download_link": "/geo/download/?acc=GSM4320558&format=file&file=GSM4320558%5FNT%5F93T449%5FRNAseq%5Frep1%5Frsem%2Egenes%2Eresults%2Etxt%2Egz"
                        }
                    ],
                    "Status": "Public on Apr 26, 2021",
                    "Title": "RNAseq of 93T449 liposarcoma cell line rep1",
                    "Sample type": "SRA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "cell line: 93T449genotype: amp12q14-15",
                    "Treatment protocol": "The G4-ligand c-exNDI was administered directly to the cell culture 24 h after cells seeding. Being the compound solubilized in DMSO, an equivalent amount of DMSO was administered to the non-treated control sample. c-exNDI is a core-extended napthalene diimide merged to a dihydrobenzophenazine polynuclear heterocycle to improve its solubility and interaction with G4 structures. The synthesis and structure of the coumpound were previously published in Perrone et al. J Med Chem. 2015.",
                    "Growth protocol": "93T449 cells were routinely subcultured with a 1:2 to 1:4 ratio using Trypsin-EDTA solution and typically kept into a T75 flask of uncoated plastic in RPMI 1640 medium (Gibco, Thermo Fisher Scientific, Waltham, MA, USA) supplemented with 10 % heat inactivated FBS.",
                    "Extracted molecule": "cDNA",
                    "Extraction protocol": "Total RNA was extracted with TRI Reagent® (Sigma Aldrich #93289) and RNA clean and concentrator kit (Zymo research #R1017), including the on-column DNAse step. Ribo-depletion with Ribozero goldkit (Illumina #MRZG126)NEBNext Ultra Directional RNA Library Prep kit for Illumina (NEB)",
                    "Library strategy": "RNA-Seq",
                    "Library source": "transcriptomic",
                    "Instrument model": "Illumina HiSeq 1500",
                    "Description": "93T449 cell line was established from a well-differentiated liposarcoma from the retroperitoneum of a 68 year old female.",
                    "Data processing": "Single end RNA-seq reads were mapped to the human genome (hg38) using STAR (Dobin et al., 2013). Expression of genes in FPKM was calculated with RSEM (Li et al., 2011).Genome_build: hg38Supplementary_files_format_and_content: NT_93T449_RNAseq_rep1_rsem.genes.results, NT_93T449_RNAseq_rep2_rsem.genes.results, NT_93T449_RNAseq_rep3_rsem.genes.results, Pham_93T449_RNAseq_rep1_rsem.genes.results, Pham_93T449_RNAseq_rep2_rsem.genes.results, Pham_93T449_RNAseq_rep3_rsem.genes.results. These Files were generated with RSEM",
                    "Platform ID": "GPL18460"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE145537_RAW.tar",
                    "file_size": "3.3 Mb",
                    "file_type": "TAR (of TXT)",
                    "download_link": "/geo/download/?acc=GSE145537&format=file"
                }
            ],
            "search_query": "well-differentiated AND liposarcoma"
        },
        "GSE21122": {
            "Status": "Public on Jul 06, 2010",
            "Title": "Whole-transcript expression data for soft-tissue sarcoma tumors and control normal fat specimens",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "Soft tissue sarcomas are aggressive mesenchymal cancers that affect more than 10,600 new patients per year in the US, about 40% of whom will die of their disease. Soft tissue sarcomas exhibit remarkable histologic diversity, with more than 50 recognized subtypes, but our knowledge of their genomic alterations is limited. Here we describe the results of an integrative analysis of DNA sequence, copy number, and mRNA expression in 207 samples encompassing seven major subtypes. Genes mutated in more than 5% of samples within a subtype were KIT (in gastrointestinal stromal cell tumors, or GISTs), TP53 (pleomorphic liposarcomas), PIK3CA (myxoid/round-cell liposarcoma), and NF1 (both myxofibrosarcoma and pleomorphic liposarcoma). We show evidence that PIK3CA mutations, found in 18% of myxoid/round-cell liposarcomas, activate AKT in vivo and are associated with poor outcomes. Point mutations in the tumor suppressor gene NF1 were discovered in both myxofibrosarcomas and pleomorphic liposarcomas, while genomic deletions were observed in all subtypes at varying frequencies. Finally, we found that short hairpin RNA-based knockdown of a subset of genes that are amplified in dedifferentiated liposarcoma, including CDK4 and YEATS4, decreased cell proliferation. Our study yields the most detailed map of molecular alterations across diverse sarcoma subtypes to date and provides potential subtype-specific targets for therapy.",
            "Overall design": "Human soft-tissue sarcoma specimens were profiled on Affymetrix U133A arrays per manufacturer's instructions.",
            "Platforms": "Platforms (1), GPL96, [HG-U133A] Affymetrix Human Genome U133A Array",
            "Samples": {
                "GSM528276": {
                    "link": "/geo/query/acc.cgi?acc=GSM528276",
                    "name": "Sarcoma tumor PT1DD",
                    "Supplementary file": [
                        {
                            "file_name": "GSM528276.CEL.gz",
                            "file_size": "3.4 Mb",
                            "file_type": "CEL",
                            "download_link": "/geo/download/?acc=GSM528276&format=file&file=GSM528276%2ECEL%2Egz"
                        }
                    ],
                    "Status": "Public on Jul 06, 2010",
                    "Title": "Sarcoma tumor PT1DD",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: Soft-tissue sarcomadisease status: Liposarcoma:Dedifferentiatedsample id: PT1DD",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "Total RNA was extracted from macro-dissected cryomolds and homogenized in QIAzol lysis reagent",
                    "Description": "Gene expression data from soft-tissue sarcoma tumor",
                    "Data processing": "Signal intensity data was generated with Affymetrix Microarray Suite version 5.0 software with default parameters. Expression values were estimated with robust multi-array average (RMA) using standard background correction. RMA-normalized expression data is provided in log base 2 scale.",
                    "Platform ID": "GPL96"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE21122_RAW.tar",
                    "file_size": "545.1 Mb",
                    "file_type": "TAR (of CEL)",
                    "download_link": "/geo/download/?acc=GSE21122&format=file"
                }
            ]
        },
        "GSE159659": {
            "Status": "Public on Mar 10, 2021",
            "Title": "Genomic characterization of well differentiated/dedifferentiated retroperitoneal liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "An integrated profiling approach was performed to define molecular alterations associated to the aggressive behavior of retroperitoneal dedifferentiated liposarcoma. In particular, matched well and dedifferentiated components as well as normal adipose tissues, obtained from the same tumor sites, were comparatively investigated to higlight differences in gene expression.",
            "Overall design": "Gene expression of dedifferentiated, well differentiated and normal adipose tissue was generated using clarioms array",
            "Platforms": "Platforms (1), GPL23159, [Clariom_S_Human] Affymetrix Clariom S Assay, Human (Includes Pico Assay)",
            "Samples": {
                "GSM4837048": {
                    "link": "/geo/query/acc.cgi?acc=GSM4837048",
                    "name": "dedifferentiated liposarcoma, patient 5",
                    "Supplementary file": [
                        {
                            "file_name": "GSM4837048_JX65.CEL.gz",
                            "file_size": "1.1 Mb",
                            "file_type": "CEL",
                            "download_link": "/geo/download/?acc=GSM4837048&format=file&file=GSM4837048%5FJX65%2ECEL%2Egz"
                        }
                    ],
                    "Status": "Public on Mar 10, 2021",
                    "Title": "dedifferentiated liposarcoma, patient 5",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: dedifferentiated liposarcoma",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "RNA was extracted from snap-frozen tissues using Qiagen RNeasy kit purification performed according to the manufacturer's instructions.",
                    "Description": "gene expression data from retroperitoneal liposarcoma patient",
                    "Data processing": "Arrays were RMA normalized (Irizarry et al. 2003) and differential expression determined using the following R packages from the Bioconductor project: oligo (Carvalho et al. 2010), limma (Smyth 2004).",
                    "Platform ID": "GPL23159"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE159659_RAW.tar",
                    "file_size": "47.7 Mb",
                    "file_type": "TAR (of CEL)",
                    "download_link": "/geo/download/?acc=GSE159659&format=file"
                }
            ]
        },
        "GSE30929": {
            "Status": "Public on Sep 02, 2011",
            "Title": "Whole-transcript expression data for liposarcoma",
            "Organism": "Homo sapiens",
            "Experiment type": "Expression profiling by array",
            "Summary": "Liposarcoma is the most common soft tissue sarcoma, accounting for about 20% of cases. Liposarcoma is classified into 5 histologic subtypes that fall into 3 biological groups characterized by specific genetic alterations. To identify genes that contribute to liposarcomagenesis and to better predict outcome for patients with the disease, we undertook expression profiling of liposarcoma. U133A expression profiling was performed on 140 primary liposarcoma samples, which were randomly split into training set (n=95) and test set (n=45). A multi-gene predictor for distant recurrence-free survival (DRFS) was developed using the supervised principal component method. Expression levels of the 588 genes in the predictor were used to calculate a risk score for each patient. In validation of the predictor in the test set, patients with low risk score had a 3-year DRFS of 83% vs. 45% for high risk score patients (P=0.001). The hazard ratio for high vs. low score, adjusted for histologic subtype, was 4.42 (95% confidence interval 1.26-15.55; P=0.021). The concordance probability for risk score was 0.732.  Genes related to adipogenesis, DNA replication, mitosis, and spindle assembly checkpoint control were all highly represented in the multi-gene predictor. Three genes from the predictor, TOP2A, PTK7, and CHEK1, were found to be overexpressed in liposarcoma samples of all five subtypes and in liposarcoma cell lines. Knockdown of these genes in liposarcoma cell lines reduced proliferation and invasiveness and increased apoptosis. Thus, genes identified from this predictor appear to have roles in liposarcomagenesis and have promise as therapeutic targets. In addition, the multi-gene predictor will improve risk stratification for individual patients with liposarcoma.",
            "Overall design": "140 human liposarcoma specimens were profiled on Affymetrix U133A arrays per manufacturer's instructions.",
            "Platforms": "Platforms (1), GPL96, [HG-U133A] Affymetrix Human Genome U133A Array",
            "Samples": {
                "GSM766533": {
                    "link": "/geo/query/acc.cgi?acc=GSM766533",
                    "name": "Sarcoma tumor DD0728",
                    "Supplementary file": [
                        {
                            "file_name": "GSM766533.CEL.gz",
                            "file_size": "3.4 Mb",
                            "file_type": "CEL",
                            "download_link": "/geo/download/?acc=GSM766533&format=file&file=GSM766533%2ECEL%2Egz"
                        }
                    ],
                    "Status": "Public on Sep 02, 2011",
                    "Title": "Sarcoma tumor DD0728",
                    "Sample type": "RNA",
                    "Organism": "Homo sapiens",
                    "Characteristics": "tissue: primary liposarcomasubtype: dedifferentiatedsample id: DD0728trainingtest: Trainingdrfs: FALSEtt.drfs: 32.95",
                    "Treatment protocol": "None.",
                    "Growth protocol": "None.",
                    "Extracted molecule": "total RNA",
                    "Extraction protocol": "Total RNA was extracted from macro-dissected cryomolds and homogenized in QIAzol lysis reagent.",
                    "Description": "Soft-tissue sarcomaRe-analysis of GSM528276",
                    "Data processing": "Signal intensity was generated with Affymetrix Microarray Suite v5 software, and expression was estimated with robust multi-array average (RMA).",
                    "Platform ID": "GPL96"
                }
            },
            "Supplementary file": [
                {
                    "file_name": "GSE30929_RAW.tar",
                    "file_size": "477.0 Mb",
                    "file_type": "TAR (of CEL)",
                    "download_link": "/geo/download/?acc=GSE30929&format=file"
                }
            ]
        }
    }
}