{
    "Part 1": [
        {
            "task_id": "Part 1-dry-experiment-1",
            "task_description": "Perform data normalization on RNA sequencing data from liposarcoma tissues and normal adipose tissues using the TMM method in the edgeR package.",
            "input": "Raw count data from the supplementary file 'GSE202361_AllSamples_rawcount.txt.gz', which contains RNA sequencing data of sarcoma tumor tissues. This file requires unzipping and importing into the analysis environment.",
            "output": "Normalized RNA sequencing data, processed using the TMM method, suitable for further analysis of differential gene expression."
        },
        {
            "task_id": "Part 1-dry-experiment-2",
            "task_description": "Identify differentially expressed genes (DEGs) between liposarcoma tissues and normal adipose tissues using GEO2R.",
            "input": "Normalized RNA sequencing data uploaded to GEO2R, with selected comparison groups (liposarcoma vs. normal adipose). Parameters set include a p-value cutoff at 0.05 and log2 fold change cutoff at 1.",
            "output": "List of DEGs with significant changes in expression, exported in a suitable format (e.g., CSV or Excel) for further analysis."
        },
        {
            "task_id": "Part 1-dry-experiment-3",
            "task_description": "Conduct functional annotation of DEGs using the DAVID Bioinformatics Resources.",
            "input": "List of DEGs obtained from the previous step, with species selected as 'Homo sapiens'.",
            "output": "Functional annotation results including biological processes, molecular functions, and cellular components associated with the DEGs, exported for further analysis."
        },
        {
            "task_id": "Part 1-dry-experiment-4",
            "task_description": "Perform pathway enrichment analysis using the KEGG database.",
            "input": "List of DEGs from the previous step to be input into the KEGG pathway analysis tool, with parameters set to a p-value threshold at 0.05, adjusted for multiple testing using the Benjamini-Hochberg method.",
            "output": "List of significantly enriched pathways associated with the DEGs, highlighting key pathways related to liposarcoma, suitable for further investigation."
        }
    ],
    "Part 2": [
        {
            "task_id": "Part 2-dry-experiment-1",
            "task_description": "Analyze RNA sequencing data using available datasets.",
            "input": "GSE202361 dataset for expression profiling of immune markers specific to liposarcoma, including raw count data in a matrix format (e.g., rows as genes and columns as samples).",
            "output": "Extracted expression profiles of immune markers and relevant samples based on immune response characteristics, provided in a structured data frame format with relevant metadata."
        },
        {
            "task_id": "Part 2-dry-experiment-2",
            "task_description": "Preprocess the raw count data.",
            "input": "Raw count data from GSE202361 and GSE205492, including treatment and control samples in matrix format.",
            "output": "Preprocessed count data, filtered for low-quality reads (e.g., reads with quality scores below Q20), normalized using TMM (Trimmed Mean of M-values), and duplicates removed, resulting in a clean count matrix."
        },
        {
            "task_id": "Part 2-dry-experiment-3",
            "task_description": "Perform differential gene expression analysis focusing on immune-related genes using the DESeq2 package.",
            "input": "Preprocessed count data from both GSE202361 and GSE205492, with the design matrix comparing tumor samples against normal adipose tissues; analysis parameters include an alpha value of 0.05 and log2 fold change threshold of 1.0.",
            "output": "List of significantly differentially expressed immune-related genes with associated statistics, including p-values, log2 fold changes, and adjusted p-values, formatted as a data frame."
        },
        {
            "task_id": "Part 2-dry-experiment-4",
            "task_description": "Conduct gene set enrichment analysis (GSEA) to identify immune pathways relevant to liposarcoma.",
            "input": "Differentially expressed immune-related genes from the DESeq2 analysis as input, along with MSigDB (Molecular Signatures Database) for pathway definitions; include a gene list in a text or CSV format.",
            "output": "Enriched immune pathways relevant to liposarcoma, including pathway names, enrichment scores, and significance levels based on false discovery rate (FDR), presented in a tabular format."
        },
        {
            "task_id": "Part 2-dry-experiment-5",
            "task_description": "Compare GSEA findings with existing datasets to validate identified immune pathways.",
            "input": "GSEA results and previously published datasets (GSE243904 and GSE243759) for cross-comparison, provided in a structured format for analysis.",
            "output": "Summary report detailing consistent immune markers or pathways across datasets, including discrepancies, potential reasons for differences, and visualizations of pathway overlaps, formatted as a document or presentation."
        },
        {
            "task_id": "Part 2-dry-experiment-6",
            "task_description": "Integrate specific immune markers such as PD-1 and CTLA-4 into the analysis.",
            "input": "Expression data for PD-1 and CTLA-4 from the collected datasets, alongside overall immune response data, clinical outcomes defined by patient response categories (e.g., responders vs. non-responders).",
            "output": "Correlation analysis report detailing expression levels of immune checkpoint markers, their association with clinical outcomes, and potential therapeutic implications, formatted as a comprehensive report."
        }
    ],
    "Part 3": [
        {
            "task_id": "Part 3-dry-experiment-1",
            "task_description": "Prepare the input data for CIBERSORTx by downloading and formatting RNA sequencing expression data from two datasets (GSE202361 and GSE205492). This includes ensuring the data is correctly normalized and structured.",
            "input": "Normalized RNA sequencing expression data from GSE202361 (RNA sequencing data from neoadjuvant immune checkpoint blockade in liposarcoma) and GSE205492 (RNA sequencing analysis of NK cells, T cells, and tumor from matched soft tissue sarcoma). The data should be in a gene expression matrix format (CSV or Excel) with genes as rows and samples as columns, preferably in TPM (Transcripts Per Million) format, with appropriate headers.",
            "output": "A formatted gene expression matrix ready for input into CIBERSORTx, containing gene expression data with genes as rows and samples as columns, saved in a CSV or Excel file format."
        },
        {
            "task_id": "Part 3-dry-experiment-2",
            "task_description": "Run CIBERSORTx using the prepared gene expression matrix and the default signature matrix (LM22) to estimate immune cell proportions. This analysis will provide insights into the immune landscape of liposarcoma samples.",
            "input": "The formatted gene expression matrix prepared in the previous step, along with the default signature matrix (LM22) for 22 immune cell types. The analysis will employ parameters such as 'quantile normalization' and 'absolute mode'.",
            "output": "A table of estimated immune cell proportions for each sample, detailing the proportions of the 22 immune cell types estimated by CIBERSORTx, provided in a tabular format (CSV or Excel) that includes both cell type names and their respective proportions."
        },
        {
            "task_id": "Part 3-dry-experiment-3",
            "task_description": "Perform a correlation analysis between estimated immune cell types from CIBERSORTx and differentially expressed genes (DEGs) identified in Part 1. This analysis aims to uncover relationships between immune cell infiltration and gene expression levels.",
            "input": "Estimated immune cell proportions obtained from CIBERSORTx and expression levels of differentially expressed genes (DEGs) identified in Part 1. The statistical analysis will utilize methods such as Spearman or Pearson correlation coefficients to assess the relationships.",
            "output": "A set of correlation coefficients assessing the relationships between immune cell proportions and the expression levels of DEGs, including significance levels (p < 0.05). The results will be presented in a table format along with a heatmap visualizing significant correlations, generated using appropriate visualization software."
        },
        {
            "task_id": "Part 3-dry-experiment-4",
            "task_description": "Evaluate the relationship between immune cell composition and patient prognosis by collecting clinical outcome data and conducting survival analysis. This will help identify potential prognostic markers.",
            "input": "Clinical outcome data from patient records associated with the liposarcoma samples, including overall survival and disease-free survival times and events, along with the estimated immune cell proportions from CIBERSORTx. The data should be structured in a format suitable for survival analysis (e.g., CSV).",
            "output": "Kaplan-Meier survival curves assessing the impact of specific immune cell types on overall survival and disease-free survival. The analysis will include statistical results from log-rank tests comparing survival distributions based on high versus low immune cell infiltration levels, presented in graphical format (e.g., plots) along with a summary table of results."
        }
    ],
    "Part 4": [
        {
            "task_id": "Part 4-dry-experiment-1",
            "task_description": "Perform quality control (QC) on the single-cell RNA sequencing data to filter out poor-quality cells, ensuring high-quality profiles for downstream analysis.",
            "input": "Single-cell RNA sequencing datasets, including GSE202361 and the single-cell RNA sequencing dataset from 10 cases. These datasets will be in formats such as .txt, .csv, or .h5ad containing raw count data, with a typical structure including gene expression matrices with cell identifiers and gene names.",
            "output": "A filtered single-cell RNA sequencing dataset containing only high-quality cells, represented as a data frame or an AnnData object. The output will exclude cells with fewer than 200 detected genes and those with more than 10% mitochondrial gene expression, thus ensuring that the dataset is suitable for further integration and analysis."
        },
        {
            "task_id": "Part 4-dry-experiment-2",
            "task_description": "Use the 'scrublet' tool for doublet detection to identify and remove cells that exhibit doublet scores above 0.25, enhancing the quality of the dataset.",
            "input": "The filtered single-cell RNA sequencing dataset from the previous step, which is in the format of a data frame, AnnData object, or similar, containing gene expression data for individual cells.",
            "output": "A further filtered single-cell RNA sequencing dataset with doublets removed, resulting in a clean dataset ready for integration, represented as a data frame or AnnData object. The output will include metadata indicating which cells were classified as doublets."
        },
        {
            "task_id": "Part 4-dry-experiment-3",
            "task_description": "Integrate the filtered single-cell RNA sequencing data with bulk RNA sequencing data using Seurat or similar tools, applying canonical correlation analysis (CCA) for robust integration.",
            "input": "Filtered single-cell RNA sequencing dataset and bulk RNA sequencing datasets from GSE205492 and GSE243904, which may be in formats such as .txt, .csv, or .h5ad containing gene expression data. Each dataset should include cell or sample identifiers and corresponding gene expression values.",
            "output": "An integrated dataset that combines single-cell and bulk RNA sequencing data, ideally represented as a Seurat object or an AnnData object. This output facilitates further analysis and visualization of the combined dataset."
        },
        {
            "task_id": "Part 4-dry-experiment-4",
            "task_description": "Normalize each dataset separately using the 'LogNormalize' method with a scale factor of 10,000 to ensure comparability across the datasets.",
            "input": "The integrated dataset from the previous step, which includes both single-cell and bulk RNA sequencing data in a compatible format.",
            "output": "A normalized integrated dataset where the expression levels have been adjusted using the 'LogNormalize' method, providing a standardized format for downstream analysis. The output will maintain the structure of the input dataset but will contain normalized expression values."
        },
        {
            "task_id": "Part 4-dry-experiment-5",
            "task_description": "Identify anchors for integration with a minimum of 30 anchors and assess the quality of integration using UMAP or t-SNE to visualize the clustering of cells from different datasets.",
            "input": "The normalized integrated dataset from the previous step, ready for anchor identification and visualization.",
            "output": "An integrated UMAP or t-SNE plot visualizing the quality of integration, indicating how well the cells from different datasets cluster together, typically saved as a visual output such as a PNG or PDF file. The visualization will highlight distinct clusters and their relationships."
        },
        {
            "task_id": "Part 4-dry-experiment-6",
            "task_description": "Analyze specific immune cell subpopulations within the tumor microenvironment using predefined immune cell marker genes to classify cells into various immune subpopulations.",
            "input": "The integrated dataset with normalized expression data and a list of predefined immune cell marker genes (e.g., CD3, CD4, CD8, CD19, CD56) to facilitate classification.",
            "output": "A categorized dataset with cell types classified into various immune subpopulations, along with proportions of each immune cell type across the samples. The results will be visualized in formats such as violin plots or bar charts, providing insights into the distribution of immune cells."
        },
        {
            "task_id": "Part 4-dry-experiment-7",
            "task_description": "Identify unique cellular interactions using tools like CellChat or NicheNet to infer communication networks based on expression of ligand-receptor pairs, focusing on interactions involving immune cells and tumor cells.",
            "input": "The categorized integrated dataset along with information on ligand-receptor pairs for cellular interaction analysis, which may include a priori knowledge of known interactions.",
            "output": "A network diagram summarizing cellular interactions, highlighting key pathways and potential therapeutic targets based on the interactions inferred from the dataset. This output may also include a detailed report on the identified interactions and their biological significance."
        }
    ],
    "Part 5": [
        {
            "task_id": "Part 5-dry-experiment-1",
            "task_description": "Perform survival analysis using Kaplan-Meier survival curves to evaluate the prognostic significance of immune markers, specifically PD-1 and CTLA-4.",
            "input": "Clinical data from the GSE202361 dataset, including patient outcome information (e.g., overall survival) and expression levels of immune markers (type: csv or data frame).",
            "output": "Kaplan-Meier survival curves visualizing differences in survival between groups of patients characterized by high and low expression of key immune markers, along with log-rank test results indicating statistical significance (type: plots and statistical test results)."
        },
        {
            "task_id": "Part 5-dry-experiment-2",
            "task_description": "Conduct correlation analysis between immune cell compositions and clinical outcomes, adjusting for confounding factors such as age, sex, and treatment type.",
            "input": "Immune cell proportions data generated from CIBERSORTx and clinical outcome data such as overall survival and progression-free survival (type: csv or data frame).",
            "output": "Correlation coefficients (Pearson or Spearman) indicating the strength and direction of relationships between immune cell proportions and clinical outcomes, accompanied by scatter plots of significant correlations, along with adjusted multivariate regression analysis results (type: numerical values, regression model output, and visualizations)."
        },
        {
            "task_id": "Part 5-dry-experiment-3",
            "task_description": "Review literature to identify potential immunotherapy strategies based on immune microenvironment characteristics and the response of liposarcoma to immunotherapies targeting immune checkpoints.",
            "input": "Findings from previous parts regarding immune markers and cell types that correlated with improved patient outcomes, along with relevant studies such as those by Smith et al. (2020) and Johnson et al. (2021) (type: text documents, articles, and findings).",
            "output": "A proposed set of candidate immunotherapy strategies based on identified immune markers, including references to relevant literature and a summary of their implications for treatment (type: text summary and list of strategies)."
        },
        {
            "task_id": "Part 5-dry-experiment-4",
            "task_description": "Develop a multivariate prognostic model using Cox proportional hazards regression based on immune markers, immune cell compositions, and clinical data.",
            "input": "Immune markers, immune cell composition results, clinical data (e.g., age, sex, treatment type), and relevant covariates for liposarcoma patients (type: csv or data frame).",
            "output": "A multivariate prognostic model including risk scores, statistical outputs such as the concordance index (C-index), and calibration plots to evaluate model performance, along with stratified survival outcomes based on risk scores (type: model output and visualizations)."
        },
        {
            "task_id": "Part 5-dry-experiment-5",
            "task_description": "Summarize key findings regarding immune microenvironment characteristics and propose future clinical applications, particularly in personalized immunotherapy.",
            "input": "Results and findings from the previous analyses including immune markers, cell compositions, and literature review (type: text documents and analysis results).",
            "output": "A comprehensive summary report discussing the implications of findings for personalized immunotherapy, potential future research directions, and references to clinical guidelines such as those from the National Comprehensive Cancer Network (type: text summary and recommendations)."
        }
    ]
}