{
    "Part 1": [
        {
            "task_id": "Part 1-dry-experiment-1",
            "task_description": "Normalize the RNA sequencing data from liposarcoma and normal adipose tissues using the DESeq2 package to account for differences in sequencing depth.",
            "input": "Raw count data from datasets GSE21122, GSE159659, GSE30929, and GSE159848, organized in a matrix format (e.g., CSV or TSV) where rows represent genes and columns represent samples, with no missing values.",
            "output": "A DESeqDataSet object containing normalized counts, size factors, and relevant metadata, with dimensions indicating the number of genes and samples."
        },
        {
            "task_id": "Part 1-dry-experiment-2",
            "task_description": "Identify differentially expressed genes (DEGs) using the DESeq2 package, focusing on genes with significant expression changes between liposarcoma and normal tissues.",
            "input": "The DESeqDataSet object from the previous step, with parameters set for 'fitType' = 'local' and 'betaPrior' = TRUE.",
            "output": "A data frame of DEGs containing columns for gene names, log2 fold change, adjusted p-values, and other relevant statistics, filtered by adjusted p-value < 0.05 and absolute log2 fold change > 1."
        },
        {
            "task_id": "Part 1-dry-experiment-3",
            "task_description": "Conduct functional annotation of DEGs using the DAVID Bioinformatics Resources for gene ontology (GO) analysis to understand their biological significance.",
            "input": "List of DEGs obtained from the previous step, submitted to the DAVID analysis tool with parameters set: 'Species' = 'Homo sapiens', 'Method' = 'Count', 'Annotation' = 'GOTERM_BP_ALL'.",
            "output": "Results from the DAVID analysis tool, including a summary of the top enriched GO terms related to biological processes and their associated DEGs, presented in a tabular format."
        },
        {
            "task_id": "Part 1-dry-experiment-4",
            "task_description": "Perform pathway enrichment analysis using the KEGG and Reactome databases with the clusterProfiler package to identify key signaling pathways involved in liposarcoma.",
            "input": "List of DEGs obtained from the previous step, analyzed with the clusterProfiler package, with parameters set: 'pvalueCutoff' = 0.05 and 'qvalueCutoff' = 0.05.",
            "output": "A list of enriched pathways along with their significance levels (p-values and q-values) and the DEGs involved in each pathway, formatted as a table for easy interpretation."
        }
    ],
    "Part 2": [
        {
            "task_id": "Part 2-dry-experiment-1",
            "task_description": "Prepare the gene expression matrix from bulk RNA sequencing data for datasets GSE202361 and GSE205492.",
            "input": "Bulk RNA sequencing data from GSE202361 and GSE205492 available in CSV or TSV format, containing raw gene expression counts with gene names as rows and sample IDs as columns.",
            "output": "A normalized gene expression matrix in TPM (Transcripts Per Million) format, structured as a matrix where rows represent genes and columns represent samples. The output will be saved in a CSV file format for further analysis."
        },
        {
            "task_id": "Part 2-dry-experiment-2",
            "task_description": "Upload the normalized gene expression matrix to CIBERSORTx for deconvolution.",
            "input": "The normalized gene expression matrix in TPM format prepared in the previous step, along with the LM22 signature matrix provided by CIBERSORTx, which contains the expression profiles of 22 immune cell types.",
            "output": "Estimated proportions of 22 immune cell types in each sample, returned as a matrix or data frame containing the immune cell type proportions for each sample analyzed. The output will be downloadable as a CSV file."
        },
        {
            "task_id": "Part 2-dry-experiment-3",
            "task_description": "Perform correlation analysis between estimated immune cell types obtained from CIBERSORTx and identified differentially expressed genes (DEGs).",
            "input": "Immune cell type proportions from CIBERSORTx and expression levels of significant DEGs identified from Part 1, with a threshold of adjusted p-value < 0.05 and log2 fold change > 1. Both inputs will be in matrix or data frame format, containing numerical values for correlation computation.",
            "output": "Correlation coefficients (e.g., Pearson or Spearman) between immune cell proportions and expression levels of DEGs, presented in a summary matrix or data frame. Additionally, visual representations such as heatmaps and scatter plots will be generated and saved in appropriate image formats (e.g., PNG, PDF)."
        },
        {
            "task_id": "Part 2-dry-experiment-4",
            "task_description": "Conduct a statistical evaluation of the association between the immune landscape and clinical outcomes.",
            "input": "Clinical data associated with the samples analyzed, including patient survival data, treatment responses, and other relevant clinical parameters, stored in tabular format (CSV or TSV). This data will include variables such as age, sex, tumor grade, and survival time.",
            "output": "Results of the statistical tests (e.g., log-rank test) assessing the correlation between immune cell composition and clinical outcomes, presented as Kaplan-Meier survival curves and hazard ratios. The results will be summarized in a report format along with visualizations, which will be available in both CSV and image file formats."
        }
    ],
    "Part 3": [
        {
            "task_id": "Part 3-dry-experiment-1",
            "task_description": "Compile a list of immune-related genes from established databases.",
            "input": "Gene lists from established databases such as ImmPort, KEGG, and Reactome related to immune responses in soft tissue sarcomas, typically in CSV or TXT format.",
            "output": "A compiled list of immune-related genes relevant to liposarcoma, including at least 50 genes confirmed by peer-reviewed literature, formatted as a CSV file."
        },
        {
            "task_id": "Part 3-dry-experiment-2",
            "task_description": "Filter the list of immune-related genes based on specific criteria.",
            "input": "Initial list of immune-related genes (CSV format) and criteria including expression levels (minimum 1 TPM in at least 50% of samples) and documentation from at least three peer-reviewed articles.",
            "output": "Finalized list of immune-related genes that meet the specified criteria, outputted as a CSV file."
        },
        {
            "task_id": "Part 3-dry-experiment-3",
            "task_description": "Normalize raw counts of RNA sequencing data using the DESeq2 package.",
            "input": "Raw counts of RNA sequencing data from datasets GSE202361, GSE205492, and GSE243904, provided in a raw count matrix format (e.g., TXT or CSV) along with design formula parameters including treatment conditions and batch effects.",
            "output": "Normalized gene expression data in a matrix format (e.g., CSV), ready for differential expression analysis."
        },
        {
            "task_id": "Part 3-dry-experiment-4",
            "task_description": "Conduct differential expression analysis on selected immune-related genes.",
            "input": "Normalized gene expression data (matrix format) and the finalized list of immune-related genes (CSV format).",
            "output": "A list of differentially expressed immune-related genes with significance levels (FDR < 0.05 and log2 fold change ≥ 1), outputted in a tabular format (CSV)."
        },
        {
            "task_id": "Part 3-dry-experiment-5",
            "task_description": "Generate a heatmap of differentially expressed immune-related genes.",
            "input": "List of differentially expressed immune-related genes and their expression levels across samples, provided in a matrix format (e.g., CSV).",
            "output": "A visual heatmap representing the expression patterns of differentially expressed immune-related genes across the samples, saved as an image file (e.g., PNG or PDF)."
        },
        {
            "task_id": "Part 3-dry-experiment-6",
            "task_description": "Analyze expression patterns of differentially expressed immune-related genes.",
            "input": "List of differentially expressed immune-related genes (CSV format) and their expression data.",
            "output": "A comprehensive analysis report discussing the roles of these genes in immune response mechanisms, presented as a PDF document."
        },
        {
            "task_id": "Part 3-dry-experiment-7",
            "task_description": "Examine the relationship between gene expression and clinical outcomes.",
            "input": "Expression data of differentially expressed genes (CSV format) and clinical outcome data from databases like TCGA (CSV format).",
            "output": "An analysis report detailing the correlation between gene expression levels and clinical outcomes in liposarcoma patients, provided as a PDF document."
        },
        {
            "task_id": "Part 3-dry-experiment-8",
            "task_description": "Reference literature to support claims regarding immune-related genes.",
            "input": "Findings from the analysis of gene expression patterns and at least five peer-reviewed studies related to immune-related genes in liposarcoma.",
            "output": "A discussion document that incorporates literature references to substantiate claims about the roles of specific immune-related genes in liposarcoma, formatted as a PDF."
        }
    ],
    "Part 4": [
        {
            "task_id": "Part 4-dry-experiment-1",
            "task_description": "Normalize RNA sequencing data from relevant datasets (GSE202361, GSE205492, GSE243904, GSE243759) to convert raw counts to transcripts per million (TPM).",
            "input": "Raw RNA sequencing count data from datasets GSE202361, GSE205492, GSE243904, and GSE243759, typically in the form of a matrix (CSV or Excel format) with genes as rows and samples as columns. The data should not contain any low-quality or missing values.",
            "output": "Normalized RNA sequencing data formatted in a CSV file with sample IDs as the first column and corresponding TPM values for each immune cell type, suitable for input into CIBERSORTx, ensuring data integrity and consistency."
        },
        {
            "task_id": "Part 4-dry-experiment-2",
            "task_description": "Import the normalized data into CIBERSORTx and select the appropriate parameters for immune cell composition analysis.",
            "input": "Normalized RNA sequencing data in CSV format, and the choice of reference signature matrix (e.g., LM22) along with selected parameters: the 'quantitative' option for absolute counts, a P-value threshold of 0.05, and bootstrapping method (e.g., 1000 iterations).",
            "output": "Results from CIBERSORTx provided in a downloadable CSV file, containing immune cell proportion data for each liposarcoma sample, with sample IDs and estimated proportions of each immune cell type."
        },
        {
            "task_id": "Part 4-dry-experiment-3",
            "task_description": "Perform correlation analysis between immune cell signatures obtained from CIBERSORTx and patient prognosis data including survival outcomes.",
            "input": "Immune cell proportion data from CIBERSORTx in CSV format and corresponding patient prognosis data (e.g., survival outcomes, clinicopathological features) also formatted in a CSV file, ensuring that both datasets are aligned by sample IDs.",
            "output": "Statistical analysis results including correlation coefficients computed using the Spearman correlation method, presented in a report format (PDF or Word document) along with visualizations (e.g., correlation plots) generated by statistical analysis software."
        },
        {
            "task_id": "Part 4-dry-experiment-4",
            "task_description": "Document findings from the correlation analysis, including significant correlations and their statistical significance.",
            "input": "Results from the correlation analysis, including identified correlation coefficients, p-values, and visualizations from the previous task.",
            "output": "A comprehensive summary report detailing significant correlations between immune cell types and patient prognosis, including statistical significance, interpretations, and potential biological implications."
        },
        {
            "task_id": "Part 4-dry-experiment-5",
            "task_description": "Review relevant literature to support findings from the correlation analysis.",
            "input": "Identified immune cell types and their correlation with prognostic factors, references to studies such as Smith et al. (2020) and Johnson et al. (2021), and search terms for literature database searches.",
            "output": "A literature review document summarizing existing studies related to the findings, including implications for treatment strategies, potential immunotherapies, and suggestions for future research directions."
        }
    ],
    "Part 5": [
        {
            "task_id": "Part 5-dry-experiment-1",
            "task_description": "Acquire and preprocess single-cell RNA sequencing data from the relevant dataset GSE202361.",
            "input": "Single-cell RNA sequencing data from GSE202361 in a suitable format (.h5ad or .csv) containing gene expression measurements for individual cells.",
            "output": "Preprocessed single-cell RNA sequencing data, formatted as a data frame or matrix, ready for quality control and normalization."
        },
        {
            "task_id": "Part 5-dry-experiment-2",
            "task_description": "Perform quality control on single-cell RNA sequencing data by filtering low-quality cells.",
            "input": "Preprocessed single-cell RNA sequencing data, including gene detection counts for each cell (number of genes detected and percentage of mitochondrial content).",
            "output": "Filtered single-cell RNA sequencing data retaining cells with at least 200 genes detected and less than 20% mitochondrial content, formatted as a data frame or matrix."
        },
        {
            "task_id": "Part 5-dry-experiment-3",
            "task_description": "Normalize the filtered single-cell RNA sequencing data using the 'LogNormalize' method.",
            "input": "Filtered single-cell RNA sequencing data in the form of a data frame or matrix.",
            "output": "Normalized single-cell RNA sequencing data, with gene expression measurements adjusted by unique molecular identifiers (UMIs) and scaled to a factor of 10,000, provided as a data frame or matrix."
        },
        {
            "task_id": "Part 5-dry-experiment-4",
            "task_description": "Utilize dimensionality reduction techniques (PCA and UMAP) for visualization of cellular heterogeneity.",
            "input": "Normalized single-cell RNA sequencing data formatted as a data frame or matrix.",
            "output": "Dimensionality reduced data visualized using PCA and UMAP, including plots showing cellular clusters and the coordinates for each cell in reduced dimensions."
        },
        {
            "task_id": "Part 5-dry-experiment-5",
            "task_description": "Conduct correlation analysis between single-cell RNA sequencing data and bulk RNA-seq findings.",
            "input": "Single-cell RNA sequencing data, bulk RNA-seq data from datasets GSE21122 and GSE159659, and a predefined list of immune-related genes.",
            "output": "Spearman correlation analysis results, presented as a correlation matrix, along with generated heatmaps and correlation plots illustrating significant relationships between expression levels of immune-related genes in bulk data and identified cell types."
        },
        {
            "task_id": "Part 5-dry-experiment-6",
            "task_description": "Retrieve expression levels of immune-related genes for each identified cell type from the single-cell analysis.",
            "input": "Single-cell RNA sequencing data, a list of immune-related genes, and the cell type classifications from the analysis.",
            "output": "Expression levels of immune-related genes categorized by cell type, summarized in a structured table detailing gene names, expression levels, and functional roles."
        },
        {
            "task_id": "Part 5-dry-experiment-7",
            "task_description": "Integrate findings from single-cell and bulk RNA sequencing analyses into a cohesive conclusion.",
            "input": "Results from single-cell and bulk RNA sequencing analyses, including expression data, correlation results, and insights into immune-related gene functions.",
            "output": "A comprehensive conclusion discussing potential therapeutic strategies, methodologies used in the analyses, and recommendations for future research based on integrated findings, presented in a report format."
        }
    ]
}